[{"title": "Juniper Group acquires SysArc Infomatix", "link": "https://velasoftwaregroup.com/juniper-group-acquires-sysarc-infomatix/", "date": "3 January, 2023", "content": "\n<p>Chennai, December 20th, 2022 – This transaction is the second acquisition completed by TSI since it joined Juniper Group in 2020, being the first acquisition in its core markets, US and India. TSI, servicing some of the leading financial institutions in the world, will be able to strengthen its value proposition to its customers with SysArc Infomatix’s innovative lending solutions who, in turn, will materially benefit from Juniper Group’s and Vela Software’s core markets’ knowledge and industry expertise.<br/>SysArc Infomatix, with more than two decades of industry expertise, is an undisputed market leader in lending automation systems. They strive in providing secure and scalable lending solutions to a broader financial spectrum, having 50+ customers, including blue-chip and public clients, across US, India and Middle East.<br/>Mr. Karthik Doraiswamy, CEO of TSI, stated: “The acquisition of SysArc brings us the software solutions which will augment the products and services provided by TSI to our customers. With the vision of becoming the leading provider of FinTech solutions across the world, SysArc has developed great products with cutting-edge technologies that now help leading banks in lending automation”.<br/>Mr. Sundar Garg, CEO of SysArc Infomatix commented: “On the sound business principle of enhancing customer service, the acquisition will be welcome news to the customer community SysArc serves. With market domination in the Indian lending space and niche markets in the US and the Middle East, SysArc is poised for exponential growth in the years to come. A fusion of the two managements is bound to bring new ideas, creativity, and innovation. Having started and run the company since its inception, I am delighted to hand over the baton to Karthik Doraiswamy with the confidence and strong belief that the new management team will be driven by the continued focus on customer care and travel on a path of accelerated growth. I wish the new executives the very best”. Mr. Garg will continue providing support and advisory services to Sysarc Informatix’s Board for at least a year to ensure a smooth and successful business integration into Juniper Group.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>About TSI: </strong>Having pioneered several products at Fortune 500 companies, TSI has three-decade experience and expertise across several verticals, with the Airline and FinTech industries at the front, facilitating and delivering transformational results for a demanding new digital world. More info at <a href=\"http://www.tpfsoftware.com\">www.tpfsoftware.com</a>.<br/>About Juniper Group: Juniper Group, an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is a fast-growing global software conglomerate with operations in several verticals, mainly: travel, aviation, banking &amp; payments, insurance, public sector, and oil &amp; gas. Juniper Group, currently comprised of over 1,500+ employees all over the world, invests in and partners with vertical market software businesses permanently. More info at <a href=\"http://www.juniper-group.com\">www.juniper-group.com</a>.</p>\n<p>For media enquiries, please contact:<br/>Vanesa Espinosa<br/><a href=\"mailto:vanesa.espinosa@juniper-group.com\">vanesa.espinosa@juniper-group.com</a><br/>VP Governance &amp; Organization</p>\n"}, {"title": "ICS Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/ics-acquired-by-fog-software-group/", "date": "12 December, 2022", "content": "\n<p>Belfast, Northern Ireland – FOG Software Group (“FOG”), an operating group of Vela Software is pleased to announce the acquisition of ICS from Equiniti Group.</p>\n<p>ICS develops innovative case and document management platforms for some of the world’s best-known brands and public sector organizations. ICS products support customers on their journey to digital excellence in the UK and Ireland’s private and public sectors. ICS has been delivering IT solutions for over 50 years that help clients reduce costs, deliver value and drive efficiencies across their organizations.</p>\n<p>Marc Belanski, Portfolio Manager, FOG, voiced enthusiasm for the acquisition, stating “ICS has an outstanding legacy of providing leading-edge solutions to the public and private sector. Together with our experience growing and building software companies we see a bright future for the ICS team as we help customers in their digital journeys.”</p>\n<p>Stuart Gunning, Managing Director of ICS, adds “This is an exciting development for both ICS and its customers. The acquisition by FOG (Vela) provides us a strong corporate platform and access to resources and expertise which will allow us to improve our product portfolio and extend our market reach, while at the same time continuing to provide first-class service to our customers.”</p>\n<p>Paul Lynam, CEO, EQ Group states “This sale reflects Equiniti’s strategic focus to simplify its portfolio and concentrate resources and investment on its scale core propositions in Shareholder Services, Retirement Services, Remediation and Credit and Risk Services. We wish the ICS team well on the new journey they are embarking on and are excited to continue to partner together on mutual customers well into the future.”</p>\n<p><strong>About FOG Software Group</strong></p>\n<p>FOG Software Group (www.FOGsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) headquartered in Toronto, Canada. The operating group acquires, manages, and builds in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About Equiniti Group (EQ)</strong></p>\n<p>EQ is a leading international provider of shareholder, pension, remediation, and credit technology. With over 6,000 employees, it supports 37 million people in 120 countries. EQ’s purpose is to care for every customer and simplify every transaction, delivered with less of an impact on the environment.</p>\n<p><strong>For more information:<br/>Tulchan Communications</strong><br/>Martin Robinson<br/>Tel: +44(0)20 7353 4200<br/>Email: Equiniti@tulchangroup.com</p>\n<p></p>\n<p></p>\n"}, {"title": "SHOPLOGIX ACQUIRES PROXIA, BUILDS ON INDUSTRY 4.0 SOLUTION PORTFOLIO", "link": "https://velasoftwaregroup.com/shoplogix-acquires-proxia-builds-on-industry-4-0-solution-portfolio/", "date": "7 December, 2022", "content": "\n<p><strong>Oakville, Canada, November 18th, 2022: Shoplogix</strong>, a division of FOG Software Group (FOG) and Vela Software, has acquired<strong> PROXIA Software AG (PROXIA)</strong>, a German Manufacturing Execution System (MES) software company, further expanding its portfolio of smart manufacturing software solutions.</p>\n<p>PROXIA will strategically complement the suite of Smart Factory solutions offered by Shoplogix, bringing a strong feature set including planning, maintenance, and performance management software for discrete manufacturers. Headquartered in Ebersberg, Germany, PROXIA serves manufacturing companies primarily in the Germany / Switzerland / Austrian / Poland markets with factory deployments around the world.</p>\n<p>“PROXIA is a great company with a talented team and a rich, complementary feature set that will help our customers further their Smart Factory objectives” said <strong>Carlos Midence, President of Shoplogix.</strong> “PROXIA’s strong position in Central Europe also gives us a solid base for further expansion of our European Smart Factory division”</p>\n<p>“We are very pleased to add PROXIA to our rapidly growing portfolio. Together, PROXIA and Shoplogix will provide a very valuable and complementary set of solutions to optimize and digitize production. Along with our other portfolio companies, we are in a strong position globally to be the leading best-of-breed vendor, helping our customers transition to the changing demands of manufacturing and Industry 4.0” said<strong> Magnus Sandberg, Group CEO of the Smart Manufacturing portfolio of companies at FOG.</strong></p>\n<p><strong>Julia Klingspor</strong>, outgoing CEO of PROXIA stated “PROXIA’s customers and staff will benefit from the synergies offered by this merger. The combined knowledge of both teams and the comprehensive product suite will drive incredible value for our customers and create exciting opportunities for our staff”.</p>\n<p>PROXIA will be merged with the Shoplogix Smart Factory EU operations and will be led by Paul Gunning, EU General Manager, under the direction of Carlos Midence.</p>\n<p><strong><a href=\"http://www.shoplogix.com\">About Shoplogix</a></strong><br/>Shoplogix (www.shoplogix.com) is a division of Fog Software Group (FOG). Founded in 2002, Shoplogix is a leader in the industrial internet of things (IIoT) and smart factory software industry through its IIoT and cloud-based platform, providing manufacturers with real-time data presented in user-friendly visual dashboards, innovative features and opportunities for continuous growth.</p>\n<p><strong><a href=\"http://www.proxia.com\">About PROXIA Software AG</a></strong><br/>PROXIA Software AG (www.proxia.com) is headquartered in Ebersberg, Germany, and develops, deploys and supports Manufacturing Execution System (MES) software to improve the planning process, performance management and KPI tracking at customers in the capital equipment, tooling, automotive, plastics and chemical sectors.</p>\n<p><strong><a href=\"http://www.fogsoftwaregroup.com\">About FOG Software Group</a></strong><br/>FOG Software Group (www.fogsoftwaregroup.com) is a division of Vela Software Group (www.velasoftwaregroup.com). The company works with experienced operators to acquire, build and grow market-leading software businesses. FOG gives operators a pathway to preserve their legacy while providing access to capital, customers and best practices.</p>\n<p><strong>Contact</strong><br/><a href=\"valerie@shoplogix.com\">Valerie Tesoro</a><br/>Marketing Manager<br/>valerie@shoplogix.com<br/>www.shoplogix.com</p>\n"}, {"title": "Juniper Group Acquires Libusoft Cicom", "link": "https://velasoftwaregroup.com/juniper-group-acquires-libusoft-cicom/", "date": "5 December, 2022", "content": "\n<p>Zagreb, November 4<sup>th</sup>, 2022–<strong> Libusoft Cicom, an IT and consulting company specialised in the development and implementation of business process digitalisation solutions, to become part of the IN2 Group. IN2 Group’s new acquisition is in line with the Group’s growth strategy with a view to expanding operations, attracting new clients and employees, and their personal and professional development, as well as adding strategic new members to the Group.</strong></p>\n<p>Libusoft Cicom (LC) is one of the leadingcompanies in the field of public administration digitalisation in Croatia. The Company takes pride in the fact that the IT system of every Croatian smart city is home to at least one LC’s solution. The experience, expertise and know-how of LC’s specialists are the result of thirty years of development, investments and continued growth. Today LC has 150 employees providing IT services and developing specific software solutions for more than 1,000. LC’s software solutions are intended for a wide variety of users such as local and regional self-government units, budget users, public utility companies, residential building management companies, businesses, and non-profit organisations.</p>\n<p><em>“Libusoft Cicom has a growing market share and an excellent team of leading experts in the field, so this acquisition will no doubt add even more wind to our company’s sails, to the benefit of both our employees and our clients. It is our great pleasure to announce that we are becoming part of the Juniper Group and IN2 Group, where our industry-specific know-how, experience and tailor-made services and products will augment IN2 Group’s portfolio, and secure a stronger market position for all of us”</em>, said <strong>Marko Ignjatović</strong>, Director at Libusoft Cicom Ltd.</p>\n<p>IN2 Group is continually scanning the market for the best potential partners and is systematically expanding its operations by means of acquiring IT companies whose portfolios fit in well with the Group’s existing sectors, or enhance IN2 Group’s operations by way of new and innovative solutions.</p>\n<p>2022 has been a milestone year for IN2 Group in more ways than one. It is the year of their thirtieth anniversary, so they have decided to commemorate their vital projects that have digitally transformed the modern way of life of the Croatian people, all the while achieving outstanding business results.</p>\n<p><em>“In line with our long-term vision of leading the digitalisation of Croatia, we have decided to welcome another new member into our Group’s family – Libusoft Cicom, a company specialised in developing specific IT solutions that revolutionise the market, just like we at IN2 Group do. It gives us great pleasure to welcome a new partner that shares our passion and values, and that working together we will reach ever greater heights in meeting the specific needs of our clients and users”,</em> said <strong>Denis Jašarević</strong>, President of the Management Board of IN2 Group.<em></em></p>\n<p>The acquisition of Libusoft Cicom is not IN2’s only acquisition taking place this year, and it certainly is not the last one in the times ahead.</p>\n<p><em>“Libusoft Cicom’s portfolio includes software solutions of exceptional quality backed by their expertise and long-standing tradition, earning them the market leader position in several business segments. This is a significant acquisition that will further enhance and strengthen IN2 market position in all business verticals. We plan to support inorganic growth of IN2 Group in the future by continuously working on new potential partnerships and acquisitions”</em>, said <strong>Katarina Šiber Makar</strong>, Senior Vice President for Business Development at Juniper Group, and Member of the Supervisory Board at IN2 Group. </p>\n<p>***</p>\n<p><strong>About IN2 Group:</strong> Over its 30-year existence, IN2 Group has been developing software solutions for a variety of industrial verticals, gaining valuable experience in solutions design and implementation through cooperation with clients from virtually all business branches. The Group’s operations span across five countries of our region, with more than 300 clients, and a strong focus on supporting businesses and organisations operating in the economy, finance, insurance, and healthcare sectors, as well as the public sector. IN2 Group is an operating group of Juniper Group. More info at <a href=\"https://in2.hr/en/about-us\">https://in2.hr/en/</a></p>\n<p><strong>About Juniper Group: </strong>Juniper Group,an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is a fast-growing software conglomerate with a focus mainly on travel, aviation, healthcare, finance, banking, insurance, public sector and oil &amp; gas. Juniper Group, currently comprised of over 1,200+ employees all over the world, invests in and partners with software businesses permanently, serving customers in specific or adjacent industry verticals. More info at <a href=\"https://www.juniper-group.com/\">www.juniper-group.com</a></p>\n<p>For media enquiries please contact:</p>\n<p>Vanesa Espinosa</p>\n<p><a href=\"mailto:vanesa.espinosa@juniper-group.com\">vanesa.espinosa@juniper-group.com</a></p>\n<p>VP Governance &amp; Organization</p>\n"}, {"title": "acQuire announces acquisition of Managing Transformation Solutions (MTS)", "link": "https://velasoftwaregroup.com/acquire-announces-acquisition-of-managing-transformation-solutions-mts/", "date": "31 October, 2022", "content": "\n<p>acQuire Technology Solutions (acQuire) is pleased to announce it has acquired MTS, a South African company that specialises in people-centred technology and advisory services to help resource companies meet obligations that cover their social license to operate. The addition of MTS’s Insite product – a people-centred, social performance management solution – rounds out acQuire’s capability to manage crucial ESG performance information.</p>\n<p><strong>Alison Atkins, acQuire’s CEO</strong>, welcomes the acquisition of MTS as part of a broader growth strategy for the company. </p>\n<p>“MTS is an excellent fit for us and our purpose of solving data management challenges with robust software solutions. We look forward to growing its excellent product and reputation under our ownership,” Atkins said.</p>\n<p>“We see fresh opportunities to deliver social performance technology to more companies across Africa so businesses can future-proof their operations by harnessing the growth potential of their communities, workplaces and supply chains, and make data-led decisions.”</p>\n<p>Insite manages and optimises regulatory compliance requirements and processes relating to the implementation and reporting of Social and Labour Plans, Mining Charters, the Broad-Based Black Economic Empowerment (B-BBEE) program, Employment Equity and Annual Training Reports (ATR) for Workplace Skills Plans (WSP) mainly for mining companies in South Africa.</p>\n<p><strong>Maritha Erasmus, CEO and Founder of MTS</strong>, believes the acquisition by acQuire will provide greater opportunities to advance socio-economic inclusion. Both she and <strong>Phil Marneweck, CTO and co-founder of MTS</strong> are eager to join the acQuire team.</p>\n<p>“The acquisition by acQuire is a chance to join a like-minded, values-based company. We look forward to expanding on the important work we started at MTS and the social impact we can make using technology.”</p>\n<h3>About acQuire</h3>\n<p>acQuire provides geoscientific data management software and services so customers can make profitable business decisions using data assets they trust. We work with the world’s leading organisations, by helping them manage their mining and environmental data assets, in a smarter, more streamlined manner.</p>\n<p>acQuire’s software is paired with product support services and accredited training to meet customers’ evolving technology needs.</p>\n<p>Founded in 1996, acQuire originated in Perth, Western Australia, and since 2018 has been a part of Constellation Software Inc (CSI) via its operating group Vela Software. The company currently has five offices around the globe, with customer support centres operating in each major time zone.</p>\n<p>CSI is a public company listed on the Toronto Stock Exchange (TSX:CSU). CSI acquires, manages and builds software businesses that provide mission-critical solutions in specific vertical markets.</p>\n<p><strong>About MTS</strong></p>\n<p>Managing Transformation Solutions (MTS) is a services and software business that has been at the forefront of social sustainability in the mining industry since 2009. It develops people-centred technology solutions to help clients develop and implement long-term social performance strategies that meet regulatory requirements and deliver shared value to internal and external stakeholders. MTS is based in Johannesburg, South Africa, and has expanded its services to a variety of industries, including civil engineering and construction.</p>\n<h4>Media Contact:</h4>\n<p>Meesha Stacker<br/>Email: <a href=\"mailto:m.stacker@acquire.com.au\">m.stacker@acquire.com.au</a></p>\n<p>Website: <a href=\"http://www.acquire.com.au\">www.acquire.com.au</a></p>\n"}, {"title": "Juniper Group acquires Insite", "link": "https://velasoftwaregroup.com/juniper-group-acquires-insite/", "date": "25 October, 2022", "content": "\n<p>Ljubljana, Zagreb, October 24th, 2022 –<strong> Halcom, a leading provider of innovative solutions for payment systems, is pleased to announce it has acquired Insite, an experienced industry-oriented CRM provider, with a strong focus on banking, insurance and retail.</strong></p>\n<p>Halcom’s first acquisition as part of Juniper Group, an operating group within Vela Software and Constellation Software, Inc., represents an important milestone for the company. The investment will bolster Halcom’s strategic value proposition to its customers in the financial industry and consolidate its footprint in South-eastern Europe. For Insite, becoming part of a global software conglomerate and a recognized regional vendor opens important new market opportunities.</p>\n<p>“<em>We are excited about our first acquisition, even more so because Insite’s CRM banking solutions complement Halcom’s digital offering so well. Together, we will be able to offer banks and other financial institutions a unique solution portfolio in the region initially, and globally in the coming years,</em>” stated Mr. Tomi Šefman, CEO of Halcom.</p>\n<p>Mr. Tomislav Lazarić, General Manager of Insite, commented: <em>“Becoming part of Halcom means a turning point for Insite and we are proud to be recognized as a reliable provider of innovative CRM solutions to banks”.</em></p>\n<p><em>Ms. Katarina Šiber Makar, Juniper Group’s Senior Vice President for Business Development: “We expect this to be the first in a row of several acquisitions in the upcoming years which will support Halcom’s strong growth.”</em></p>\n<p><strong>About Halcom:</strong> Halcom, a leading business unit of Juniper Group in the payment and banking verticals, has played a pioneering role in the field of developing payment systems in Central and South-East Europe for over 30 years. With two continents, 7 markets, more than 50 banks, 2 central banks and clearing houses and more than 570.000 issued digital certificates, Halcom ranks among the top providers of innovative and secure payment and financial services. More info at <a href=\"http://www.halcom.com/\">www.halcom.com</a>.</p>\n<p><strong>About Insite: </strong>Insite is an innovative supplier of CRM systems. The quality of their CRM solution has been for 20 years successfully recognized by satisfied customers among largest European banking members and retail companies. With 5.5 million end customers served, Insite ranks among the top providers of CRM solution for banks. More info at <a href=\"http://www.insite.hr/new\">www.insite.hr</a>.</p>\n<p><strong>About Juniper Group: </strong>Juniper Group,<strong> </strong>an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is a fast-growing software conglomerate with a focus mainly on travel, aviation, healthcare, finance, banking, insurance and oil &amp; gas. Juniper Group, currently comprised of over 1,200 employees all over the world, invests in and partners with software businesses permanently, serving customers in specific or adjacent industry verticals. More info at www.juniper-group.com</p>\n<p>For media enquiries please contact:</p>\n<p>Vanesa Espinosa</p>\n<p>vanesa.espinosa@juniper-group.com</p>\n<p>VP Governance &amp; Organization</p>\n"}, {"title": "VELA INDUSTRIES GROUP ACQUIRES SCENARIO", "link": "https://velasoftwaregroup.com/vela-industries-group-acquires-scenario/", "date": "13 October, 2022", "content": "\n<p><strong>13 October 2022 –</strong> Vela Industries Group is pleased to announce the acquisition of Scenario, a leader in project delivery and project control software. Scenario is used on large and complex projects in the infrastructure, construction, power, property development and resource industries across Asia, Australia and the Middle East.</p>\n<p>“The Scenario acquisition is a complementary addition to Vela Industries Group’s software portfolio. With increasing cost pressure on owners and contractors to deliver large-scale projects on time and schedule, Scenario will enable our customers to manage, collaborate and report progress across a portfolio of projects in real-time,” said John Bailey, COO of Vela Industries Group “We look forward to working with Scenario to enable the delivery of projects across our global ecosystem.”</p>\n<p>“We are excited and proud to be joining Vela Industries Group and working alongside other leading software organisations operating within our client industries, said Sarah Smith, CEO of Scenario. This acquisition is an important next step in our continued journey of growth, further expanding our international presence through the Vela’s network.”</p>\n<p><strong>About Scenario</strong></p>\n<p>Scenario is an Enterprise SaaS platform providing Project Delivery and Project Controls solutions for mining, property development, energy, infrastructure and construction projects. Scenario has the ability to scale from a portfolio of major projects, to complex mega projects all with varying requirements and needs.</p>\n<p><strong>About Vela</strong><strong> Industries Group</strong><strong></strong></p>\n<p>Vela Industries Group is a global provider of software solutions to capital-intensive vertical industries. As an operating group of Constellation Software, we acquire, manage, and build software businesses that provide specialized, mission-critical software solutions. We help companies to grow through organic initiatives and seek acquisitions that can strengthen their market position. </p>\n<p><strong>Contact:</strong> </p>\n<p>Esa Immonen, VP – Customer Experience &amp; Marketing</p>\n"}, {"title": "Vela Asia Pacific has today announced the acquisition of Accredo Business Software Limited", "link": "https://velasoftwaregroup.com/acquisition-of-accredo-business-software-limited/", "date": "8 September, 2022", "content": "\n<p><strong>Auckland, New Zealand – 2 September 2022</strong> – Vela Software Group, trading through its subsidiary Vela Asia Pacific, has today announced the acquisition of <a href=\"https://accredo.co.nz/\">Accredo Business Software Limited</a>. Accredo is a comprehensive accounting and business management solution used by SMEs across Australia and New Zealand.</p>\n<p>Natisha Brindle, General Manager, stated, “It was critical to find the right acquirer to ensure the continued growth of Accredo built on a foundation of over 30 years’ industry knowledge. Through their wealth of experience, and commitment to excellence and continued learning, we are excited to have Vela guiding us on our journey as we take our software and people forward. We believe that Vela’s valuable best practices, together with the financial backing of a large software company, will greatly assist Accredo in delivering even more value to our customers across Australia and New Zealand. The existing Accredo team will remain and is excited by the opportunities that lie ahead.”</p>\n<p>“We’re excited to bring Accredo and their talented team into the group here at Vela” said Ian Whiting, CEO of Vela Asia Pacific.  “With a strong foundation and reputation forged over their 30 plus years, Accredo have a stellar reputation for great software and supporting businesses right across Australia and New Zealand.”</p>\n<p><strong>About Vela Asia Pacific:</strong></p>\n<p>Vela Asia Pacific, as part of <a href=\"https://velasoftwaregroup.com/\">Vela Software Group</a> acquires, manages, and builds mission-critical vertical market software businesses. We are a portfolio of Wholesale, Distribution, Fashion, General Retail, Light Manufacturing, and Government software businesses that have a presence in Australia, New Zealand and Asia-Pacific. We provide vertical market software expertise, operational support and capital to help our businesses grow.</p>\n<p>Vela is an operating group of <a href=\"https://www.csisoftware.com/\">Constellation Software Inc.</a> (TSX: CSU), a public company listed on the Toronto Stock Exchange.</p>\n<p>Further information concerning Vela Asia Pacific may be obtained through their website at <a href=\"https://www.velasoftwaregroup.com.au/\" rel=\"noreferrer noopener\" target=\"_blank\">www.velasoftwaregroup.com.au</a></p>\n"}, {"title": "Vela Software expands its presence in the Brazilian legaltech market with the acquisition of LDSOFT.", "link": "https://velasoftwaregroup.com/vela-software-expands-its-presence-in-the-brazilian-legaltech-market-with-the-acquisition-of-ldsoft/", "date": "8 September, 2022", "content": "\n<p>Vela Software is pleased to announce the acquisition of LDSOFT, a pioneer in intellectual property solutions.</p>\n<p>With almost 30 years of experience, the company is the leader in intellectual property solutions in Brazil with more than 800 customers. LDSOFT offers software solutions including Apol, leader in the intellectual property category, Webseek, Cashfy, Aquiles and Authora, the newest way to register proof of digital files anteriority on the Blockchain.</p>\n<p>With this acquisition, Vela Software is increasing its presence in the legaltech vertical in Brazil. “We are thrilled to add LDSOFT to our portfolio. We understand that the legal technology market in Brazil is in full growth. Our investments in this vertical, which started in 2019 with the acquisition of Aurum and in 2020 with the acquisition of Kurier, should continue. We still have many opportunities in this segment in Brazil.” said Paulo Felipe Martins, CEO of Vela Software Latin America.</p>\n<p>LDSOFT CEO Luiz Duffles said “It is a very important milestone in the history of the company I founded in 1993. After 29 years, we are leaders in intellectual property solutions and this ended up catching the attention of one of the biggest technology groups in the world. I am very proud to now be part of the Constellation group, and I am sure that it will make us even stronger to continue growing and innovating more and more in this segment of legal technology.”</p>\n<p><strong>About LDSOFT</strong></p>\n<p>Founded in 1993 LDSOFT is a pioneer in the intellectual property solutions space offering customers a robust solution with functionality across multiple use cases.</p>\n<p><strong>About Vela Software</strong></p>\n<p>Vela Software is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Ricardo Software Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/ricardo-software-acquired-by-fog-software-group/", "date": "24 August, 2022", "content": "\n<p><strong>FOG Software Group’s STEM portfolio further expands its growing suite of engineering software solutions through its acquisition of Ricardo Software</strong></p>\n<p>August 1, 2022 – Shoreham, UK – FOG Software Group (“FOG”), an operating group of Vela Software is pleased to announce the acquisition of Ricardo Software from Ricardo plc.</p>\n<p>Ricardo Software is a trusted technology partner to the world’s leading transport OEMs and Tier 1 suppliers, providing a full suite of automotive simulation tools for propulsion and transmission design. With class leading products such as VECTIS, WAVE and WAVE-RT as well as emerging tools such as IGNITE, focused on the design and modelling of complex systems such as battery electric and alternative fuel vehicles, Ricardo Software is poised to support customers today and through the transition from internal combustion to carbon neutral transportation.</p>\n<p>Tom Chan, CEO of the FOG STEM Portfolio, voiced enthusiasm for the acquisition, stating “Ricardo Software has an outstanding legacy of providing leading-edge solutions to the transportation industry. Together with our experience growing and building software companies we see a bright future for the Ricardo Software team as we help manufacturers transition to greener technologies. Additionally, this partnership, which comes with a proven management team, gives us a solid platform in CAE from which we can expand to increasingly meet our customers’ needs.”</p>\n<p>Chris Hopper, CEO of Ricardo Software, adds “This is an exciting development for both Ricardo Software and its customers. The acquisition by FOG (Vela) provides us a strong corporate platform and access to resources and expertise which will allow us to improve our product portfolio and extend our market reach, while at the same time continuing to provide first-class service to our customers.”</p>\n<p><strong>About FOG Software Group</strong></p>\n<p>FOG Software Group (<a href=\"https://www.fogsoftwaregroup.com/\">www.fogsoftwaregroup.com</a>) is an operating group of Vela Software (<a href=\"http://www.velasoftwaregroup.com\">www.velasoftwaregroup.com</a>) headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About Ricardo plc</strong></p>\n<p>Ricardo plc is a world-class environmental, engineering, and strategic consulting company listed on the London Stock Exchange. With over 100 years of engineering excellence, we provide exceptional levels of expertise in delivering leading-edge and innovative cross-sector sustainable products and solutions, helping our global customers increase efficiencies, achieve growth and create a clear and safer future. Our mission is clear –- to create a world fit for the future. For more information, visit <a href=\"https://ricardo.com/\">www.ricardo.com</a></p>\n"}, {"title": "Airport Information Systems Acquired By Juniper Group", "link": "https://velasoftwaregroup.com/airport-information-systems-acquired-by-juniper-group/", "date": "4 August, 2022", "content": "\n<p>United Kingdom, <strong>April 21, 2022 –</strong> <strong>TPF Software (TSI), a division of Juniper Group, is pleased to announce it has acquired Airport Information Systems (AIS), an all-in-one Airport Operations Management System across the British Islands.</strong></p>\n<p>This transaction represents an exciting milestone for TSI as it is the first acquisition made by them within Constellation Software, only two years after becoming part of Juniper Group. This investment will allow TSI to reinforce its strategic value proposition to its customers within the aviation industry and consolidate its footprint in northwestern Europe.</p>\n<p>Mr. Karthik Doraiswamy, CEO of TSI stated: “<em>The acquisition of AIS brings us complementary software solutions to those formerly build and provided by TSI in the aviation vertical. AIS has developed a great product suite in terms of functionality and user requirements that has been continuously upgraded in cooperation with a loyal and long-lasting customer base</em>“.</p>\n<p>“<em>On behalf of Juniper Group, I want to thank Mr. Rick Goold for his entrepreneurial leadership and his hard work over the last 30 years which resulted in the company that AIS is today. The team will continue developing existing and additional capabilities and bringing our increased scale and best practices to bear upon the business</em>”, said Mr. Doraiswamy.</p>\n<p>Mr. Goold will be stepping down as CEO looking forward to retirement, passing the baton to Mr. Doraiswamy, so he can lead AIS through its next phase of growth. Mr. Goold will stay close to the business and AIS’ customers ensuring a smooth transition during the integration period.</p>\n<p><strong>About AIS: </strong><a href=\"https://www.airport-information-systems.com/\">AIS</a> is a leading supplier of Integrated Airport Management Systems, successfully providing solutions for 30 years. AIS products represent the very latest in airport management software and consist of a set of integrated modules to fully cater to an airport’s operational and data management needs.</p>\n<p><strong><strong>About Juniper Group: </strong><a href=\"https://www.juniper-group.com/\">Juniper Group</a>, </strong>an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is one of the leading software travel and aviation conglomerates worldwide, among other relevant verticals such as healthcare, finance, banking, insurance and oil &amp; gas. Juniper Group, currently comprised of over 1,200 employees all over the world, invests in and partners with software businesses permanently, serving customers in specific or adjacent industry verticals.</p>\n<p>For media enquiries please contact:</p>\n<p>Vanesa Espinosa |VP Governance &amp; Organization | Juniper Group</p>\n<p>Email: <a href=\"http://mailto:vanesa.espinosa@juniper-group.com/\">vanesa.espinosa@juniper-group.com</a></p>\n"}, {"title": "Juniper Group Acquires IST Cruise Technology", "link": "https://velasoftwaregroup.com/juniper-group-acquires-ist-cruise-technology/", "date": "4 August, 2022", "content": "\n<p>Palma, Balearic Islands, Spain, August 2, 2022 – <strong>Juniper (a division of Juniper Group), a leading supplier of technological solutions in the tourism industry, has announced today the completion of IST acquisition, the trailblazing technology-company offering solutions for the online sale of cruises. </strong> </p>\n<p>“<em>The goal of our project is to grow based on the great success that Juniper and IST have achieved in the tourism industry. The acquisition of IST is part of our strategy to continue being the leading company in technological solutions for the travel industry, while adding to our product portfolio the technology and experience of a highly specialized team with know-how on the cruise industry and its needs. By incorporating IST to our vertical, all our clients will be able to benefit from more comprehensive multi-product solutions, with cruises being another differentiating element within our portfolio from now on. IST’s clients will be able to access dynamic distribution solutions for all the products offered by the Juniper and Cangooroo Booking Engines.</em>” said Juan Mateos, General Manager of Juniper.</p>\n<p>Besides, Jaime Sastre, CEO of Juniper Group, added: “<em>The acquisition of IST-Fibos is another step in our goal of creating a portfolio of technology companies dedicated to providing solutions to the tourism industry globally, while being led by the hand of expert teams.</em>” </p>\n<p>Manuel Sardi, CEO of IST, stated: “<em>Joining Juniper and its Group is undoubtedly a guarantee for the future that will allow us to globally deliver cruise product to more distributors and to strengthen ties with the industry – if there is still room for it – as well as with our clients. Juniper’s leading position will enable us to increase products and services immediately.</em>”  </p>\n<p><strong>About</strong> <strong>Juniper, </strong>Since 2014, Juniper has been part of the Juniper Group.<strong> </strong>Since 2003, Juniper, a global travel technology company, has provided the best online solutions for the tourism industry (OTAs, DMCs, BedBanks, Airlines, and Wholesalers). Juniper offers flexible and modular Booking Engines (Juniper and Cangooroo Booking Engines) that can be adapted to the needs of each business. </p>\n<p>With over 360 XML integrations with external suppliers, Juniper has the broadest connectivity portfolio in the world. Also, it has more than 360 clients in 50 countries who already trust its technology and its commitment to quality and service, meeting their needs in an environment that is constantly changing and evolving. </p>\n<p>Juniper has a team of more than 280 professionals with experience in technology and travel, located at the Juniper headquarters in Palma (Spain), Cangooroo in São Paulo (Brazil), Miami (USA), Cali (Colombia) and Dubai (UAE). Juniper’s team is highly specialized and committed to providing the highest quality service to their Clients. Thanks to this, they have experienced great growth in the market in recent years. </p>\n<p>For more information, visit its website: <a href=\"http://www.ejuniper.com/\" rel=\"noreferrer noopener\" target=\"_blank\">www.ejuniper.com</a></p>\n<p><strong>About IST </strong>is a technology partner expert in the distribution and sale of online cruises. With more than 20 years of experience in the market, IST is integrated with more than 30 cruise companies and more than 40,000 travel agencies to boost cruise sales. </p>\n<p>IST offers API integrations and cruise booking systems that adapt to the needs and models of each business. Through its robust FIBOS technology, IST provides travel agencies, tour operators and wholesalers with the possibility of creating a booking engine according to their brand criteria, following their own flow, adapted to their internal systems and business model, with flexibility to modify it at any time according to their conversion ratios. </p>\n<p>This technology can be applied to B2C websites where the product is offered directly to the consumer, but B2B applications are also developed through their intranets or applications for mobile devices. </p>\n<p>For more information, visit its website: <a href=\"http://www.ist-cruisetech.com/\" rel=\"noreferrer noopener\" target=\"_blank\">www.ist-cruisetech.com</a>  </p>\n<p><strong>About Juniper Group</strong> is a sub-division of Vela (a CSI division that is publicly traded under TSE:CSU) that focuses on acquisitions of software companies in various verticals and helps them grow in their respective markets. The strategy of the company is to acquire for life software companies that have created mission-critical products and coach the management team to optimize business operations and performance. </p>\n<p>For media enquiries please contact:</p>\n<p>Vanesa Espinosa |VP Governance &amp; Organization | Juniper Group</p>\n<p>Email: <a href=\"http://mailto:vanesa.espinosa@juniper-group.com/\">vanesa.espinosa@juniper-group.com</a></p>\n"}, {"title": "Vela software  acquires Monitor", "link": "https://velasoftwaregroup.com/vela-software-acquires-monitor/", "date": "22 July, 2022", "content": "\n<p><strong> July 21, 2022 –</strong> Vela Software is proud to announce the acquisition of Monitor Management Control Systems Ltd., a business that provides project cost &amp; performance management software, training, and consulting to the oil and gas, infrastructure, power, mining, construction, and engineered solutions industries.</p>\n<p>Vela, an operating group of Canadian public company, Constellation Software Inc. (TSE:CSU), will add Monitor project cost control software to the Ascertra business that offers products from previous acquisitions of<a href=\"https://www.ascertra.com/products/coreworx-interface-management-software\"> Coreworx interface management software</a> and <a href=\"https://www.ascertra.com/products/proarc-engineering-document-management-software\">Proarc Engineering Document Management software</a>.</p>\n<p>The backing of Vela enables a new phase of growth for Monitor through access to a broad pool of management expertise and extended global reach provided by combining resources from Ascertra offices in Calgary, Houston, and Oslo with Monitor operations in Aberdeen, UK and Perth, Australia.</p>\n<p>Vela’s permanent-ownership model and industry-specific expertise will ensure that Monitor remains a trusted, industry-leading provider of project cost &amp; performance management solutions to all customers and supported industries.</p>\n<p>“We are excited to join the Vela group and the opportunities this will bring to the Monitor brand, products, and customers,” said Monitor COO, Mike Davidson. “The Ascertra business product lines have many common customers and possible functional synergies, added with a global infrastructure that will enhance the value we can deliver. Monitor clients can be confident that this move to Ascertra will strengthen our market position and ability to continue to deliver great value in the area of project cost control, whilst being assured that services, particularly trusted support, will remain unchanged.”</p>\n<p>“We are delighted to add Monitor into the Vela family within our Ascertra business. Monitor offers a well-established and proven solution suite that is used by many of the leading names in capital project execution,” said Matt McKinley, CEO at Ascertra. “We look forward to combining Monitor’s specialist knowledge with our expertise in document control and interface management in order to provide customers with greater value from our industry-leading capital project solutions.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an operating group of Constellation Software Inc., Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers.</p>\n<p><strong>About Ascertra</strong></p>\n<p><a href=\"https://www.ascertra.com/\">Ascertra</a> is a software and services company that provides integrated information management software solutions, including Proarc Engineering Document Management software (EDMS) and Coreworx Interface Connect interface management software, that help their customers better design, construct, and operate complex assets. These solutions service a portfolio of projects valued at over $1 trillion across 40 countries, on more than 2,000 projects with 250,000+ users. Ascertra software enables EPCs, owner-operators, and contractors to automate best practices for compliance and quality, mitigate related business risk, and improve performance to budget throughout the entire project &amp; asset life cycle.</p>\n<p><strong>About Monitor</strong></p>\n<p><a href=\"http://www.monitor-mpower.com/about/about-monitor/\">Monitor Management Control Systems Ltd.</a> provides project cost &amp; performance management software, training, and consulting to the oil and gas, infrastructure, power, mining, construction, and engineered solutions industries. Monitor was founded in 1987 and has offices in Aberdeen, Calgary, and Perth. Monitor has provided products, consultancy, and training recently to projects in Kazakhstan, Middle East, and Africa, as well as key markets of Europe, North America, and Australia.</p>\n"}, {"title": "Vela Software Group acquires Geovariances", "link": "https://velasoftwaregroup.com/vela-software-group-acquires-geovariances/", "date": "2 June, 2022", "content": "\n<p><strong> 02 June 2022 –</strong> Vela Software Group is pleased to announce the acquisition of Geovariances, a world-leader in geostatistics for over 30 years. Headquartered in Fontainebleau, France, Geovariances is the developer of Isatis.neo, the leading solution for complex geospatial challenges in mining, oil &amp; gas, nuclear decommissioning, contaminated soil and air &amp; water quality.</p>\n<p>“The Geovariances acquisition is a highly complementary addition to Vela’s mining software portfolio. Adding the renowned Isatis.neo application to our natural resources and environmental modelling solutions will deliver even greater value to customers,” said Dylan Webb, CEO of Datamine. “The opportunity to work more closely with the Geovariances team will enable us to deliver the most advanced geostatistics solutions to our customers and constantly incorporate the latest research.”</p>\n<p>Geovariances CEO, Jean-Paul Roux said, “By joining Vela Software, Geovariances will become closer to Vela-owned companies operating in the mining industry, such as Datamine, acQuire, Minemax, Centric and Snowden-Optiro. We are confident that this connection with firms similar to ours will allow us to develop synergies that will benefit our customers. We’ll also benefit from Vela’s presence in 20 countries to provide our clients with more efficient local support.</p>\n<p><strong>About Geovariances</strong></p>\n<p>Founded in 1986, Geovariances is the premier provider of accessible advanced geostatistics to the natural resources industries. Geovariances’ solutions deliver clients exceptional reliability and scientific rigor thanks to an exclusive 30-year partnership with the Center of Geoscience of Mines ParisTech, the birthplace of Geostatistics.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>Contact:</strong></p>\n<p>Esa Immonen, VP – Customer Experience</p>\n"}, {"title": "Vela Software Group announced that it has acquired BusinessCraft", "link": "https://velasoftwaregroup.com/vela-software-group-announced-that-it-has-acquired-businesscraft/", "date": "22 April, 2022", "content": "\n<p><strong>Brisbane, Australia – 22 April 2022 –</strong> Vela Software Group announced today that it has acquired BusinessCraft, trading through its subsidiary Vela Asia Pacific. BusinessCraft is a Newcastle-based Australian business focused on the provision of ERP systems to the residential construction and engineering markets.</p>\n<p>Steven Parish, former owner of BusinessCraft stated, “It was very important for BusinessCraft to find the right partner to ensure our customers and employees were in good hands. We are excited to have Vela build on the software, branding, and people to further improve BusinessCraft’s services. We believe that Vela’s valuable best practices and the financial backing of a large software company will greatly assist BusinessCraft in realizing its full potential and delivering security to all of our customers.”</p>\n<p><strong>About BusinessCraft</strong></p>\n<p>“BusinessCraft is a tremendous team of individuals that due to their domain knowledge and close relationships with their clients have had great success in the market. All characteristics we value highly. We are excited to welcome them to the Vela Asia Pacific family and look forward to working closely with them to help strengthen their market position,” said Ian Whiting, CEO of Vela Asia Pacific. “We thank the past owner for establishing such a great business and wish them well in their next chapter and know that the employees of BusinessCraft have set high goals for themselves which we are happy to assist in”.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Asia Pacific, as part of Vela Software Group acquires, manages, and builds mission-critical vertical market software businesses. We are a portfolio of software businesses that have a presence in Australia, New Zealand and Asia-Pacific. We provide vertical market software expertise, operational support, and capital to help our businesses grow organically and through acquisitions.</p>\n<p>Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange.</p>\n"}, {"title": "Vela acquires WeShine Tech (WST) University Exam Enterprise Resource Planning (ERP) Platform", "link": "https://velasoftwaregroup.com/vela-acquires-weshine-tech-wst-university-exam-enterprise-resource-planning-erp-platform/", "date": "13 April, 2022", "content": "\n<p>Vela is pleased to announce the recent acquisition of WeShine Tech, which focuses on university examination process automation. Since its foundation in 2011, WeShine Tech has served over 7 million students with its flagship product, UniApps (exam ERP for universities), at some of the largest and most prestigious institutions in India.</p>\n<p>“This acquisition marks Vela Software’s entry into the Ed-Tech sector in India. We welcome WeShine Tech and its team as well as its customer base and look forward to supporting the company’s continued growth into its next stage.” Sandeep Ray, COO – EMEAA, Vela Software</p>\n<p>After an 11-year journey of success, WeShine Tech was looking to scale across geographies using both organic and inorganic means. Vela’s model appealed to them as being the perfect choice given the prospects Vela brings to the table. “The existing global presence and capital to pursue inorganic growth are completely in sync with what we perceived as the next expansion phase of WST. In addition to inheriting the support of an established brand to compete in the existing domestic market, we would also be able to accelerate the international effort we have recently initiated” Anupam Mangudkar, CEO, Founder &amp; Director, WeShine Tech. “We also highly appreciate the streamlined process and professional effort in completing the due diligence, as well as the complete transparency shown during the transaction.”</p>\n<p>CMO, WeShine Tech, Utkarsh V.Mangudkar, has experienced a surge of enthusiasm, determination and confidence in WeShine Tech with each team member fully energised to make their contribution to the business. “With a wide range of businesses and the global presence that CSI has, this opportunity will definitely promote growth within WST”. CTO, WeShine Tech, Ramkrishni Kulkarni, adds that he is particularly excited about the future of UniApps and its newly developed on-screen marking module. “This new module has great potential that is ready to be unlocked. We are eager to introduce it to an international market”.</p>\n<p>As a business unit within Vela Software Group, WeShine Tech will operate as a standalone organisation with Anupam Mangudkar continuing in the role as CEO &amp; President. The WeShine Tech team is excited to have Vela Software on board as they maintain their vision of automating administrative processes in educational institutions. As a result of this acquisition, customers can expect even further success with increased attention and support for ongoing product development along international expansion efforts.</p>\n<p><strong>About WeShine Tech</strong></p>\n<p>WeShine Tech has been providing ERP software to Indian universities since 2011. Its company’s innovative solutions help Higher education institutions manage all aspects of exams. This includes online recruitment tests, digitizing books for physical locations (where it is stored securely until day-of distribution) as well as allowing marking on digital records right through the process. This enables simplified processes in vast areas that have historically required manual intervention.</p>\n<p>WeShine Tech’s mission is to improve transparency, efficiency, and quality of evaluation and assessment processes in the education sector.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>Contact:</strong></p>\n<p>Esa Immonen, VP – Customer Experience</p>\n"}, {"title": "Vela acquires iSystain HSE Sustainability Reporting Platform", "link": "https://velasoftwaregroup.com/vela-acquires-isystain-hse-sustainability-reporting-platform/", "date": "2 March, 2022", "content": "\n<p>Brisbane, AU – March 2,  2022 – Vela is pleased to announce the recent acquisition of iSystain, a world class HSE management, sustainability and social impact reporting solution. Since its foundation in 2004, iSystain has worked with a number of organisations across multiple industrial sectors from SME’s to multinational corporations.</p>\n<p>“This is an exciting time for us as we welcome Jenni, Don and the whole iSystain team into the Vela group. The iSystain platform further enhances our capability to support customers to achieve their ESG and sustainability objectives” Chris Parry, VP ESG. “Their former careers and decades of working with HSE, sustainability reporting and technology are reflected in the iSystain platform. Both Jenni and Don share a true passion for business-led sustainable development and we are excited to have them join our team”.</p>\n<p>Independently recognised as a technology leader through the platform’s unique design, scalability, and configurability, iSystain empowers organisations to deliver sustainable change while realising environmental, social and financial benefits. “When we launched in 2004, we were one of the first integrated cloud-based HSE management and sustainability reporting solutions in Australia. Since then, we’ve continued to innovate and work closely with our clients to create one of the most comprehensive and integrated HSE, sustainability and social impact management platforms on the market.” Jenni Mulligan Co-founder iSystain. “Joining the Vela Group provides us with both the essential scaffolding and resources for global growth and the autonomy to nurture the heart and soul of our company so highly valued by our clients. We are excited to be joining the Vela Group as we enter the next phase of our business”.</p>\n<p>As a business unit within Vela, iSystain will continue to be led by Jenni Mulligan as Managing Director. Customers will continue to receive the same attention and focus that the iSystain team is known for. Vela Software will provide support for ongoing product development and international expansion as part of its ESG division. iSystain expands and complements Vela’s existing solutions such as Qmed and Zyght, which support organisations to manage a variety of HSE functions including environmental and waste management, supplier accreditation, incident and risk management, safe work permits, medical record management, COVID-19 screening, tracing and vaccinations and much more.</p>\n<p><strong>About iSystain</strong></p>\n<p>iSystain is a cloud-based platform uniquely designed to support Health, Safety &amp; Environment, Sustainability Reporting, Compliance &amp; Governance and Social Investment reporting. iSystain is designed for seamless integration within organisations existing software ecosystems providing powerful analytics and reporting capabilities to streamline the production of sustainability and performance reporting.</p>\n<p>Our mission is to make great software that delivers a material improvement in the world through understanding and supporting our client’s needs and innovating to solve tomorrow’s challenges.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>Contact:</strong></p>\n<p>Esa Immonen, VP – Customer Experience</p>\n"}, {"title": "Aquila expands across lending vertical with acquisition of Tekambi", "link": "https://velasoftwaregroup.com/aquila-expands-across-lending-vertical-with-acquisition-of-tekambi/", "date": "2 March, 2022", "content": "\n<p>TORONTO, March 2,  2022 – Aquila today announced the acquisition of Lead Envy, LLC (“Tekambi”), a fintech provider offering underwriting and decisioning software solutions in the consumer lending industry.</p>\n<p>Established in 2018, Tekambi is a customer-focused online lead management system for alternative credit lenders. With reliability and flexibility at its core, Tekambi is a robust plug-and-play solution that changes the way lenders manage their marketing campaigns and lead filtering process.</p>\n<p>“We are pleased to welcome Tekambi into the Aquila family,” said Daniel Lee, CEO of Aquila. “Aquila is committed to the alternative lending industry and Tekambi will be an integral addition to our group of companies.”</p>\n<p>Lee added, “Raphael Ocampo, CEO of Tekambi and his team have a proven history of rapid growth. Tekambi is a special time-tested business and Aquila is honored to co-build alongside management through operational support and capital.”</p>\n<p>“Our clients stand to benefit from the infrastructure of a larger, well-established software organization while also providing career growth opportunities for our talented employees,” stated Raphael Ocampo, CEO of Tekambi. “We look forward to advancing and serving the lending industry together with Aquila’s expertise.”</p>\n<p>Tekambi will continue to support its customers and partners as an autonomous business unit of Aquila.</p>\n<p><strong>About Tekambi</strong></p>\n<p>Tekambi is a credit risk underwriting solution that enables lending portfolios the power to control any aspect of the lead purchasing process. Founded by a team of experienced technical leaders, its underwriting and decisioning modules simplify lead management for the lending industry. For more information: <a href=\"https://www.globenewswire.com/Tracker?data=f_prx2QjgEY2Q1l8kYZ2F-SVHlPPbg_-gLK2uH_1VzJBOlVdK0DlZD157DqA1qzQZiuuLX6jdHXFlgzrgcL4UQ==\" rel=\"noreferrer noopener\" target=\"_blank\">www.tekambi.com</a></p>\n<p><strong>About Aquila</strong></p>\n<p>Aquila backs category leaders across software. With global institutional reach throughout media, finance, government, real estate and education, Aquila exists to help software operators build lasting companies through permanent capital. Aquila is a division within Vela Software, and a wholly owned subsidiary of Constellation Software Inc. For more information: <a href=\"https://www.globenewswire.com/Tracker?data=wo7CZOxH4KnCAy78br0hCRxQ6YTp2wlqUCnhtPGpnKdeT1EXRam_q_GdWKDRa91VjG6W7N5LuGj4bLK0_jVEZg==\" rel=\"noreferrer noopener\" target=\"_blank\">www.aquilasw.com</a></p>\n<p><strong>Contact:</strong></p>\n<p>Richard Hyun<br/>Vice President, Corporate Development<br/><a href=\"mailto:rhyun@aquilasw.com\">rhyun@aquilasw.com</a></p>\n"}, {"title": "CMS GlobalSoft Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/cms-globalsoft-acquired-by-fog-software-group/", "date": "2 March, 2022", "content": "\n<p>March 2,  2022 – (Rosemont, IL) – <strong>– FOG Software Group</strong> (“FOG”), a division of Vela Software, and Constellation Software, Inc. [TSX: CSU] today announced that it has acquired Lorton, VA-based CMS GlobalSoft (“CMS”), a leader in global, enterprise-wide, multi-carrier shipping solutions.</p>\n<p>Following the acquisition, CMS will operate as an independent division of FOG Software Group within its Supply Chain and Logistics portfolio. The company will continue to develop, enhance, service, and support its market-leading shipping software, WorldLink, in providing a competitive edge to customers.</p>\n<p>“CMS GlobalSoft is a great addition to our growing portfolio of shipping and transportation management software for the supply chain,” said Andy Hodge, FOG Software Group Portfolio Manager for Supply Chain and Logistics. “We are delighted to welcome CMS with their proven, carrier-compliant solutions for medium- and high-volume shippers, and their impressive, company-wide focus on maximizing customers’ return on investment.”</p>\n<p>“We are excited to be a part of FOG Software Group,” said Wil Fekeci, President of CMS. “As well as being a leader in the shipping industry, they also share our belief in the importance of customer service and technological advancement in the supply chain.”</p>\n<p><strong>About FOG Software Group</strong></p>\n<p>Rosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software &lt;velasoftwaregroup.com&gt;. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About CMS GlobalSoft</strong></p>\n<p>CMS GlobalSoft is a global provider of enterprise-wide, browser-based, multi-carrier shipping and manifesting software that allows companies to manage multiple distribution centers located anywhere in the world from a convenient and centralized server. Learn more about CMS GlobalSoft online &lt;cmsglobalsoft.com&gt;.</p>\n"}, {"title": "Commerce Sync Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/commerce-sync-acquired-by-fog-software-group/", "date": "25 February, 2022", "content": "\n<p>25 February 2022 – (Denver, CO) – <strong>FOG Software Group</strong> (“FOG”), an operating group of <strong>Vela Software</strong>, and <strong>Constellation Software</strong> Inc. [TSX: CSU], is pleased to announce the acquisition of Commerce Sync, developers of software that automates accounting for small- and medium-sized businesses.</p>\n<p>Following the acquisition, Commerce Sync will operate as an independent division of FOG Software Group. The addition of Commerce Sync expands FOG Software’s capability as a leading multichannel retail and eCommerce platform for high-performing small- and medium-sized businesses.</p>\n<p>“We are thrilled to welcome Commerce Sync to our growing Portfolio,” said Tony Kyberd, General Manager, Retail &amp; eCommerce Group, FOG Software Group. “Commerce Sync already has a significant market presence, and we are excited to support them in the next stage of their growth plans.”</p>\n<p>“Joining Fog Software enables us to take advantage of the considerable experience and resources the FOG team enables for its Portfolio companies,” said Russ Dhooge, President, Commerce Sync. “It provides us with the stability and strength to focus on growing the business and providing even more value for our customers and partners.”</p>\n<p>As part of Vela and Constellation Software, the FOG Software Group acquires, builds, and retains companies while helping them grow. Commerce Sync will benefit from FOG’s knowledge and relationships in the industry as well as Constellation Software’s best practices, developed over 25 years through acquisitions and operation of over 700 enterprise software businesses.</p>\n<p><strong>About FOG Software Group</strong></p>\n<p>Rosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software <a href=\"https://velasoftwaregroup.com\">velasoftwaregroup.com</a> and Constellation Software, Inc. [TSX: CSU] <a href=\"http://csisoftware.com\">csisoftware.com</a>. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries. For more information, visit <a href=\"http://Rosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software velasoftwaregroup.com and Constellation Software, Inc. [TSX: CSU] csisoftware.com. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries. For more information, visit fogsoftwaregroup.com.\">fogsoftwaregroup.com</a>.</p>\n<p><strong>About Commerce Sync</strong></p>\n<p>Commerce Sync provides technology that automates accounting for thousands of small and medium-sized businesses (SMBs). By eliminating manual data entry, the company helps business owners realize valuable time savings, increase accuracy, and get complete visibility into their accounting. Located in downtown Denver, Commerce Sync works with the largest and fastest-growing companies in payments and commerce, including Visa, Square, First Data, Intuit, and Xero. Learn more at <a href=\"http://commercesync.com\">commercesync.com</a>.</p>\n<p><strong>Editorial contact:</strong></p>\n<p>Sandy Scott, Portfolio Manager, Supply Chain and Logistics, FOG Software Group, <a href=\"mailto:sscott@fogsoftwaregroup.com\">sscott@fogsoftwaregroup.com</a></p>\n"}, {"title": "Verdazo Analytics acquired by Omnira Software", "link": "https://velasoftwaregroup.com/verdazo-analytics-inc-press-release-omnira-software/", "date": "15 February, 2022", "content": "\n<p>Calgary, Alberta (February 15th, 2022) – Omnira Software, a division of Vela Software and Constellation Software, Inc. [TSX: CSU], is pleased to announce it has acquired Verdazo Analytics, Inc. (“Verdazo”), headquartered in Calgary, AB.</p>\n<p>Verdazo is a leader in discovery analytics software with a mission to provide energy producers with easy-to-use data visualization capabilities that inform decisions on production enhancement and operational efficiency.</p>\n<p>“We are thrilled with Verdazo joining the Omnira family and combining forces with MOSAIC. Verdazo brings the analytics capabilities to support our clients in their search for operation efficiencies, and in combination with MOSAIC, supports capital investment decisions to maximize shareholder value” said Francisco Gomez, Omnira Software CEO.</p>\n<p><strong>About Verdazo Analytics</strong>. Founded in 2006 as Visage Information Solutions and rebranded as Verdazo Analytics in 2016, the company continues to navigate the leading frontiers of analytics and help clients across industries make smarter, faster decisions by revealing the hidden insights in complex data.</p>\n<p><strong>About Omnira Software</strong>. Passionate about efficiency and high-quality data, the Omnira team created MOSAIC as a single-system software solution to help oil and gas professionals make better capital investment decisions to find and develop their hydrocarbon resources, aiming to maximize shareholder value.</p>\n<p><strong>About Vela </strong>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "CEI GROUP ACQUIRES PAULIN RESEARCH GROUP", "link": "https://velasoftwaregroup.com/cei-group-acquires-paulin-research-group/", "date": "25 January, 2022", "content": "\n<p>Houston, Texas (January 25th, 2022) – Computer Engineering, Inc., a division of Vela Software and Constellation Software, Inc. [TSX:CSU], is pleased to announce it has acquired Engineering Physics Services, Inc., dba Paulin Research Group (“PRG”), with headquarters in Houston, TX.</p>\n<p>PRG is a global provider of market leading Finite Element Analysis software such as NozzlePro, FEPipe, and FEATools serving the pressure equipment and piping industries for over 25 years.</p>\n<p>“We welcome Tony Paulin and the team at PRG. They have built a critical software package that reduces material and labor costs while increasing safety and reliability of pressure systems around the world. We look forward to strengthening the integration of our mutual products, offering the most holistic pressure equipment design solution in the industry.” said Mike Hartnett, CEI CEO.</p>\n<p><strong>About Paulin Research Group.</strong> In 1991, Mr. Paulin founded PRG to apply the latest FEA technology to the pressure vessel and piping industries. PRG has enjoyed a steady and stable growth and expanded its products and features through physical testing and sheer tenacity.</p>\n<p><strong>About Computer Engineering, Inc. </strong>Headquartered in the Kansas City area, with offices in Houston and the United Kingdom, CEI brings pressure equipment design and fabrication software to a global industry supporting the backbone of Energy, Chemical, Pharmaceutical, Food/Beverage, Construction, and Heavy Equipment.</p>\n<p><strong>About Vela </strong>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Reprise Software Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/reprise-software-acquired-by-fog-software-group/", "date": "14 January, 2022", "content": "\n<p>January 14, 2022 – FOG Software Group (“FOG”), an operating group of Vela Software, and Constellation Software Inc. [TSX:CSU], is pleased to announce the acquisition of Reprise Software, developers of the Reprise License Management (“RLM”) product.</p>\n<p>RLM is a fully featured suite of tools that enables independent software vendors (ISVs) to secure and monetize their products, whether they be desktop, network or cloud based. Utilizing a single API for all licensing types, clients can easily create and deploy keys for a variety of environments, reducing development effort and cutting down time required to manage licenses. Additionally, clients can choose to host their own license servers or utilize RLM through a hosted service to make license deployment trivial for customers. Boasting a history that goes back to the early days of license management, RLM remains a trusted and vital partner for top companies.</p>\n<p>Tom Chan, CEO of the FOG Software Group STEM Portfolio, expressed his excitement of the opportunity to acquire Reprise, saying “We have used RLM in our products for more than a decade and have always found the software and service to be top notch and an excellent value. We are thrilled to be able to carry the Reprise legacy forward – always providing best in class service and ensuring that RLM continues to meet our customers’ varied needs during a dynamic period in software entitlement.”</p>\n<p><strong>If you have any questions about this acquisition, or the capabilities of RLM, please contact Reprise Software at information@reprisesoftware.com.</strong></p>\n<p><strong>About FOG Software Group</strong>. FOG Software Group (www.fogsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) and Constellation Software, Inc. [TSX:CSU] which is a US$3.5 billion consolidated revenue software conglomerate headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About Reprise Software.</strong> Based in California, Reprise Software (www.reprisesoftware.com) is a leading provider of license management tools for software ISVs in many verticals including engineering, CAD/CAM, heavy industry and scientific applications. Known for providing excellent service and an easy to integrate API, RLM is used by hundreds of clients, worldwide.</p>\n"}, {"title": "Datamine acquires Zyght HSE solution", "link": "https://velasoftwaregroup.com/datamine-acquires-zyght-hse-solution/", "date": "13 January, 2022", "content": "\n<p><strong>Datamine is pleased to announce it has acquired Zyght, a leading health, safety and environment solution for high impact industries. Since its foundation in 2011, Zyght has become a dominant player in the Latin American market for HSE compliance, risk management, reporting and governance.</strong></p>\n<p>“I’m excited to accelerate the growth of Datamine’s ESG division by adding an established, well-respected team with a deep understanding of the mining industry,” said Dylan Webb, Datamine CEO. “Zyght’s founders Rodrigo Calle and Mario Jara were born and bred in Chuquicamata and have mining in their blood. Having early careers as mining engineers before moving into environment, health and safety has resulted in an exceptional product servicing the specific requirements of mining and other high impact industries.”</p>\n<p>Zyght has established itself with top tier mining, manufacturing and infrastructure businesses in Chile and had already started the process of international expansion with customers throughout Latin America. CEO of Zyght, Rodrigo Calle, said “We are excited to join the Datamine group and ramp up our global expansion plans. Through Datamine we can now reach customers anywhere in the world through a network of 27 offices in 20 countries.”</p>\n<p>As a business unit within Datamine, Zyght will continue to be led by Rodrigo Calle as CEO and existing customers will receive the same attention and focus on their HSE needs. Datamine will provide support for ongoing product development and international expansion as part of its recently announced ESG division. Zyght is highly complementary to Qmed, Datamine’s existing solution for managing medical facilities, occupational health and COVID-19 screening, tracing and vaccinations</p>\n<p><strong>About Zyght. </strong>Zyght provides a comprehensive solution for environment, injury and risk management, safe work plans, document management, compliance, reporting and analytics. Our mission is to reduce workplace accidents, eliminate fatalities and protect the environment in industrial settings.</p>\n<p><strong>About Datamine.</strong> Datamine is the world’s leading provider of technology to seamlessly plan and manage mining operations. With offices in twenty countries, Datamine provides solutions spanning geology, mine planning, production, logistics and ESG to over 6,000 companies worldwide. Our implementation, training and advisory services ensure customers receive industry-leading support and leverage full value from their technology investment.</p>\n<p><strong>For media enquiries please contact:</strong></p>\n<p>Esa Immonen, VP – Customer Experience, Datamine</p>\n<p>Email: Esa.Immonen@dataminesoftware.com</p>\n"}, {"title": "MCS Grupa acquired by Juniper Group", "link": "https://velasoftwaregroup.com/mcs-grupa-acquired-by-juniper-group/", "date": "3 January, 2022", "content": "\n<p><strong>Zagreb, February 1, 2022 – IN2 Group, a division of Juniper Group, an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is pleased to announce it has acquired MCS Grupa, an advanced Croatian developer of web-based information systems for Primary and Secondary Health Care.</strong></p>\n<p>With this acquisition, IN2 Group expands and consolidates its portfolio of services and products for all its customers in the healthcare industry, reconfirming its leading position in the market and certifying its unbeatable value proposition across the entire vertical in the region.</p>\n<p>“The acquisition of the MCS Grupa brings us complementary software solutions to those formerly provided by IN2 Group in the healthcare vertical. The experience, expertise and quality of MCS Grupa’s solutions and employees will contribute to the fulfillment of our plans, expand our customer base, and further strengthen our long-term collaboration with our customers as their main trustworthy partner” stated Denis Jašarević, CEO of IN2.</p>\n<p>Nikola Juranić, newly-appointed CEO of MCS Grupa commented: “We are especially pleased and proud to be recognized as a desirable and trusted software and services provider of a leading international software conglomerate as Juniper Group. For us, it was crucial that Juniper Group ensures business continuity and the development of our core solutions and growth plan. For our employees, it is an opportunity to enhance their careers and personal development”.</p>\n<p><strong>About MCS Grupa.</strong> Based in Zagreb, Croatia, MCS Grupa is one of the leading Croatian developers of healthcare information systems, having over 20 years of experience. MCS Grupa’s integrated product suite includes complex cloud solutions for healthcare and related activities, such as electronic ordering systems, advanced medical data analysis or decision-making support systems. Currently, MCS Grupa solutions are used by 2,000 primary healthcare teams, 600 specialized consultative healthcare teams and 70 polyclinics of various medical specialties. More info at <a href=\"https://mcs.hr/\">https://mcs.hr/</a>.</p>\n<p><strong>About IN2 Group.</strong> IN2 Group, a division of Juniper Group, has been developing software for various industries in Croatia for almost 30 years and therefore gained significant experience in the development and implementation of software solutions in almost all business sectors. The group operates in five countries in the region having more than 300 customers mainly active in the healthcare, financial, insurance and public sectors. More info at <a href=\"https://in2.hr/\">https://in2.hr/</a> and <a href=\"https://juniper-group.com/\">https://juniper-group.com/</a></p>\n<p>For media enquiries please contact:</p>\n<p>Vanesa Espinosa |VP Governance &amp; Organization | Juniper Group Email: vanesa.espinosa@juniper-group.com</p>\n"}, {"title": "Fujitsu Glovia, Inc. Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/fujitsu-glovia-inc-acquired-by-fog-software-group/", "date": "8 December, 2021", "content": "\n<p><strong>El Segundo, California</strong> ‒ FOG Software Group (“FOG”), an operating group of Vela Software and Constellation Software Inc. [TSX:CSU], is pleased to announce it has acquired Fujitsu Glovia Inc.(“FGI”), with headquarters in El Segundo, CA and satellite offices in the Netherlands, United Kingdom and Thailand.</p>\n<p>FGI’s flagship ERP solution GLOVIA G2 is a leading global easy-to-implement discrete manufacturing ERP system for small to large businesses. FGI is an innovator in smart manufacturing ERP solutions, helping small and large manufacturers and assembly companies domestically and worldwide optimize, manage and grow their operations. From single-location manufacturers to multi-national, multi-lingual, multi-currency corporations, FGI has an established and growing customer base.</p>\n<p>FGI will be an independent business unit within FOG’s portfolio of Smart Manufacturing software companies. FGI will continue to work closely with its customers and offer innovative smart industry software solutions for its chosen industries.</p>\n<p>“GLOVIA G2 is yet another great addition to our portfolio of Smart Manufacturing software companies. Manufacturing is undergoing a digital transformation and our customers are looking for a stable and strategic vendor to help them navigate and capitalize on their digitization journey. Our complementary group of software companies forms a Smart Manufacturing software portfolio under the FOG umbrella. It provides our customers with a broad range of solutions to take their operations to Industry 4.0. Given GLOVIA G2’simpressive and loyal customer base, experienced team and breadth of product offering focused on Manufacturing ERP, we have further expanded our competitive advantage. We are very pleased to be able to add GLOVIA G2 to our portfolio as we continue to grow our footprint with the ERP market pursuing smart manufacturing strategies”, said Magnus Sandberg, Group CEO of the Smart Manufacturing portfolio of companies. “We look forward to combining FGI’s talented team and deep industry experience with our financial strength and operational excellence.”</p>\n<p>“We are thrilled to see the FGI team join the FOG software group, who will promote long term innovation that will benefit both customers, prospects and our experienced loyal staff”, says Zen Nishi, former CEO of Fujitsu Glovia, Inc. “This provides FGI with the stability and strength of partnering with a company that is focused on growing the business and providing its customer base with a secure future going forward”.</p>\n<p><strong>About FOG Software Group. </strong><a href=\"http://www.fogsoftwaregroup.com/\">www.fogsoftwaregroup.com</a>) is an operating group of Vela Software (www.velasoftwaregroup.com) and Constellation Software, Inc. [TSX: CSU] (<a href=\"http://www.csisoftware.com/\">www.csisoftware.com</a>) which is a US$3.8 billion consolidated revenue software conglomerate headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About <strong>Fujitsu Glovia, Inc.</strong> Fujitsu Glovia, Inc.</strong> (<a href=\"http://www.glovia.com/\">www.glovia.com</a>) is the leading provider of ERP solutions for the discrete manufacturing industry. The ERP solution GLOVIA G2 offers complete functionalities for a wide range of industries, including machine &amp; equipment construction, industrial products &amp; projects, automotive, electronics and aviation &amp; defense. Complete sector-specific solutions are available within GLOVIA G2. The suite’s extensive capabilities enable manufacturing companies to manage the full life cycles of their products, from design, production and delivery to installation, maintenance and support.</p>\n<p><strong>Contact</strong></p>\n<p><strong>Ad-Jan van Rooij| VP Global Sales| marketing@glovia.com | </strong><a href=\"http://www.glovia.com/\"><strong>www.glovia.com</strong></a></p>\n"}, {"title": "BIOSYSTEMES Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/biosystemes-acquired-by-fog-software-group/", "date": "7 December, 2021", "content": "\n<p><strong>FOG Software further expands its growing portfolio of statistical and sensory science tools through its acquisition of BIOSYSTEMES, developers of FIZZ software for consumer and sensory testing.</strong></p>\n<p><strong>December 1, 2021</strong> – – BIOSYSTEMES develops FIZZ software, a powerful suite of tools used by major food and beverage companies, CPG multinationals, and leading cosmetics and personal care brands to plan, execute, and analyze consumer and sensory tests, leading to insights that help these companies launch and refine successful products. With over 36 years of research and innovation, BIOSYSTEMES sets the standard for sensory research software.</p>\n<p>Tom Chan, CEO of the FOG Software Group STEM Portfolio, views the acquisition as an opportunity to provide increased capabilities, knowledge, and research to sensory professionals by combining BIOSYSTEMES’ expertise and FOG Software Group’s resources. He adds, “Burgundy is a region with strong culinary and cultural traditions. It boasts a range of world-famous food and wine products, and we are thrilled to add a passionate team of sensory science professionals from an area that pioneered taste and sensory research. There has never been a more important time for companies to invest in their products and brands. We are eager to help BIOSYSTEMES reach a new level of success.”</p>\n<p>“We are delighted to partner with FOG Software Group to continue the legacy that my co-founders and I have built over the past 36 years,” added general manager and co-founder, Pascal Lenzi. “Their ‘acquire, strengthen, and grow’ approach combined with their buy and hold investment philosophy gives BIOSYSTEMES a solid foundation upon which it can build into the future. I am excited to see the many accomplishments that our management team and the FOG Software Group will achieve together.”</p>\n<p><strong>If you have any questions about this acquisition, or the capabilities of FIZZ by BIOSYSTEMES, please contact BIOSYSTEMES at information@biosystemes.com.</strong></p>\n<p><strong>About FOG Software Group. </strong>FOG Software Group (www.fogsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) and Constellation Software, Inc. [TSX:CSU] which is a US$3.5 billion consolidated revenue software conglomerate headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About BIOSYSTEMES</strong>. Based in Dijon, France, BIOSYSTEMES (www.biosystemes.com) is a provider of software solutions for sensory analysis and consumer testing. FIZZ software is used by sensory professionals in food and beverage, cosmetics, personal care, and CPG companies around the world and is supported by a team of skilled sensory science professionals.</p>\n"}, {"title": "Aquila strengthens global media footprint through acquisition of Jaicom Oy", "link": "https://velasoftwaregroup.com/aquila-strengthens-global-media-footprint-through-acquisition-of-jaicom-oy/", "date": "8 November, 2021", "content": "\n<p><strong>Toronto, Canada – November 2, 2021</strong> – Aquila announced today that it has completed the acquisition of Jaicom Oy (“Jaicom”) through its subsidiary Atex Media Limited (“Atex”).</p>\n<p>Founded in 1999 with north of 400 publications relying on Jaicom’s products and services in their subscription and distribution operations, Jaicom is a tried-and-true provider of customer management systems across the Nordics and rest of Europe. The company offers the broadest range of software and services in the market to support newspapers, magazine publishers and associations.</p>\n<p>Daniel Lee, CEO of Aquila, noted, “Jaicom is the market-leader in their space and a great match for Aquila as we continue to invest and strengthen our position in the global media vertical. With clearly complementary products, I’m excited for what the future holds for both Jaicom and Atex’s customers and employees.”</p>\n<p>“We are delighted to welcome Jaicom into the Atex family,” said Federico Marturano, CEO of Atex. “In continuously supporting our customers with their digital journey, this event is a great step to improve our offering in subscription-based journalism.”</p>\n<p>Jorma Ainassaari, CEO of Jaicom, added, “We at Jaicom are looking forward to integrating with the Atex family. This is a great opportunity for us to take our business to the next level, as well as continue to enhance and develop our products and services.”</p>\n<p><strong>About Jaicom. </strong>Jaicom provides customer management systems across the Nordics and rest of Europe. Hundreds of publications are currently using its comprehensive system Kayak to manage subscriptions and distribution. The company is headquartered in Finland and has operations in several European countries, including Sweden, UK and Germany. For more information: www.jaicom.com</p>\n<p><strong>About Atex</strong>. Atex is a leading software company selling solutions for media-rich industries. Atex is committed to helping companies build revenues and reduce costs through products that are increasingly personalised, localised, collaborative, contextually relevant, and available on-demand. For more information: www.atex.com</p>\n<p><strong>About Aquila.</strong> Aquila backs category leaders across software. With global institutional reach throughout media, finance, government, real estate and education, Aquila exists to help software operators build lasting companies through permanent capital. Aquila is a wholly owned subsidiary of Constellation Software Inc.. For more information: www.aquilasw.com</p>\n<p>Contact:</p>\n<p>Richard Hyun</p>\n<p>Vice President, Corporate Development</p>\n<p>rhyun@aquilasw.com</p>\n"}, {"title": "Topicus.com and CGG complete sale and transfer of GeoSoftware Business to Topicus.com and Vela Software", "link": "https://velasoftwaregroup.com/topicus-com-and-cgg-complete-sale-and-transfer-of-geosoftware-business-to-topicus-com-and-vela-software/", "date": "6 October, 2021", "content": "\n<p>Topicus.com Inc. (“Topicus”) (TSXV: TOI) today announced that Topicus and CGG S.A. (“CGG”) have completed the sale and transfer of the GeoSoftware Business to Topicus and Vela Software for a total cash consideration of US$95 million (subject to certain customary closing adjustments).</p>\n<p><strong><strong>About Vela Software</strong></strong>. Vela is a global provider of software solutions to a number of vertical industries with broad and deep market knowledge in the Energy and Resources software. As an operating group of Constellation Software Inc., Vela acquires, manages, and builds industry specific software businesses which provide specialized, mission-critical software solutions. Vela’s goal is for its companies to become leaders in their respective verticals by investing in their operations, growing through organic initiatives, and by seeking acquisitions that can strengthen their market position.</p>\n<p><strong><strong>About <strong>Topicus.com</strong></strong></strong>. Topicus.com Inc. is a leading pan-European provider of vertical market software and vertical market platforms to clients in public and private sector markets. Operating and investing in countries and markets across Europe with long-term growth potential, Topicus.com Inc. acquires, builds and manages leading software companies providing specialized, mission-critical and high-impact software solutions that address the particular needs of customers.</p>\n<p>For further information, </p>\n<p>contact: Topicus.com Inc. </p>\n<p>Jamal Baksh, Chief Financial OfficerTel: (416) 861-9677</p>\n<p><strong>About CGG</strong>. CGG (<a href=\"http://www.cgg.com/\" rel=\"noreferrer noopener\" target=\"_blank\">www.cgg.com</a>) is a global geoscience technology leader. Employing around 3,700 people worldwide, CGG provides a comprehensive range of data, products, services and solutions that support our clients to more efficiently and responsibly solve complex natural resource, environmental and infrastructure challenges. CGG is listed on the Euronext Paris SA (ISIN: 0013181864).</p>\n<p>For further information, contact:</p>\n<p>Group Communications &amp; Investor Relations</p>\n<p>Christophe Barnini</p>\n<p>Tel: + 33 1 64 47 38 11</p>\n<p>E-Mail: <a href=\"mailto:christophe.barnini@cgg.com\">christophe.barnini@cgg.com</a></p>\n"}, {"title": "SOCOTEC UK selects Spectra QEST’s Platform", "link": "https://velasoftwaregroup.com/socotec-uk-selects-spectra-qests-platform/", "date": "6 October, 2021", "content": "\n<p><strong>Spectra QEST, a globally leading vendor in technical information management systems for construction materials and geotechnical testing, is pleased to announce a dynamic entry to the UK market with the signing of SOCOTEC UK.</strong> </p>\n<p>Delivering seven million tests a year to more than 5,000 clients, SOCOTEC UK is the market leader for testing, inspection and compliance services in the UK construction sector. </p>\n<p>In 2021, SOCOTEC commenced operations at SOCOTEC Central, a major strategic facility based in Coventry, England. Amongst other business units, the facility incorporates the Group’s geotechnical operations team and the materials testing staff, as well as state-of-the-art aggregates and concrete testing laboratories. </p>\n<p>This significant investment led to the selection of the QEST platform by Spectra QEST as the software solution of choice. This software will help to manage SOCOTEC’s field and laboratory testing operations, schedule field technicians, interface with testing equipment and communicate technical information to clients. It also aligns directly with the organisation’s strategic ambition to grow its digitisation capabilities.  </p>\n<p>“This major investment is expected to transform our service delivery in the future and will further enhance and grow our existing digital capabilities in the UK,” said Philip Ball, technical innovation director, SOCOTEC UK. </p>\n<p>“It will also complement the state-of-the-art capabilities at our new SOCOTEC Central office and laboratory facility, enabling improved end-to-end data processing and instrument interfacing. </p>\n<p>“After an exhaustive market assessment, we were pleased to find a partner in Spectra QEST and are confident that the QEST platform (supported by the specialists at Spectra QEST) will be successfully implemented to service our demanding needs in the UK.” </p>\n<p>Dirk Janek, CEO, Spectra QEST, said: “Spectra QEST has a long history of working with market leaders to explore new business opportunities and enter new markets. </p>\n<p>“We were very pleased to see that after a meticulous examination of the leading vendors in the industry, SOCOTEC chose Spectra QEST for this transformative investment.  </p>\n<p>“I am confident that our experts, working together with the high calibre SOCOTEC team, will deliver a solution that will help SOCOTEC cement their market-leading position and be the best possible reference we could have for the UK.” </p>\n<p><strong>About Spectra QEST.</strong> An operating company of Vela Software International, Inc., itself an operating group of Toronto-based Constellation Software, Inc. (CSI), Spectra QEST is a software development and services company specialising in solutions for the construction materials engineering, testing, inspection and production industries. </p>\n<p>Founded in 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices in Adelaide, South Australia and Sacramento, California, it services customers in North America, Australasia, the Middle East and soon the United Kingdom. These customers include leading international construction companies, construction materials and geotechnical companies, construction materials manufacturers and government bodies. </p>\n<p><strong>About the SOCOTEC Group.</strong> With facilities in more than 40 countries and over 8,000 clients, the SOCOTEC Group delivers services to improve the performance of businesses and local authorities through risk management. </p>\n<p>The company provides assistance to clients across the world and throughout the lifecycles of their projects in the areas of quality, health and safety and the environment. In 2020, the company made €907 million in consolidated revenues and is now present in 23 operational bases. </p>\n<p><strong>About SOCOTEC UK.</strong> SOCOTEC is the UK’s leading provider of testing, inspection and compliance services, with comprehensive solutions in the Infrastructure, Safety Compliance &amp; Sustainability, Environmental Compliance, Environmental Science, Building Control and Fire Consultancy sectors.</p>\n<p><strong>Contacts</strong> <br/>Dirk Janek, CEO, Spectra QEST <br/>+61 8 8360 8900, media@spectraqest.com </p>\n"}, {"title": "Aquila Acquires Infinity Enterprise Lending Systems", "link": "https://velasoftwaregroup.com/aquila-acquires-infinity-enterprise-lending-systems/", "date": "8 September, 2021", "content": "\n<p><strong>Toronto, Canada – September 8, 2021 –  </strong>Aquila, a division of Constellation Software Inc. [TSX: CSU], announced today that it has completed the acquisition of Infinity Enterprise Lending Systems (“Infinity Software”).</p>\n<p>Founded in 2000, Infinity Software provides category-leading loan management systems to alternative credit lenders. Its flexible all-in-one platform makes it easy for lenders to process loans, grow their customer base and scale their business.</p>\n<p>“We are thrilled to welcome Infinity into the Aquila family,” said Daniel Lee, CEO of Aquila. “As we continue to grow and invest in the alternative lending space, Infinity is a wonderful complement and strategic fit with our existing businesses.”</p>\n<p>Lee added, “The Leyva family has shown unwavering commitment to the industry, their customers and their partners. They have built a great business, and we look forward to sharing Aquila’s operational best practices to support Infinity in their continued journey.”</p>\n<p>Ryen Leyva, CFO of Infinity Software, noted, “We have absolutely loved working with all of our clients thus far. This is a tight industry with many close friendships. We are so happy to leave Infinity and our clients in the trusted hands of Aquila, who we believe will keep making this space better.”</p>\n<p>Infinity Software will maintain their autonomy operating as an independent business unit of Aquila. With a permanent-hold worldview to acquisitions, Aquila looks forward to being a forever home for Infinity’s employees, clients and partners.</p>\n<p><strong><strong>About Infinity Software</strong></strong>. Infinity Software builds world-class solutions for alternative credit lenders throughout North America. Its loan management system is exclusively designed for the short-term lending industry to help lenders create their own loan products, market and sell, support their customers and manage collections. For more information: <a href=\"https://www.infinitysoftware.com/\">www.infinitysoftware.com</a></p>\n<p><strong><strong>About Aquila</strong></strong>. Aquila backs category leaders across software. With global institutional reach throughout media, finance, government, real estate and education, Aquila exists to help software operators build lasting companies through permanent capital. Aquila is a wholly owned subsidiary of Constellation Software Inc. For more information: <a href=\"https://www.aquilasw.com/\">www.aquilasw.com</a></p>\n<p>Abo<strong>ut Constellation Software Inc.</strong> Constellation’s common shares are listed on the Toronto Stock Exchange under the symbol “CSU”. Constellation acquires, manages and builds vertical market software businesses. For more information:  <a href=\"https://www.csisoftware.com/\">www.csisoftware.com</a></p>\n"}, {"title": "COVID-19 Vaccination Software Has Now Been Released to the Australian Market", "link": "https://velasoftwaregroup.com/covid-19-vaccination-software-has-now-been-released-to-the-australian-market/", "date": "25 August, 2021", "content": "\n<p><strong>Perth, Australia – August 25, 2021 –  </strong>Product release – QMED: Integrated Health Management.</p>\n<p><strong>Qmed </strong>is a leading market vendor in the South African mining industry, and was acquired earlier this year by Datamine. <a href=\"https://www.linkedin.com/in/jan-small-1463638/\">Qmusik CEO, Jan Small</a>, shares, “We’ve assisted many operations in South Africa to manage the health information of their workforce for years now. Qmed helped companies like De Beers to rollout the COVID19 vaccination across multiple sites and at a rapid pace.”</p>\n<p>With the acceleration of the COVID-19 vaccination rollout in Australia, Datamine is proud to release <a href=\"https://www.qmedsoftware.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Qmed,</a> a leading solution for medical record management to the Australian market. </p>\n<p>Qmed offers organisations not only cost savings but also greater efficiency by streamlining multiple functions into one comprehensive platform. With features like health incident management for IODs or wellness appointment reminders available via their mobile app – it has fast become an essential solution for mining operations in light of the COVID-19 vaccination rollout. </p>\n<p>“We’re at a point in time where having a simple way to manage health data is more important than ever – and the urgency to get workforces vaccinated to move forward is a key way companies can do that,” said <a href=\"https://www.linkedin.com/in/dywebb/\" rel=\"noreferrer noopener\" target=\"_blank\">Dylan Webb, Datamine CEO.</a>  </p>\n<p>If you are interested in Qmed to assist with the COVID-19 vaccination rollout in Australian mining operations, visit the website <a href=\"https://www.qmedsoftware.com/\">here</a>.  </p>\n<p><strong>About Qmuzik.</strong> Qmuzik Technologies, the owner of Qmed, is a Software Development House based in South Africa. The company has established itself as a market leader in the niche areas it has identified by supplying systems developed in close collaboration with industry leaders. By supplying implementation and support services, Qmuzik Technologies stays close to the customer base and ever evolving requirements. The Qmuzik group is organised into focused entities to further enhance customer service. </p>\n<p><strong>About Qmed. </strong>Qmed provides organizations and medical staff with an Integrated Health Management System. The system encompasses key areas in the Healthcare environment including Booking &amp; Scheduling, Medical Surveillance (Occupational Health), Primary Healthcare, Heath Incidents (IOD), Wellness Appointment Reminders and more. With customers including De Beers, South 32, Northam Platinum Ltd, Anglo American Platinum, Glencore and more – it is a well established solution for mining and private sector businesses. </p>\n<p><strong>For more information about Qmed please their website at <a href=\"https://www.qmedsoftware.com/\">https://www.qmedsoftware.com/</a>, or email us at <a href=\"mailto:marketing@dataminesoftware.com\">marketing@dataminesoftware.com</a>.</strong></p>\n"}, {"title": "JUNIPER GROUP ACQUIRES AVALON INFORMÁTICA", "link": "https://velasoftwaregroup.com/juniper-group-acquires-avalon-informatica/", "date": "13 August, 2021", "content": "\n<p><strong>August 13, 2021 – Juniper Group</strong>, a division of Vela Software, and Constellation Software, Inc. (TSX:CSU), today announced that it has completed the acquisition of Avalon Informática y Servicios Group (“Avalon”).</p>\n<p>Since 1986, Madrid-based Avalon develops advanced PoS and ERP systems for service stations, convenience stores and fuel distribution centers across Spain and Latin America. Its highly integrated soft-and hardware solutions allow clients to manage their entire operations in real time.</p>\n<p>Following the acquisition, Avalon will operate as an independent division of the Juniper Group. The company will continue to develop, enhance, service, and support their range of software and hardware solutions in providing a competitive edge to its customers.</p>\n<p>“We are very excited to welcome the Avalon team into the Juniper Group family. We expect to continue their excellent customer advocacy and reputation under our ownership” said Jaime Sastre, CEO, Portfolio Manager at Juniper Group. “As always, we look forward to combining Avalon’s deep industry expertise with Juniper Group’s best practices and software specialists to provide Avalon’s customers with the best products and services possible, helping them to drive business growth.”</p>\n<p>Gerardo Navarro, CEO of Avalon stated, “the mission for any company is to add value to employees, customers and shareholders. To me, this transaction is a great success for the former shareholders, bringing to fruition a project which began several decades ago. Becoming part of a leading international and well-reputed group of software companies is also an exciting opportunity for our employees and customers. For our employees, it will lead to accelerate and improve their development, having the possibility to move up within the career path. Likewise, our customers will benefit from the financial strength and operational expertise, as well as market insights and knowledge-sharing that, without doubt, Juniper Group will continuously provide us with going forward.”</p>\n<p><strong>About Avalon</strong>. Avalon is a market leader in the Oil &amp; Gas as well as Retail sector in Spain and Latin America. Its portfolio of software and hardware solutions covers the entire value chain of their diverse customer base. To learn more, visit <a href=\"https://www.avaloninformatica.com/\" rel=\"noreferrer noopener\" target=\"_blank\">https://www.avaloninformatica.com</a></p>\n<p><strong>About Juniper Group</strong>. Juniper Group is a multi-vertical software-operating firm that invests in and builds enduring B2B and B2C software businesses across the Americas, Europe, Middle East and Asia Pacific. Juniper Group invests in and partners with software businesses that serve customers in a specific industry’s vertical and adjacent markets. We are experienced software investors who can move quickly and offer a unique combination of capital and managerial support to ensure the continued growth of our companies. To learn more, visit <a href=\"http://www.juniper-group.com/\" rel=\"noreferrer noopener\" target=\"_blank\">http://www.juniper-group.com</a></p>\n"}, {"title": "Vela Software Group acquires Figtree Systems", "link": "https://velasoftwaregroup.com/vela-software-group-acquires-figtree-systems/", "date": "22 June, 2021", "content": "\n<p>Vela Software Group announced today that it has acquired Figtree Systems from a public company, through its subsidiary Vela Asia Pacific. <a href=\"https://www.figtreesystems.com\" rel=\"noreferrer noopener\" target=\"_blank\">Figtree Systems</a> is an Australian headquartered business focussed on the Insurance, WH&amp;S and Fleet Management market with customers spread across the globe.</p>\n<p>“We are very excited to welcome the Figtree Systems team into the Vela Asia Pacific family. As an industry leader in Insurance, and WH&amp;S we expect to continue their excellent customer advocacy and reputation under our ownership.” said Ian Whiting, CEO of Vela Asia Pacific. “As always, we look forward to combining Figtree Systems deep industry expertise with Vela’s financial strength and operational expertise in order to provide customers with industry-leading solutions in the Insurance and WH&amp;S markets.”</p>\n<p><strong>About Vela Asia Pacific:</strong></p>\n<p>Vela Asia Pacific, as part of Vela Software Group acquires, manages, and builds mission-critical vertical market software businesses that have a presence Asia-Pacific. We provide vertical market software expertise, operational support, and capital to help our businesses grow organically and through acquisitions.</p>\n<p>Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange. </p>\n<p>Further information concerning Vela Asia Pacific may be obtained through their website at <a href=\"https://velasoftwaregroup.com\">www.velasoftwaregroup.com.au</a></p>\n"}, {"title": "FOG SOFTWARE GROUP ANNOUNCES ACQUISITION OF BRZ SCHWEIZ AG", "link": "https://velasoftwaregroup.com/fog-software-group-announces-acquisition-of-brz-schweiz-ag-2/", "date": "10 June, 2021", "content": "\n<p class=\"has-text-align-left\"><strong>10 June 2021</strong> – (Pohlheim, Germany) – <strong>FOG Software Group</strong> (“FOG”), a division of <strong>Vela Software</strong>, and <strong>Constellation Software, Inc.</strong> [TSX: CSU] today announced that it has completed the acquisition of <strong>BRZ Schweiz AG</strong> (“BRZ Schweiz”) from a subsidiary of Nürnberger Baugruppe GmbH &amp; Co. KG.</p>\n<p>Rotkreuz, Switzerland-based BRZ Schweiz is a leader in ERP software for ancillary construction trades in Switzerland. Their software is an enterprise solution, optimizing the administrative processes of customers in the ancillary construction trades like building services, building shell, wood construction, painters, plasterers, metal construction and other trades.</p>\n<p>Following the acquisition, BRZ Schweiz will operate as an independent division of FOG. The company will continue to develop, enhance, service, and support their range of software solutions in providing a competitive edge to customers.</p>\n<p>“We are pleased to welcome BRZ Schweiz with their innovative software and focus on quality, execution, and customers,” said <strong>Peter Dixen</strong>, FOG Software Group Portfolio Manager Construction &amp; Manufacturing. “BRZ Schweiz is very complementary to our growing portfolio of software solutions in the European construction vertical. Their problem-solving solutions bring additional coverage to the vertical markets in our portfolio and a local presence in Switzerland.”</p>\n<p>“We are delighted for BRZ Schweiz to join the FOG portfolio,” said <strong>Martin Bär</strong>, CEO of BRZ Schweiz AG. “BRZ Schweiz’s unique approach to the construction industry will add value to the FOG network, while BRZ Schweiz staff and customers alike will benefit from FOG’s financial support, software development experience and well-honed management best practices.”</p>\n<p><strong>Joseph Kronfli</strong>, co-CEO of the Nürnberger Baugruppe: “With this step, our Swiss colleagues gain flexibility to focus on their core target groups and will still have strong support from the FOG Group. We will certainly continue to cooperate in the future in a new constellation.”</p>\n<p>‍<strong>About FOG Software Group</strong></p>\n<p>Rosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software and Constellation Software, Inc. [TSX:CSU] . The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About BRZ Schweiz</strong></p>\n<p>BRZ Schweiz is based in Rotkreuz, Switzerland. The company supports its customers with a broad experience and deep knowhow of the customers business as well as with innovative IT solutions and services to optimize their processes. The solutions portfolio ranges from self-developed enterprise software for construction companies and commercial software for document management and resource planning. To learn more, visit http://www.brz.eu/ch-de</p>\n<p><strong>About Nürnberger Baugruppe</strong></p>\n<p>The Nuremberg Construction Group stands for the diversity of construction and for a unique combination of construction and IT. With a history of more than 200 years in the construction industry, the Group’s competencies cover all phases of construction from planning to execution and utilization. In the business area IT, the BRZ Group incorporates these competencies into innovative software, consulting and outsourcing solutions.</p>\n<p>Widebridge Group acted as exclusive advisor to FOG.</p>\n<p><strong>Editorial contact:</strong> Peter Dixen, Portfolio Manager Construction &amp; Manufacturing, FOG Software Grouppdixen@fogsoftwaregroup.com / +49 151 16228 779</p>\n"}, {"title": "Datamine acquires Qmuzik", "link": "https://velasoftwaregroup.com/datamine-acquires-qmuzik/", "date": "27 April, 2021", "content": "\n<p class=\"has-text-align-left\"><strong>Datamine acquires Qmuzik</strong></p>\n<p class=\"has-text-align-left\">We are excited to announce that Datamine has acquired <a href=\"https://www.qmuzik.com/\">Qmuzik</a>, a market leader in niche software development to the manufacturing and mining industries.</p>\n<p class=\"has-text-align-left\">Qmuzik’s staff provide deep domain expertise gained over 28 years of the organisation’s existence. The company prides itself on the many professionals and SMEs (Subject Matter Experts) with real world experience in the workplace. This includes product management, business analysis, support, implementation, and custom software development.</p>\n<p class=\"has-text-align-left\">“This acquisition is another exciting addition to the Datamine group. We welcome the Qmuzik team and customer base and look forward to supporting the continued growth of Qmuzik around the world”  <a href=\"https://www.linkedin.com/in/dywebb/\">Dylan Webb, Datamine CEO</a>.</p>\n<p class=\"has-text-align-left\">“Qmuzik and Datamine share a common vision to provide the mining industry with best-in-class technology that pushes them to the forefront of digital innovation. We look forward to joining forces and with access to Datamines’ resources, we will have the opportunity to expand our geographic footprint while continuing to provide our customers with market leading software development. This is a great day for our business, and our people, and we look forward to exploring the synergies that Datamine offer” <a href=\"https://www.linkedin.com/in/jan-small-1463638/\">Jan Small, Qmuzik CEO</a>.</p>\n<p class=\"has-text-align-left\">Qmuzik will operate as a standalone business within the Vela Mining Group with Jan Small continuing in the CEO role. Qmuzik has 61 staff located in Johannesburg, South Africa, working across two product lines. <strong>Qmuzik ERP</strong> serves the complex enterprise resource planning requirements of the manufacturing, aerospace and defence sectors. <strong>Qmed </strong>is an occupational health and hygiene solution (Electronic Medical Record) with leading market share in the South African mining industry. To support these customers and expand the <strong>Qmed </strong>presence in the global mining sector, Qmuzik will be leveraging the Datamine business infrastructure in 20 countries.</p>\n<hr class=\"wp-block-separator has-text-color has-background has-white-background-color has-white-color\"/>\n<p class=\"has-text-align-left\"><strong>About Qmuzik</strong></p>\n<p class=\"has-text-align-left\">Qmuzik Technologies has established itself as a market leader by developing software solutions in close corporation with industry leaders since 1993. By supplying implementation and support services, Qmuzik stays close to their customers and their ever-evolving requirements. The Qmuzik group is organised into focused teams to further enhance customer service for the <strong>Qmed </strong>and <strong>Qmuzik ERP</strong> products.</p>\n<hr class=\"wp-block-separator has-text-color has-background has-white-background-color has-white-color\"/>\n<p class=\"has-text-align-left\"><strong>About Datamine</strong></p>\n<p class=\"has-text-align-left\">Datamine is the world’s leading provider of technology to seamlessly plan and manage mining operations. With operations in twenty countries, Datamine provides solutions spanning exploration, resource modelling, mine planning, operations, logistics and marketing to over 6,000 companies worldwide. Our implementation, training and advisory services ensure customers receive industry\u0002leading support and leverage full value from their technology investment.</p>\n<p class=\"has-text-align-left\"><br/><strong>For media enquiries, please contact:</strong></p>\n<p class=\"has-text-align-left\"><strong>Megan Mooi</strong><br/>Marketing and Events Manager, Datamine<br/><strong>Email:</strong> <a href=\"mailto:megan.mooi@dataminesoftware.com\">megan.mooi@dataminesoftware.com</a></p>\n"}, {"title": "Vela acquires Beacon Business Systems", "link": "https://velasoftwaregroup.com/vela-acquires-beacon-business-systems/", "date": "15 March, 2021", "content": "\n<p><strong>Brisbane, Australia – 15 March 2021</strong> – Vela Software Group announced today that it has acquired the business assets of Pixen Pty Ltd T/A Beacon Business Systems (“Beacon”), trading through its subsidiary Vela Asia Pacific. Beacon is a Perth and Melbourne based Australian business focussed on the petroleum retail market which has evolved over 20 years.</p>\n<p>“Beacon is a tremendous team of individuals that due to their domain knowledge and close relationships with their clients have had great success in the market. All characteristics we value highly. We are excited to welcome them to the Vela Asia Pacific family and look forward to working closely with them to help strengthen their market position,” said Ian Whiting, CEO of Vela Asia Pacific. “We thank past owners for establishing such a great business and wish them well in their next chapter and know that the employees of Beacon are looking forward to joining a lager peer network”.</p>\n<p><strong>About Vela Asia Pacific:</strong></p>\n<p>Vela Asia Pacific, as part of Vela Software Group acquires, manages, and builds mission-critical vertical market software businesses that have a presence in Australia, New Zealand and Asia-Pacific. We provide vertical market software expertise, operational support, and capital to help our businesses grow organically and through acquisitions.</p>\n<p>Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange.</p>\n<p>Further information concerning Vela Asia Pacific may be obtained through their website at www.velasoftwaregroup.com.au</p>\n"}, {"title": "Datamine acquires Centric Mining Systems", "link": "https://velasoftwaregroup.com/datamine-acquires-centric-mining-systems/", "date": "3 March, 2021", "content": "\n<p><strong>We are excited to announce that Centric Mining Systems has been acquired by Datamine, a wholly</strong> <strong>owned subsidiary of Vela Software, an operating group of Constellation Software (TSX: CSU).</strong></p>\n<p>Centric Mining Systems will continue to be led by founder and CEO Chris Novak, who established the business in 1998. In this time the company has grown from a 1-person start-up to a global company with customers in over 15 countries and established a market presence in 6 continents.</p>\n<p>The impressive growth of Centric will be further accelerated by making its solutions available through the Datamine distribution network of 28 offices in 20 countries.</p>\n<p>“Centric and Datamine share a common vision to provide the mining industry with best-in-class technology that pushes them to the forefront of digital innovation” said Chris Novak, CEO of Centric Mining Systems.</p>\n<p>“We look forward to joining forces and with access to Datamines’ resources, we will have the opportunity to expand our geographic footprint while continuing to provide our customers with industry leading, full-service mine information management solutions. This is a great day for our business, and our people, and we look forward to exploring the synergies that Datamine offer.”</p>\n<p>Dylan Webb, CEO at Datamine, said “This acquisition is another exciting addition to the Datamine group. We welcome the Centric team and customer base, and look forward to supporting the continued growth of Centric around the world”.</p>\n<p><strong>About Centric</strong><br/>Centric Mining Systems is a global software solution provider that specializes in data acquisition, systems integration, data warehousing, knowledge generation, and decision support solutions specific to the mining industry. Centric’s powerful Mine Information Management Platform provides vital insight into mining value-chain, enhancing decision-making and improving ability to quickly respond to challenges.</p>\n<p><strong>About Datamine</strong><br/>Datamine is the world’s leading provider of technology to seamlessly plan and manage mining operations. With operations in twenty countries, Datamine provides solutions spanning exploration, resource modelling, mine planning, operations, logistics and marketing to over 6,000 companies worldwide. Our implementation, training and advisory services ensure customers receive industry leading support and leverage full value from their technology investment.</p>\n<p><strong>For media enquiries please contact:</strong><br/>Kristy Marshall, Global Product Marketing Manager, Datamine<br/>Email: kristy.marshall@dataminesoftware.com</p>\n"}, {"title": "FACTON Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/facton-acquired-by-fog-software-group/", "date": "12 January, 2021", "content": "\n<p><strong>FOG Software Group further expands its growing portfolio of software solutions for smart manufacturing, led by Shoplogix, through its acquisition of FACTON.</strong></p>\n<p>Potsdam, Germany – January 12, 2021 ‒ FOG Software Group (“FOG”), an operating group of Vela Software and Constellation Software Inc. [TSX:CSU], is pleased to announce it has acquired FACTON.</p>\n<p>FACTON is a global software provider specializing in enterprise-wide product costing solutions for the manufacturing industry. The German-based company has been at the forefront of innovation for over 20 years by combining expertise in the areas of product costing, production, supply chain and software development. The FACTON EPC Suite is the leading Enterprise Product Costing (EPC) solution for many of the Fortune Global 100 manufacturers and their suppliers. Its solutions address the needs of both executive management and individual departments. FACTON EPC enables standardized, enterprise-wide costing for maximum product cost transparency throughout every phase of the product lifecycle.</p>\n<p>FACTON will be an independent business unit within FOG’s portfolio of Smart Manufacturing software companies, which is led by Shoplogix. FACTON will continue to work closely with its customers and offer innovative and reliable software solutions for global cost management under its established brand FACTON EPC.</p>\n<p>“We are actively growing our portfolio of Smart Manufacturing software companies and FACTON is a strategic and important acquisition to us. Given their impressive customer base, synergies with our other portfolio companies, and deep knowledge in product cost management, we have further expanded our competitive advantage in the Smart Manufacturing market. We are very pleased to be able to add FACTON to our portfolio as we continue to support our customers in optimizing their industrial processes and digital transformation strategies”, said Magnus Sandberg, Group CEO of the Smart Manufacturing portfolio of companies. “We look forward to combining FACTON’s talented team and deep industry experience with our financial strength and operational excellence.”</p>\n<p>“With the long-term investment and the autonomous character of the acquisition we have created an ideal basis for future growth of FACTON. By joining the FOG Smart Manufacturing portfolio, we will empower our customers and business partners with a holistic approach for digital production and calculation processes. The impressive network of companies and knowledge base of FOG, and the cooperative approach, will enable us to serve the individual requirements in product cost management across the entire supply chain even faster and better”, says Alexander M. Swoboda, CEO of FACTON.</p>\n<p><strong>FOG Software Group</strong> (www.fogsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) and Constellation Software, Inc. [TSX:CSU] which is a US$3.5 billion consolidated revenue software conglomerate headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>Shoplogix </strong>(www.shoplogix.com) is a division of FOG Software group and Constellation Software, Inc. (TSX:CSU).  Founded in 2002, Shoplogix is a leader in the IIoT Smart Factory software industry. By connecting people, processes, machines, and data through their Smart Factory Cloud Platform, manufacturers are empowered to accelerate operational excellence and to unlock hidden production performance improvements. Shoplogix serves customers in 32 countries, primarily in the automotive, food &amp; beverage, packaging, consumer packaged goods and steel services.</p>\n<p><strong>FACTON</strong> (<a href=\"http://www.facton.com\">www.facton.com</a>) – The FACTON EPC Suite is the leading Enterprise Product Costing (EPC) solution for the automotive, aerospace, mechanical engineering, and electronics industries. Its specific solutions offer robust answers to the requirements of executive management and individual departments within the enterprise. FACTON EPC enables standardized, enterprise-wide costing independent of location and department for maximum product cost transparency throughout every phase of the product lifecycle. FACTON was founded in 1998 and has locations in Potsdam, Dresden, Stuttgart, and Detroit. The international portfolio of customers includes Ford Motor Company, Henniges Automotive, DURA Automotive Systems, Airbus, Mahle Behr, MANN+HUMMEL, Porsche, and other renowned manufacturers.</p>\n"}, {"title": "Vela Acquires SeaRoc", "link": "https://velasoftwaregroup.com/vela-acquires-searoc/", "date": "23 October, 2020", "content": "\n<p>October 20, 2020 – Vela Software Group (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) is pleased to announce it has acquired SeaRoc Group Ltd (“SeaRoc”) based in Chichester, UK.</p>\n<p><strong>About SeaRoc. </strong>SeaRoc was formed in 2002 to provide industry leading Software as a Service Solutions to optimise safety and efficiency within large scale, hazardous operational, and construction environments.</p>\n<p>SeaRoc’s SeaPlanner product has played a pivotal role in the development of 31 offshore wind projects, supporting the induction and certification management of over 24,000 personnel and 500 subcontractors.</p>\n<p>Built on its learnings from these highly challenging environments, SeaRoc’s SitePlanner Contractor Management System allows its customers to achieve efficient and safe operations across a wide range of land-based construction and site management challenges.</p>\n<p>Going forward, SeaRoc will operate as an independent business unit within Vela.  Ian Sellwood, MD of SeaRoc stated, “Despite past successes it was very important that SeaRoc found a new partner to maximise its growth potential in these expanding and innovative markets.  In Vela we believe we have found that partner.  Their successes across its existing SaaS portfolio demonstrates the value add of their best practices, financial guidance, and business focus.  Their customer focused culture aligns with SeaRoc’s personality and the teams desire to offer customers the best solutions and support.  We look forward to an exciting and prosperous future together”.</p>\n<p>“We are very excited to welcome the SeaRoc team into the Vela family. As an industry leader in software and service solutions for challenging site management environments we expect to continue and grow their excellent customer advocacy and reputation under our ownership. SeaRoc brings us further strengths in markets that we consider core for our future expansion and we have high expectations for its future.” said Gabor Czegledy, CEO, Portfolio Manager at Vela. “As always, we look forward to combining SeaRoc’s deep industry expertise with the Vela group’s financial strength and operational expertise in order to provide customers with industry-leading solutions.”</p>\n<p><strong>About Vela. </strong>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires ElmTree System", "link": "https://velasoftwaregroup.com/vela-software-acquires-elmtree-system/", "date": "21 October, 2020", "content": "\n<p><strong>Vela Software is pleased to announce the acquisition of ElmTree System which will report into Vela’s subsidiary Spectra QEST, expanding their offering of solutions for CMET and Geotechnical Engineering businesses.</strong></p>\n<p>October 20, 2020 – ElmTree System offers a SaaS Business Management System for Construction Materials Engineering and Testing (CMET) and Geotechnical Engineering Firms, with an integrated workflow from proposal to final invoice. With more than 20 years of experience and a long history of innovation the solution is used widely in North America.</p>\n<p>Cheryl Wilkerson, Program Director, ElmTree System “We are looking forward to working with Spectra QEST and the opportunities it provides for continuity, continued growth and investment in our products and customers.”</p>\n<p>Dirk Janek, CEO of Spectra QEST, “We are excited to welcome ElmTree System to the Vela / Spectra QEST family. Cheryl and her team have built a great product over the last 20 years with an enviable customer following and wealth of industry knowledge. We are enthusiastic about the opportunities of working together to the benefit of all our customers and the industry.“</p>\n<p>ElmTree System is based in Oklahoma City, OK, and serves customers in North America.</p>\n<p><strong>About Spectra QEST</strong></p>\n<p>An operating company of Vela Software International, Inc., itself an operating group of Toronto-based Constellation Software, Inc. (CSI), Spectra QEST is a software development and services company specializing in solutions for the construction materials engineering, testing, inspection and production industries.</p>\n<p>Founded in January 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices located in Adelaide, South Australia and Sacramento, California, it services customers in North America, Europe, Australasia and the Middle East. These customers include leading international construction companies, construction materials and geotechnical companies, construction materials manufacturers and government bodies.</p>\n"}, {"title": "Compusense Acquired by Vela Software", "link": "https://velasoftwaregroup.com/compusense-acquired-by-vela-software/", "date": "14 September, 2020", "content": "\n<p><strong>Vela Software is pleased to announce the acquisition of Compusense which will report into Vela’s subsidiary Tecplot</strong><strong>, augmenting an expanding range of statistical tools with the industry-leading platform for Consumer and Sensory Science testing</strong><strong>. </strong></p>\n<p>September 1, 2020 – Compusense develops Compusense Cloud and Compusense20, powerful SaaS tools used by major food and beverage companies, CPG multinationals and luxury brands to plan, execute and analyze consumer and sensory tests, leading to insights that help these companies launch and refine successful products. With over 30 years of research and innovation, Compusense sets the standard for sensory research software.</p>\n<p>Founders Karen Phipps and Chris Findlay will lead the transition to an all-internal management team comprised of employees with a combined 55 years of experience at the company.</p>\n<p>“Karen and I are delighted that we can place the company that we have grown and nurtured for 34 years into the strong hands of Vela,” Findlay said. “Their expertise in growing software companies gives Compusense a solid foundation upon which it can build into the future. We are very pleased that our management team will be able to retain Compusense’s culture and continue to support our amazing clients as we always have.”</p>\n<p>Tom Chan (https://www.linkedin.com/in/thomascchan/), President of Tecplot, thanked Karen and Chris, adding, “they have worked tirelessly to build a great company, and more importantly a great team, who are passionate about helping customers and advancing sensory testing. With the profound disruptions caused by COVID, brands need valued partners more than ever to help them be successful in the marketplace and Compusense is key to ensuring that products hit the right notes with consumers. We look forward to working closely to bring their important technology to more clients across the globe.”</p>\n<p>Compusense is based in Guelph, ON, and serves customers world-wide.</p>\n<p><strong>If you have any questions about this acquisition, or the capabilities of Compusense’s products, please contact Compusense at info@compusense.com.</strong></p>\n<p><strong>About Tecplot, Inc.</strong></p>\n<p>An operating company of Vela Software International, Inc., itself an operating group of Toronto-based Constellation Software, Inc. (CSI), Tecplot is the leading independent developer of visualization and analysis software for engineers and scientists. CSI is a public company listed on the Toronto Stock Exchange (TSX:CSU). CSI acquires, manages, and builds software businesses that provide mission-critical solutions in specific vertical markets.</p>\n"}, {"title": "Vela acquires Navarik", "link": "https://velasoftwaregroup.com/vela-acquires-navarik/", "date": "4 September, 2020", "content": "\n<p>Vela Software Group (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) is pleased to announce it has acquired Navarik, based in Vancouver, British Columbia.</p>\n<p>Navarik operates the industry standard SaaS platform for Cargo Inspection Management. The company’s platform provides the automation, standardization, and business intelligence necessary for companies to effectively identify oil loss claims, reduce off-spec cargos, speed deal settlement, and drive better inspection firm performance.</p>\n<p>Going forward, Navarik will continue to operate as an independent business unit within Vela. Richard Halldearn, CEO of Navarik stated, “It was very important for Navarik to find the right partner to ensure our customers and employees were in good hands. We are excited to have Vela build on the software, branding, and people to further improve Navarik’s services. We believe that Vela’s valuable best practices and the financial backing of a large software company will greatly assist Navarik in realizing its full potential.”</p>\n<p>“We are very excited to welcome the Navarik team into the Vela family. As an industry leader in cargo inspection and testing, inspection and certification Software we expect to continue their excellent customer advocacy and reputation under our ownership. Navarik expands our existing portfolio of upstream and mid-stream Oil and Gas production, into downstream.” said Gabor Czegledy, CEO, Portfolio Manager at Vela. “As always, we look forward to combining Navarik’s deep industry expertise with the Vela group’s financial strength and operational expertise in order to provide customers with industry-leading solutions.”</p>\n<p><strong>About Vela.</strong> Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Stat-Ease Acquired by Vela Software", "link": "https://velasoftwaregroup.com/stat-ease-acquired-by-vela-software/", "date": "22 July, 2020", "content": "\n<p><strong>Vela Software (“Vela”), an operating group of Constellation Software, Inc. (TSX: CSU), is pleased to announce the acquisition of <a href=\"https://www.statease.com/\">Stat-Ease</a> through its Tecplot subsidiary, adding class-leading design of experiments (DOE) software to a growing portfolio of engineering and analysis tools.</strong></p>\n<p><strong>July 20, 2020</strong> – <strong>Design-Expert</strong> is a comprehensive DOE package which makes multifactor experimentation and analysis easy for the seasoned statistician as well the engineer or scientist who needs to get their work done immediately without navigating a cumbersome general statistics package. Featuring an easy-to-use interface, available wizard-based workflows, and powerful analytic capabilities, Design-Expert is a critical tool for many leading companies in the pharma, chemical, and aerospace industries around the world.</p>\n<p><a href=\"https://www.linkedin.com/in/thomascchan/\">Tom Chan</a>, President of Tecplot, views the acquisition as an important step to providing increased capabilities to engineers and scientists, saying “It’s not often you get to bring in a company that is known as the undisputed leader in their specialty, especially one with a great team and aligned culture. We believe DOE is a critical technology for improving quality, time to market and cost, that can be leveraged across industries. There has never been a more important time to optimize our experiments to save time and lives. We are eager to help Stat-Ease reach a new level of success.”</p>\n<p>“Stat-Ease has had a profound impact on DOE over the course over the last 40 years,” added new Stat-Ease President, <a href=\"https://www.linkedin.com/in/martin-bezener-58066514/\">Martin Bezener, PhD</a>. “We thank our founders for setting the course for Design-Expert and showing industry that one-factor-at-a-time (OFAT) experimentation is insufficient to achieve needed efficiency and results. As a longtime Stat-Ease employee I’m excited to carry our company forward, reaching new customers, adding important capabilities for our long-term partners as well as continuing our DOE training classes and events.”</p>\n<p>Stat-Ease is based in Minneapolis, MN, and serves customers world-wide through its website as well as a network of value-added resellers.</p>\n<p><strong>If you have any questions about this acquisition, or the capabilities of Design-Expert, please contact Stat-Ease at </strong><a href=\"mailto:info@statease.com\"><strong>info@statease.com</strong></a><strong>.</strong></p>\n<p><strong>About Tecplot</strong></p>\n<p>An operating company of <a href=\"https://velasoftwaregroup.com/\">Vela Software International, Inc.</a>, itself an operating group of Toronto-based Constellation Software, Inc. (<a href=\"https://www.csisoftware.com/\">CSI</a>), Tecplot is the leading independent developer of visualization and analysis software for engineers and scientists. CSI is a public company listed on the Toronto Stock Exchange (TSX:CSU). CSI acquires, manages, and builds software businesses that provide mission-critical solutions in specific vertical markets.</p>\n<p><strong>About Stat-Ease</strong></p>\n<p>Based in Minneapolis, <a href=\"https://www.statease.com/\">Stat-Ease</a> was founded in 1982 and has become a leading provider of design of experiments (DOE) software, books, training, and consulting services. Using these statistical methods, scientists, engineers, statisticians, quality experts, and research and development teams can improve the quality of products, enhance processes, quickly solve manufacturing problems, and make breakthrough discoveries. Via multifactor testing techniques, DOE quickly leads users to the elusive sweet spot where all requirements are met at minimal cost.</p>\n"}, {"title": "Vela Software Acquires Snowden", "link": "https://velasoftwaregroup.com/vela-software-acquires-snowden/", "date": "22 July, 2020", "content": "\n<p><strong>July 17, 2020</strong> – Datamine, a division of Vela Software (“Vela”), and Constellation Software, Inc. (TSX: CSU) announced <strong>that it has acquired </strong><a href=\"https://snowdengroup.com/\"><strong>Snowden</strong></a><strong>, incorporating the Supervisor and Reconcilor software solutions and its well-regarded advisory consulting business.</strong></p>\n<p><strong>Supervisor </strong>is a complementary solution to Datamine’s existing resource estimation suite, offering a simple intuitive interface and workflow, advanced local and global estimation optimisation functionality and compatibility with all major mine planning software packages.</p>\n<p><strong>Reconcilor </strong>provides a robust system to identify differences between grade and tonnage estimates, plans and actual mine production. The Reconcilor solution is highly complementary to Datamine’s inventory tracking and metal balancing solutions, with several customers already using the combined systems.</p>\n<p>The Snowden advisory consulting business extends Datamine’s service offering with an experienced team of Competent and Qualified Persons to produce high quality resource estimates and advice across all commodities, mineralisation styles and regions. We can cover all major reporting codes including JORC, SAMREC and CIM, applying industry best practice techniques. Services cover exploration review and management, grade control analysis and optimisation, resource evaluation and estimation, advanced geostatistics, auditing and review and risk analysis studies.</p>\n<p><a href=\"https://www.linkedin.com/in/john-bailey-02b36343/\">John Bailey</a>, Executive General Manager at Datamine, said “We are excited to acquire the Snowden business which aligns closely with our existing offering to the mining industry. Snowden has a strong, expert brand with a wealth of experience, and has developed industry-leading products that complement Datamine’s software portfolio”.</p>\n<p>“Snowden has a proud 33 year history, evolving from a geological consulting company to a diversified advisory consulting, software and training business,” said <a href=\"https://www.linkedin.com/in/tarrant-elkington-8204b010/\">Tarrant Elkington</a>, Global Manager, Snowden. “This acquisition marks the next step on our growth journey. I am pleased that the Snowden brand will continue. The software expertise and global footprint of Datamine offers tremendous opportunities for the growth of our business and to improve the experience of our clients.”</p>\n"}, {"title": "Kirstie Boyle Announced as General Manager of Envirosoft", "link": "https://velasoftwaregroup.com/kirstie-boyle-announced-as-general-manager-of-envirosoft/", "date": "9 July, 2020", "content": "\n<p><strong>Calgary, Alberta (July 9, 2020)</strong> – Vela Software Group (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) announces that Kirstie Boyle has been appointed General Manager of Envirosoft Corporation (“Envirosoft”).</p>\n<p>“We are pleased to have Kirstie Boyle lead Envirosoft in the next chapter of the company’s growth,” said Gabor Czegledy, Portfolio Manager at Vela.  “Kirstie is a technology leader with a proven track record of aligning teams around a central vision and driving revenue growth.  She has a strong background in business development, product management, and market strategy.  Her customer centric approach and leadership abilities are an asset and will see Envirosoft continue to provide industry-leading solutions to customers.”</p>\n<p>Boyle holds a B.Sc. and an MBA in Global Energy Management and Sustainable Development.  She has been recognized with numerous awards for her work and advocacy in the technology community.</p>\n<p>“Envirosoft is an important leader in emissions management and environmental compliance, and I am honoured to be leading the company,” said Boyle.  “Globally, there is increasing importance given to corporate ESG initiatives and Envirosoft is well positioned to provide these solutions, especially with the backing of a world class ownership group.”</p>\n<p><strong>About Vela.</strong> Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela’s companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Envirosoft.</strong> Envirosoft provides trusted and scalable emissions management and ESG reporting solutions to the oil and gas industry.  Our industry-leading integrated software suite and expert consulting services help our clients meet their evolving environmental, regulatory, and compliance needs.</p>\n"}, {"title": "Vela Software acquires InfoCorp", "link": "https://velasoftwaregroup.com/vela-software-acquires-infocorp/", "date": "4 June, 2020", "content": "\n<p><strong>Miami, FL – May 21, 2020</strong> – <a href=\"http://www.aquilasw.com/\">Aquila Software</a> (“Aquila”), a division of Vela Software (“Vela”), and Constellation Software, Inc. (TSX: CSU) announced today that it has closed the acquisition of InfoCorp. InfoCorp is the developer of the IC OmniChannel Banking platform that is Helping People Love their Bank.</p>\n<p>“InfoCorp has an inspiring focus on their clients. To produce solutions that connect the banks with their clients is such a deep passion for the team at InfoCorp. We are really looking forward to working with the group,” said Mike Byrne, CEO of Aquila. “The InfoCorp team has built something truly impressive, and we hope to support that momentum moving forward.”</p>\n<p>Ana Inés Echavarren, CEO of InfoCorp said, “We have been looking for a partner to support us as we move to our next level of experience for our clients. We are excited to join Aquila and the Constellation family as they believe in long-term relationships, and the ‘buy and hold forever’ approach supports us in our focus on long term growth with our clients.”</p>\n<p><strong>About Aquila Software:</strong></p>\n<p>Aquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel &amp; Public Sectors throughout the Americas and Europe. Aquila’s businesses focus on long-term relationships where our mission-critical solutions evolve with our clients’ business needs. Further information about Aquila Software can be found at <a href=\"http://www.aquilasw.com\">www.aquilasw.com</a>.</p>\n<p><strong>About InfoCorp: </strong></p>\n<p>InfoCorp is a leading provider of Omnichannel Banking solutions across the Latin American and Caribbean markets. It provides leading-edge, innovative solutions that enable clients to love their banks. For more information on InfoCorp, please visit <a href=\"http://www.infocorp.com.uy\">www.infocorp.com.uy</a>.</p>\n"}, {"title": "Vela Software Acquires Kurier", "link": "https://velasoftwaregroup.com/vela-software-acquires-kurier/", "date": "14 April, 2020", "content": "\n<p><strong>São Paulo, April 2020</strong> – Vela Software Group (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) is pleased to announce it has acquired Kurier, a pioneer in technology and legal intelligence. The acquisition enhances Vela’s presence in the Brazilian legal software market, following the acquisition of Aurum in 2019.</p>\n<p>Salvatore Bruno, Kurier´s CEO, believes that the acquisition by Vela will further strengthen Kurier’s business in the country, allowing for an expansion in the market, as well as greater investment in innovative technologies. “This achievement was only possible thanks to a serious and pioneering effort that produced an average growth of 20% per year for the past 5 years. During all this time we were innovators and launched several solutions that changed the lives of legal operators and those interested in information about the behavior of the Brazilian justice for the better”, he indicated.</p>\n<p>Kurier is already recognized for its innovative products and its ability to add value to its customers’ business by offering solutions that provide operational efficiency and data-driven decision-making. “This acquisition only reinforces our commitment to continue contributing to the evolution of the legal technology market in Brazil”.</p>\n<p>This is Vela’s second acquisition in the Brazilian lawtech segment.  “We understand that the legal technology market in Brazil is in full growth and that this initiative, which started in 2019 with the acquisition of Aurum, should continue.”, informs Paulo Felipe Martins, VP of M&amp;A at Vela Software Latin America.</p>\n<p>It is part of Vela’s strategy to maintain the company’s entire team, including executives, who will continue to lead the business, alongside Kurier’s whole staff. As well as Aurum, Kurier will also continue to operate independently, and with new partnerships in sight. “We have complementary products, there is a lot that we can do together in order to improve our solutions for the market”, comments Antônio Gerassi Neto, Aurum’s CEO.</p>\n<p>“We are going to work in collaboration with Aurum, maintaining our mission to meet our customers’ needs, improving the lives of people who deal with us as well as contributing to the development of our society”, concludes Salvatore.</p>\n<p><strong>About Vela Software. </strong>Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds software businesses which provide specialized, mission-critical software solutions for customers in various industries. Vela is a permanent owner of companies and invests in these businesses for the long-term.</p>\n<p><strong>About Kurier. </strong>Kurier is a pioneer in technology and legal intelligence solutions in the Brazilian market. The company serves over 1,700 clients, including seven of the ten largest law firms in Brazil. Customers also include legal departments of large companies and the main credit bureaus in the country. Transforming the market through data, systems and legal intelligence, Kurier provides operational efficiency and an analytical approach, optimizing time and information management for better decision making. For more information, visit: kurier.com.br</p>\n"}, {"title": "Vela Software Acquires Interica", "link": "https://velasoftwaregroup.com/vela-software-acquires-interica/", "date": "3 March, 2020", "content": "\n<p><strong>Adelaide, Australia – 3 March 2020 –</strong> Vela Software Group (“Vela”) and its subsidiary Petrosys are pleased to announce the acquisition of Interica—well known for its industry leading archive solution PARS™. Interica has been providing information management software and consultancy services in oil and gas for over 20 years.</p>\n<p>Petrosys’ ethos of allowing acquired companies to retain their individual identities and cultures, will mean Interica remains a respected, independent and responsive provider for data management software and services. The Petrosys approach to agile and innovative software development in collaboration with clients and partners will complement Interica’s long term evolution.</p>\n<p>Joining Petrosys will enable a new phase of growth and geographic reach for Interica, providing access to a broader shared client base and pool of specialist expert knowledge, ensuring that quality, trusted data is at the centre of what drives innovation and efficiency for our customers.</p>\n<p>Simon Kendall, CEO of Interica commented, “The sale of Interica to Petrosys is an excellent fit, we’re looking forward to growing our brand alongside Petrosys. Being able to utilise shared resources, partnerships and subsurface data expertise will allow us both to go from strength to strength and continue to deliver the independent, trusted software and services our clients deserve.”</p>\n<p>“We are excited to bring together two globally recognised data management brands”, CEO of Petrosys Scott Tidemann said, “Collectively we have industry leading 3rd party data connectors and R&amp;D experience with a broad range of oil and gas subsurface knowledge. This will enhance our shared commitment to an open standards-based approach to information management.”</p>\n<p>Our shared clients and industry partners will immediately recognise the value and future potential of bringing together these trusted and complementary brands and technologies.</p>\n<p>Together, our experienced teams provide an integrated approach to the management of geological, geophysical and petrotechnical data assets through their lifecycle – from new ventures and licence management, to seismic survey data and well data, through to reservoir analysis and production and ultimately divestment management. This fusion of Petrosys and Interica teams allows our people to enhance their skills and carve our rewarding careers as experts in their field.</p>\n<p><strong>About Petrosys</strong><br/>\nPetrosys is the industry-leader in mapping, surface modeling and data management software solutions for petroleum E&amp;P – delivering direct connectivity with the most popular exploration, production and GIS data sources. The Petrosys® software suite produces high quality maps and surface models. It manages seismic, well, geoscience and other specialised data used in the search for oil and gas at over 300 sites around the world. For further information on Petrosys please refer to www.petrosys.com.au.</p>\n<p><strong>About Interica</strong><br/>\nInterica provide unique software, consultancy and data management services to the oil and gas sector. Our solutions enable clients to manage &amp; secure their data and reduce risks and costs. Interica have extensive specialist experience and knowledge of the oil and gas subsurface domain, the principles and practices of effective data management, along with the practical requirements of companies, data owners and data users. For more detail on Interica products and solutions please refer to www.interica.com</p>\n<p><strong>About Vela</strong><br/>\nVela is a global provider of software solutions to a number of vertical industries. As an operating group of Constellation Software Inc. (TSX:CSU), Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires ProShip", "link": "https://velasoftwaregroup.com/vela-software-acquires-proship/", "date": "2 March, 2020", "content": "\n<p><strong>DEERFIELD, Ill. and BROOKFIELD, Wis., March 2, 2020</strong> – FOG Software Group (“FOG”), a division of Vela Software (“Vela”), and Constellation Software, Inc. (TSX: CSU) today announced that it has acquired ProShip, Inc. (“ProShip”) from Quadient, formerly Neopost.</p>\n<p>Brookfield, WI-based ProShip is a leader in enterprise parcel shipping solutions. Their customers include 25% of the National Retail Federation’s top 100 retailers who ship parcels, plus manufacturing, healthcare, and logistics companies who depend on ProShip for fast, efficient and cost-effective multi-carrier shipping.</p>\n<p>Following the acquisition, ProShip will operate as an independent division of FOG Software Group. The company will continue to develop, enhance, service, and support its market-leading shipping software in providing a competitive edge to customers.</p>\n<p>“ProShip is a great addition to our growing portfolio of supply chain software,” said Andy Hodge, FOG Software Group Portfolio Manager for Supply Chain and Logistics. “We are delighted to welcome ProShip with their proven, carrier-compliant solutions for medium- and high-volume shippers, and their impressive, company-wide focus on maximizing customers’ return on investment.”</p>\n<p>“We are excited to be working with FOG Software Group,” said Matt Mullen, President of ProShip. “Not only do they have extensive experience in the software industry; they share our belief in the importance of technological advancement in the supply chain.”</p>\n<p><strong>About FOG Software Group</strong><br/>\nDeerfield, IL-based FOG Software Group https://www.fogsoftwaregroup.com is a division of Toronto-based Vela Software https://velasoftwaregroup.com and Constellation Software, Inc. (TSX: CSU) https://www.csisoftware.com. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p>ProShip, Inc. is a global provider of enterprise-wide, automated, multi-carrier shipping and manifesting software that allows retailers, manufacturers, third-party logistics and healthcare companies to ship at lighting speeds, stay carrier compliant, and build stronger-than-ever customer revenue streams. Founded by two US Navy veterans in 2001, the company was most recently part of Quadient, formerly known as Neopost. Learn more about ProShip online https://www.proshipinc.com.</p>\n"}, {"title": "Vela Software Acquires Envirosoft", "link": "https://velasoftwaregroup.com/vela-software-acquires-envirosoft/", "date": "1 March, 2020", "content": "\n<p><strong>Calgary, Alberta (March 1, 2020)</strong> – Vela Software Group (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) is pleased to announce it has acquired the Envirosoft Corporation and Envirotech’s Environmental Management Division (“Envirotech EMD”) (collectively “Envirosoft”).</p>\n<p>Envirosoft Corporation provides a leading integrated software suite specifically designed to meet the evolving environmental, regulatory, and compliance needs of the Oil and Gas industry. Envirotech’s EMD offers consulting and implementation services related to emission studies, management and reporting compliance. The Envirotech EMD will continue to operate as a part of Envirosoft going forward.</p>\n<p>Ted Hart, President and co-owner of Envirosoft stated, “It was very important for us to find the right partner to ensure our customers and employees were in good hands. We are excited to have Vela build on the software, branding, and people that have made Envirosoft and Envirotech’s EMD services what they are today. We believe that Vela’s valuable best practices and the financial backing of a large software company will greatly assist Envirosoft in realizing its full potential.”</p>\n<p>“We are very excited to welcome the Envirosoft team into the Vela family. As an industry leader in Emissions Management we expect to continue their excellent customer advocacy and reputation under our ownership. Building on our existing portfolio Company NEMS in Norway, Envirosoft expands our presence in environmental compliance and sustainability management to onshore and midstream Oil &amp; Gas production.” said Gabe Czegledy, Senior Vice President, Portfolio Manager at Vela. “As always, we look forward to combining Envirosoft’s deep industry expertise with the Vela group’s financial strength and operational expertise in order to provide customers with industry-leading solutions.”</p>\n<p><strong>About Vela.</strong> Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires Foresiight", "link": "https://velasoftwaregroup.com/vela-software-acquires-foresiight/", "date": "28 February, 2020", "content": "\n<p><strong>Brisbane, Australia – 28 February 2020</strong> – Vela Software Group announced today that it has acquired the shares of Foresiight Software Pty Ltd (“Foresiight”), trading through its subsidiary Vela Australia. Established in 1981, Foresiight Pty Ltd is an Australian software company that integrates point of sale, accounting, stock control and mobile commerce applications with their solutions ProfiitPlus, Alchemii and Liinc. Foresiight focus on a number of different industries such as Building &amp; Hardware, Pharmacy, Tools &amp; Industrial and Automotive.</p>\n<p>“Foresiight is a tremendous team of individuals that due to their domain knowledge and close relationships with their clients have had great success in the market. All characteristics we value highly. We are excited to welcome them to the Vela Australia family and look forward to working closely with them,” said Ian Whiting, CEO of Vela Australia. “We know that the leadership at Foresiight have set high goals for themselves to achieve their vision and provide great value to their clients and we are happy to assist in that focus”.</p>\n<p><strong>About Vela Australia:</strong></p>\n<p>Vela Australia, as part of Vela Software Group acquires, manages, and builds mission-critical vertical market software businesses. We are a portfolio of Wholesale and Distribution, Fashion and General Retail, Light Manufacturing, and Government software businesses that have a presence in Australia, New Zealand and Asia-Pacific. We provide vertical market software expertise, operational support, and capital to help our businesses grow organically and through acquisitions.</p>\n<p>Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange.</p>\n<p>Further information concerning Vela Australia may be obtained through their website at www.velasoftwaregroup.com.au</p>\n"}, {"title": "Vela Software Acquires TSI", "link": "https://velasoftwaregroup.com/vela-software-acquires-tsi/", "date": "24 January, 2020", "content": "\n<p><strong>Raleigh, NC – 24 January 2020</strong> – Vela Software Group (“Vela”) and its subsidiary Juniper announced today that they have closed the acquisition of all entities / assets of TPF Software Inc (TSI), including USA, India, New Zealand, and Ireland. TSI was created in 1986 and provides products and services related to TPF/ALCS and Digital Enterprise technologies.</p>\n<p>“Juniper has the great pleasure to welcome TSI’s customers to our family. We are excited about the inclusion of this great team and management group within the Juniper and Vela family, and we plan to continue building upon the basis of the great success that both Juniper and TSI have already achieved within the Travel and Tourism Industry”, said Jaime Sastre, Juniper’s CEO.</p>\n<p>Thiru Thirupuvanam, co-founder of TSI, stated: “I am proud of the achievements of TSI during our more than 33 years and I am very excited to be part of the Juniper group, as this will allow further expansion, as well as a remarkable increase in our investment in research, development and innovation. The fact that not only do we keep our management team intact, but also that we will now have the opportunity to take advantage of Juniper’s knowledge and work side by side with their managers, is very encouraging to us. Our team is very excited about the efforts we will make to continue offering a high level of service to our customers and to provide them with greater opportunities for growth.”</p>\n<p><strong>About Juniper</strong>:<br/>\nJuniper is a leader in providing Travel Distribution Software for Tour Operators, OTAs (Online Travel Agencies), Bed Banks and Incoming Agencies. Juniper has cutting-edge technology and a highly committed team and has had a huge growth in the market in recent years. With more than 300 employees, Juniper has more than 360 customers in 50 countries. For more information about Juniper, visit www.ejuniper.com.</p>\n<p><strong>About TSI</strong>:<br/>\nTSI provides products and services related to TPF/ALCS and Digital Enterprise technologies to some of the Fortune 500 companies. For more information about TSI, visit https://tpfsoftware.com/</p>\n<p><strong>About Vela</strong>:<br/>\nVela is a global provider of software solutions to a number of vertical industries. As an operating group of Constellation Software Inc. (TSX:CSU), Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires MOSAIC", "link": "https://velasoftwaregroup.com/vela-software-acquires-mosaic/", "date": "3 October, 2019", "content": "\n<p><strong>Calgary, Alberta (October 3, 2019)</strong> <a href=\"https://velasoftwaregroup.com/\">Vela Software Group</a> (“Vela”), an operating group of Canadian public company Constellation Software Inc. (TSX:CSU) is pleased to announce it has acquired the MOSAIC Business Unit from Quorum Business Solutions (“Quorum Software”) Inc.</p>\n<p>The backing of Vela enables a new phase of growth for MOSAIC through access to a broad pool of management and software development competencies. Vela’s permanent ownership model, strong financial position, and industry specific expertise will ensure that MOSAIC remains a trusted provider of Oil &amp; Gas Economics, Reserves and Budgeting software. The current MOSAIC team will continue to develop this industry-leading application, deploy solutions projects, as well as train and support its users.</p>\n<p>“We are very pleased to bring MOSAIC into the Vela family. MOSAIC offers a well-established solution suite that is used by many of North America’s leading Oil and Gas Producers,” said Gabe Czegledy, Senior Vice President, Portfolio Manager at Vela. “We look forward to combining MOSAIC’s industry knowledge and expertise with the presence and strength of the Vela group in order to provide customers with industry-leading solutions.”</p>\n<p><strong>About Vela.</strong> Vela is a global provider of software solutions to several vertical industries. As an Operating Group of Constellation Software, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries and to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About MOSAIC Software</strong>. MOSAIC is an industry leading integrated petroleum economic, decline analysis, reserves management and budgeting solution. MOSAIC enables oil and gas companies to achieve greater standardization, faster execution, higher data confidence, and improved productivity – from projects and properties through to corporate reporting. MOSAIC has offices in Calgary and Houston and will now rely on Vela’s existing international locations to provide a global support reach.</p>\n<p><strong>About Quorum Software</strong><br/>\nQuorum Software offers an industry-leading portfolio of finance, operations and accounting solutions that empower our customers to streamline operations that drive growth and profitability across the energy value chain. From supermajors to startups, from the wellhead to the city gate, energy businesses rely on Quorum. Designed for digital transformation, the myQuorum software platform delivers open standards, mobile-first design and cloud technologies to drive innovation. We’re helping visionary leaders transform their companies into modern energy workplaces. For more information, visit <a href=\"http://www.quorumsoftware.com\">www.quorumsoftware.com</a>.</p>\n"}, {"title": "Vela Software Acquires Financial Risk Solutions (“FRS”)", "link": "https://velasoftwaregroup.com/vela-software-acquires-financial-risk-solutions-frs/", "date": "19 December, 2018", "content": "\n<p>Vela Software acquires FRS, comprehensive Investment Administration Software solution provider for the life assurance and pensions industries.</p>\n<p>Miami, FL – Dec 19, 2018 – Vela Software and its subsidiary Aquila Software (“Aquila”) announced the acquisition of Financial Risk Solutions (FRS). FRS is the developer of the Invest|ProTM product, a comprehensive Investment Administration Software solution for the life assurance and pensions industries.</p>\n<p>“FRS is a tremendous team of individuals that due to their domain knowledge and close relationships with their clients have had great success in the market. All characteristics we value highly. We are excited to welcome them to the Aquila family and look forward to working closely with them” said Mike Byrne, CEO of Aquila.</p>\n<p>He went on to say; “We know that the leadership at FRS have set high goals for themselves to achieve their vision and provide great value to their clients and we are happy to assist in that focus”.</p>\n<p>Peter Caslin, CEO of FRS said; “This is superb news for clients and staff of FRS. The Aquila philosophy of ‘buy and hold forever’ and their financial strength were key factors for FRS in deciding to join Aquila. These characteristics will underpin the long-term relationships FRS has developed with its loyal blue-chip client base. As part of the Aquila family FRS will further develop its award-winning products and expand the software’s geographical reach. We are looking forward to working with the Aquila team.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Aquila Software</strong></p>\n<p>Aquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel &amp; Public Sectors throughout North America and Europe. Aquila’s businesses focus on long-term relationships where our mission critical solutions evolve with our client’s business needs.</p>\n<p><strong>About FRS</strong></p>\n<p>FRS is a premier provider of unit-linked investment administration and fund accounting software for the life assurance and pensions industries. Founded in 1999, FRS has grown through solving complex problems for life and pensions companies.</p>\n"}, {"title": "Vela Software Acquires Coreworx", "link": "https://velasoftwaregroup.com/vela-software-acquires-coreworx/", "date": "1 October, 2018", "content": "\n<p>Vela Software acquires Coreworx, a business providing engineering document management, interface management and contract management solutions for oil and gas, engineering and construction industries.</p>\n<p>Houston, TX, USA – October 1, 2018 – Vela Software acquires Coreworx, a business providing engineering document management, interface management and contract management solutions for oil and gas, engineering and construction industries.</p>\n<p>Coreworx Inc. (“Coreworx”) is pleased to announce its acquisition by Vela, an operating group of Canadian public company Constellation Software Inc. (TSE:CSU).</p>\n<p>The backing of Vela enables a new phase of growth for Coreworx through access to a broad pool of management expertise and software development skills.</p>\n<p>Vela’s permanent-ownership model, and industry-specific expertise will ensure that Coreworx remains a trusted, industry-leading provider of information management solutions to capital projects within the oil and gas, infrastructure, power, mining, and engineered solutions industries.</p>\n<p>“We are excited to join the Vela group and about the opportunities this will bring to the Coreworx brand, products, and customers,” said Coreworx CEO, John Gillberry. “Vela and Constellation bring operating expertise from their hundreds of software businesses, plus financial strength and global infrastructure. Paired with the talents and industry experience of the Coreworx organization, this acquisition sets Coreworx on a course for great success in the future. Coreworx clients can be confident that this move will strengthen the Coreworx position in the marketplace, whilst being assured that services, particularly Coreworx trusted support, will remain unchanged.”</p>\n<p>“We are very pleased to bring Coreworx into the Vela family. Coreworx offers a well-established solution suite that is used by many of the leading names in capital project execution,” said Gabor Czegledy, Senior Vice President, Portfolio Manager at Vela Software. “We look forward to combining Coreworx’s industry knowledge and expertise with the presence and strength of the Vela group in order to provide customers with industry-leading capital project solutions for the long-term.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Coreworx</strong></p>\n<p><a href=\"https://www.coreworx.com/\">Coreworx</a> is a software and services company that provides integrated information management software solutions, including Engineering Document Management Systems, Interface Management, and Contract Management for the world’s engineering and construction projects. Coreworx solutions service a portfolio of projects valued at over $1 trillion across 40 countries, on more than 2,000 projects with 100,000+ users. Coreworx software enables EPCs, owner-operators, and contractors to automate best practices, mitigate business risk, and improve performance to budget throughout the entire project life cycle. Coreworx has development and sales offices in Houston, Calgary, and Kitchener.</p>\n"}, {"title": "Vela Software Acquires NEMS AS", "link": "https://velasoftwaregroup.com/vela-software-acquires-nems-as/", "date": "24 September, 2018", "content": "\n<p>Vela Software acquires NEMS AS, provider of environmental solutions for oil and gas operators, chemical suppliers, authorities and trade associations.</p>\n<p>Stavanger, Norway – September 24, 2018 – Vela Software acquires <a href=\"https://nems.no/\">NEMS AS</a>, provider of environmental solutions for oil and gas operators, chemical suppliers, authorities and trade associations.</p>\n<p>As of the 24th of September 2018, NEMS AS is owned by Vela Software a part of Constellation Software Inc a Canadian company listed on the Toronto Stock Exchange(TSX). Even though the name has changed, the people have not. NEMS sees their clients’ needs are changing. NEMS sees the industry is changing. NEMS sees the world is changing. And their aim is to be one step ahead.</p>\n<p>NEMS is an environmental management company and the aim is to help the clients reduce their emissions. NEMS cares about the environment and they also focus on the client’s success. They are curious on how to improve and innovate their solutions to help their clients become even better. NEMS will continue to challenge the market for better ways to work within their domain.</p>\n<p>NEMS will still help their clients be compliant and within target on their environmental emissions. NEMS will still help companies collaborate on secure chemical documentation. NEMS will still help the industry report emissions to the authorities. And NEMS will still provide emissions studies, papers and insights to their clients.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires Cross-advertising", "link": "https://velasoftwaregroup.com/vela-software-acquires-cross-advertising/", "date": "24 September, 2018", "content": "\n<p>Vela Software acquires Cross-advertising, cloud-based solution that provides end-to-end multi-channel advertising management for news organizations.</p>\n<p>Stockholm, Sweden – September 24, 2018 – Vela Software acquires Cross-advertising, cloud-based solution that provides end-to-end multi-channel advertising management for news organizations.</p>\n<p>We are pleased to announce that Atex, subsidiary of Vela has acquired the “Cross Advertising” business from leading Nordic software and services company Tieto.</p>\n<p>Atex’s continued commitment to the news industry sets out a renewed advertising strategy with the acquisition of the “Cross-advertising” business. Atex aims to offer customers a modern and competitive advertising solution, for efficient multi-channel advertising.</p>\n<p>“Cross-advertising” is a cloud-based solution that provides end-to-end multi-channel advertising management, covering the whole process from sales, CRM, booking to production and invoicing. The solution offers a streamlined advertising process, with management of complex/emerging products and service portfolios, helping news organizations to increase their revenues.</p>\n<p>Atex CEO Anders Christiansen, is excited by the opportunities offered by the acquisition “Atex already has a strong SAAS solution for digital content management and multi-channel publishing and we want to complement our offering with a modern advertising product for current and new customers. With the addition of Cross-advertising to the Atex portfolio of products we are following the DNA of the company, deeply committed to the evolving needs of the news industry. The acquisition has been supported by our owner, Vela Software, that initiated with the Atex acquisition a strategy to become a comprehensive provider of software solutions for the media industry.”</p>\n<p>The Atex Enterprise advertising solution will continue to be supported, existing customers wishing to move to the new web-based platform will be offered a compelling upgrade path, Atex advise Enterprise customers to reach out to their local Atex representatives to discuss their options.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires EPIC Loan Systems", "link": "https://velasoftwaregroup.com/vela-software-acquires-epic-loan-systems/", "date": "10 September, 2018", "content": "\n<p>Vela Software acquires EPIC Loan Systems, provider of end-to-end loan management solution serving North American online loan providers.</p>\n<p>Miami, FL, USA – September 10, 2018 – Vela Software acquires EPIC Loan Systems, provider of end-to-end loan management solution serving North American online loan providers.</p>\n<p>Vela Software and its subsidiary Aquila Software (“Aquila”) announced today that it has closed the acquisition of the assets of EPIC Loan Systems (“EPIC”). EPIC is the developer of the EPIC Loan Systems product, an end-to-end loan management solution serving North American online loan providers.</p>\n<p>“EPIC is a great addition to our FinTech portfolio and deepens our functionality into new segments.  We welcome EPIC customers and employees to the Aquila family.” said Mike Byrne, CEO of Aquila.</p>\n<p>EPIC works with online installment lenders and provides a best of breed solutions for the online installment lending market.</p>\n<p>Brian Martin, President of EPIC said: “Our team is excited about the joining Aquila and the opportunities it creates for our customer base and employees. We look forward to keep serving our customers with solutions and services to assist every critical element in the lending cycle.”</p>\n<p>EPIC was represented in the sale by Transworld M&amp;A Advisors.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Aquila Software</strong></p>\n<p>Aquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel &amp; Public Sectors throughout North America and Europe. Aquila’s businesses focus on long-term relationships where our mission critical solutions evolve with our client’s business needs.</p>\n<p><strong>About EPIC Loan Systems</strong></p>\n<p>EPIC Loan Systems is a premier provider of Loan Management Software. EPIC helps contain customer acquisition and operating costs with its robust, turnkey loan servicing solution. EPIC was designed by industry experts who understood the challenges faced by lenders, as well as their technical needs. EPIC offers a high-tech, high-touch solution, with a consultative approach to helping lenders grow their businesses responsibly.</p>\n"}, {"title": "Vela Software Acquires Spectra QEST", "link": "https://velasoftwaregroup.com/vela-software-acquires-spectra-qest/", "date": "18 July, 2018", "content": "\n<p>Vela Software acquires Spectra QEST, company specializing in solutions for the construction materials engineering, testing, inspection and production industries.</p>\n<p>Adelaide, Australia – July 18, 2018 – Vela Software acquires Spectra QEST, company specializing in solutions for the construction materials engineering, testing, inspection and production industries.</p>\n<p>Spectra QEST is excited to announce its acquisition by Vela Operating Group, a subsidiary of Canadian public company Constellation Software Inc, (TSE:CSU).</p>\n<p>The backing of Vela provides access to capital and expertise that opens up a new phase of growth at Spectra QEST, driving innovation, entry into new markets and faster software development.</p>\n<p>Vela’s approach of allowing acquired companies to operate as stand-alone entities ensures that Spectra QEST will remain the trusted leading provider of software for the construction materials engineering, testing, inspection and production industries.</p>\n<p>“We are excited to join the Vela group and for the opportunity this provides for growth and longevity to Spectra QEST and our customers” said Dirk Janek, CEO at Spectra QEST. “Our team and focus remain the same, continuing development of our leading product suite and building on the strong client relationships we have established over the last 34 years”. Dirk Janek will continue in his role of CEO as will the other Executive Directors; Stephan Mavrakis (Head of Global Sales) and Michael Sautner (CFO).</p>\n<p>“Spectra QEST is a leading provider of software solutions for the construction materials testing, inspection and certification (TIC) market and the Vela Group’s first acquisition in this space. We are excited about the organic growth opportunities for the business and other acquisition possibilities in the TIC market.” said Damian, McKay, Vice President at Vela Software.</p>\n<p>Spectra QEST’s clients can be assured that this acquisition will strengthen Spectra QEST’s position in the market place, while our current team including implementation and support services, will remain unchanged.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Spectra QEST</strong></p>\n<p>Spectra QEST is a software development and services company specializing in solutions for the construction materials engineering, testing, inspection and production industries. Founded in January 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices located in Adelaide, South Australia, and Sacramento, California, it services customers in North America, Europe, Australasia and the Middle East. These customers include leading international construction companies, construction materials and geotechnical engineering companies, construction materials manufacturers, and government bodies.</p>\n"}, {"title": "Vela Software Acquires Infocouncil", "link": "https://velasoftwaregroup.com/vela-software-acquires-infocouncil/", "date": "5 July, 2018", "content": "\n<p>Vela Software acquires Infocouncil Pty Ltd, provider of software products for managing council agendas.</p>\n<p>Sydney, Australia – July 5, 2018 – Vela Software acquires Infocouncil Pty Ltd, provider of software products for managing council agendas.</p>\n<p>On 5th July 2018, Vela Australia acquired a controlling interest in Infocouncil. Vela Australia is the Australian subsiduary of Constellation Software Inc, a publicly listed company on the Canadian stock exchange.</p>\n<p>Vela is a decentralised, learning-focused organisation that offers coaching and resources to help good companies become exceptional. Their best practices, derived from Constellation’s many autonomous business units, help their companies maintain and enhance competitive advantage, while providing customers with superior value.</p>\n<p>Infocouncil will continue to operate as an independent unit but will now have access to know-how, funding and connections that were previously unavailable to the business.</p>\n<p>Infocouncil looks forward to continuing to help their councils manage their agendas and minutes, and the organisation look forward to taking their next steps.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires Pace Software", "link": "https://velasoftwaregroup.com/vela-software-acquires-pace-software/", "date": "26 June, 2018", "content": "\n<p>Vela Software acquires Pace Software Inc., a business providing order, inventory and customer management solutions for automotive service and repair centers.</p>\n<p>Deerfield, IL, USA – June 26, 2018 – Vela Software acquires Pace Software Inc., a business providing order, inventory and customer management solutions for automotive service and repair centers.</p>\n<p>Jacksonville, FL-based Pace is a leading provider of shop management solutions for automotive service and repair centers. The Yes Management™ solutions help single and multi-location automotive shops grow faster by integrating critical workflow functions from counter to repair bay to inventory and back office.</p>\n<p>Following the acquisition, Pace Software, Inc. will operate as Pace Software, LTD., an independent division of Fog Software. The company will continue to develop, enhance, service, and support their industry-leading Yes Management solutions in providing a competitive edge to customers.</p>\n<p>“Pace Software is complementary to our growing portfolio of retail and automotive offerings and brings added depth to our automotive market offerings,” said Mark Thompson, Chief Executive Officer of Fog Software Group. “Pace’s Yes Management solution shows our continued commitment to meeting the needs of today’s tire and automotive service centers.”</p>\n<p>“Our acquisition by Fog Software Group is a strong endorsement of the Pace Software team and our commitment of innovation and service to the automotive repair industry for over three decades,” said Rick Spahn, Founder and President of Pace Software. “We’re really looking forward to this next phase of Pace’s journey and the very positive impact that the Fog Software Group backing will have on our services and products.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About</strong> <strong>Fog Software Group</strong></p>\n<p>Deerfield, IL-based Fog Software Group is a division of Toronto-based Vela Software  and Constellation Software, Inc. [TSX:CSU]. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About Pace Software</strong></p>\n<p>Jacksonville, FL-based Pace Software, Inc. provides essential order, inventory and customer<br/>\nmanagement solutions that integrate easily with parts-house ordering, driving efficiency, productivity, insight and growth for automotive service and repair centers.</p>\n"}, {"title": "Vela Software Acquires Fresh Computer Systems", "link": "https://velasoftwaregroup.com/vela-software-acquires-fresh-computer-systems/", "date": "14 June, 2018", "content": "\n<p>Vela Software acquires Fresh Computer Systems, a provider of accounting, inventory management and quality control solutions for the fresh produce industry.</p>\n<p>Brisbane, Australia – June 14, 2018 – Vela Software acquires Fresh Computer Systems, a provider of accounting, inventory management and quality control solutions for the fresh produce industry.</p>\n<p>Established in 1990 by Jon Patterson, Fresh celebrates 28 years of being in business in 2018, providing innovative and practical business solutions to the fresh produce industry — which will proudly continue into the future.</p>\n<p>We congratulate Jon on the sale of the business and acknowledge the legacy that has been created, far beyond the original “tech startup”. Every single day, hundreds of Fresh users get their jobs done and get on with business — thanks to their Fresh system.</p>\n<p>“This is an exciting development for Fresh,” said Eddie Leathers, General Manager of Fresh Computer Systems, “and an exciting development for Fresh’s clients too.”</p>\n<p>“The strategic and operational support provided by Vela will allow us to extend our market reach, as well as facilitate our continued development of the Fresh suite of products. This opens up a well of resources that we’ll have access to for future development, new innovation that will deliver benefits and complementary new offerings we’ll be able to introduce to our clients.”</p>\n<p>“We look forward to the ongoing successful growth of Fresh into the future and the continued strength of our ongoing business relationships with our clients, which are at the heart of what drives Fresh’s business,” said Eddie.</p>\n<p>Ian Whiting, Director of Vela Software Australia, commented — “The acquisition of Fresh Computer Systems builds on our meaningful presence in the Australia and Asia-Pacific region and extends our footprint in the timber &amp; hardware, rural &amp; agribusiness, electrical appliance and construction &amp; industrial distribution sectors.”</p>\n<p>Business as usual — but business beyond usual</p>\n<p>“It will be business as usual for Fresh clients and suppliers,” says Eddie Leathers, “though in many ways this is the beginning of a whole new world of opportunity for us and our clients.”</p>\n<p>“In the meantime, we’ll continue to develop Fresh’s software in-house and continue to service and support our range of business solutions in order to provide the best experience and a critical competitive edge for all our clients.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires Freestyle Solutions", "link": "https://velasoftwaregroup.com/vela-software-acquires-freestyle-solutions/", "date": "22 February, 2018", "content": "\n<p>Vela Software acquires Freestyle Solutions, a business providing order, inventory and customer management solutions for multichannel retailers.</p>\n<p>Deerfield, IL, USA – February 22, 2018 – Vela Software acquires Freestyle Solutions, a business providing order, inventory and customer management solutions for multichannel retailers.</p>\n<p>Parsippany, NJ-based Freestyle provides essential order, inventory and customer management solutions that integrate easily with eCommerce platforms, driving efficiency, productivity, insight and growth for retail and fulfillment businesses.  The Freestyle solutions helps small- to medium-sized companies grow faster by automating critical back-office functions to support an expanded eCommerce presence.</p>\n<p>Following the acquisition, Freestyle will operate as Freestyle Software, Inc., an independent division of Fog Software. The company will continue to develop, enhance, service, and support their industry-leading Multichannel Order Management (MOM) and other software solutions in providing a competitive edge to customers.</p>\n<p>“Freestyle Software is complementary to our growing portfolio of retail solutions, and brings added depth to this vertical market.” said Mark Thompson, Chief Executive Officer of Fog Software Group. “Freestyle’s broad portfolio of products is key to our commitment for meeting the needs of today’s multichannel merchant.”</p>\n<p>“We are delighted to be part of the Constellation family,” said Tony Kyberd, President of Freestyle. “The Fog team has considerable experience in optimizing and supporting software businesses, providing long-term support for our customers.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Fog Software Group</strong></p>\n<p>Deerfield, IL-based Fog Software Group is a division of Toronto-based Vela Software  and Constellation Software, Inc. [TSX:CSU]. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.</p>\n<p><strong>About Freestyle Software:</strong></p>\n<p>Freestyle Software provides essential order, inventory and customer management solutions that<br/>\nintegrate easily with eCommerce platforms to drive efficiency, productivity, insight and growth for multichannel retailers. Freestyle Software’s proven solutions help small- to medium-sized companies grow faster by automating critical back-office functions to support an expanded eCommerce presence, including: multichannel order management; inventory visibility and control across multiple channels; drop ship management; rapid, reliable order fulfillment; customer management; and integration with Magento, BigCommerce, Shopify, eBay and others.</p>\n"}, {"title": "Vela Software Acquires ProArc", "link": "https://velasoftwaregroup.com/vela-software-acquires-proarc/", "date": "31 January, 2018", "content": "\n<p>Vela Software acquires ProArc unit of Tieto Oyj, a leading software provider of technical document management solutions to the engineering &amp; construction industry.</p>\n<p>Toronto, ON, Canada – Jan 31, 2018 – Vela Software has acquired <a href=\"https://proarcedms.com/\">ProArc</a> unit of Tieto Oyj, a leading software provider of technical document management software to the engineering &amp; construction industry.</p>\n<p>John Billowits, CEO of Vela: “ProArc is the leading provider of technical document management software serving Engineering &amp; Construction companies in the Oil &amp; Gas, Transportation, and Energy markets. ProArc represents our first acquisition in Norway, and our second in the Nordic region, an area in which we are committed to growing.</p>\n<p>By joining Vela, ProArc will gain access to Vela’s and Constellation’s operating expertise across 200+ software businesses, our financial strength, and our global infrastructure. As a permanent-hold investor, we look forward to supporting and bolstering ProArc’s market leadership in the Nordics—as well as globally—for the long run.”</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n"}, {"title": "Vela Software Acquires IN2 Group", "link": "https://velasoftwaregroup.com/vela-software-acquires-in2-group/", "date": "5 January, 2018", "content": "\n<p>Vela Software acquires IN2 Group, a business providing solutions to the Government, Finance, Insurance, Healthcare, Corporate and other industries within the Adriatic region and headquartered in Zagreb, Croatia.</p>\n<p>Toronto, ON, Canada – Jan 5, 2018 – Vela Software and its subsidiary Aquila Software has acquired IN2 Group (“IN2”), a business providing solutions to the Government, Finance, Insurance, Healthcare, Corporate and other industries within the Adriatic region and headquartered in Zagreb, Croatia.</p>\n<p>Mike Byrne, Chief Executive Officer of Aquila Software, commented, “The acquisition of IN2 provides a continued step in our commitment to the IT solutions within the region.  We are excited about the quality of the people and the clients of IN2.  What IN2 has accomplished over the past 25 years is tremendous and we hope to build upon their accomplishments within the region.”</p>\n<p><strong>About Vela </strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Aquila </strong></p>\n<p>Aquila Software has focused on providing great solutions to Housing &amp; Real Estate, Finance &amp; Banking, and Travel throughout North America and Europe.  Aquila’s businesses focus on long term relationships where our solutions evolve with our client’s business needs.  Further information about Aquila may be obtained from its website at www.aquilasw.com.  For further information, contact:</p>\n<p><strong>Constellation Software Inc.</strong></p>\n<p>Jamal Baksh, Chief Financial Officer</p>\n<p>Tel: (416) 861-2279</p>\n<p>jbaksh@csisoftware.com</p>\n<p>www.csisoftware.com</p>\n<p><strong>Aquila Software</strong></p>\n<p>Steve Richards, Chief Financial Officer</p>\n<p>Tel: (305) 599-2531</p>\n<p>srichards@aquilasw.com</p>\n<p>www.aquilasw.com</p>\n"}, {"title": "Vela Software Acquires FAME", "link": "https://velasoftwaregroup.com/vela-software-acquires-fame/", "date": "28 November, 2017", "content": "\n<p>Vela Software acquires Financial Aid Management for Education, Inc. (FAME, Inc.), a business providing Financial Aid Solutions (FAS) and Student Information Systems (SIS) for the Higher Education industry.</p>\n<p>Toronto, ON, Canada – November 28, 2017 – Vela Software and its subsidiary Aquila Software has acquired Financial Aid Management for Education, Inc. (“FAME”), a business providing Financial Aid Solutions (FAS) and Student Information Systems (SIS) to Higher Education clients. FAME, headquartered in Fort Lauderdale, FL, provides solutions to help Higher Education clients provide outstanding service to their students.</p>\n<p>Mike Byrne, Chief Executive Officer of Aquila Software, commented, “The acquisition of FAME provides our first step into Higher Education, a market that provides tremendous value throughout North America.  We are excited to start to work with the staff at FAME to enhance their already great service levels.”</p>\n<p><strong>About Vela </strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Aquila </strong></p>\n<p>Aquila Software has focused on providing great solutions to Housing &amp; Real Estate, Finance &amp; Banking, and Travel throughout North America and Europe.  Aquila’s businesses focus on long term relationships where our solutions evolve with our client’s business needs.  Further information about Aquila may be obtained from its website at www.aquilasw.com. For further information, contact:</p>\n<p><strong>Constellation Software Inc.</strong></p>\n<p>Jamal Baksh, Chief Financial Officer</p>\n<p>Tel: (416) 861-2279</p>\n<p>jbaksh@csisoftware.com</p>\n<p>www.csisoftware.com</p>\n<p><strong>Aquila Software</strong></p>\n<p>Steve Richards, Chief Financial Officer</p>\n<p>Tel: (305) 599-2531</p>\n<p>srichards@aquilasw.com</p>\n<p>www.aquilasw.com</p>\n"}, {"title": "VELA Software Acquires Atex", "link": "https://velasoftwaregroup.com/vela-software-acquires-atex/", "date": "6 September, 2017", "content": "\n<p>Vela Software acquires Atex, a leading provider of content management, advertising and audience commercial software for the global media industry</p>\n<p>Reading, UK – September 6, 2017 – Atex is pleased to announce Vela Software, operating group of Constellation Software Inc. as the new owner of Atex.</p>\n<p>Vela is a subsidiary of Constellation Software Inc. (CSI), a Canadian company with headquarters in Toronto and traded on Toronto Stock Exchange. CSI holds a portfolio of different software companies throughout the world, and Atex will be their first investment in a company serving the media industry.</p>\n<p>John Billowits, CEO of Vela, commented on the acquisition “We are pleased to welcome the employees and customers of Atex to Vela. Atex represents our first investment in the media sector and we are excited by the opportunity to build on the new products and services that they have invested in.”</p>\n<p>Anders Christiansen, CEO of Atex, about the new owner: “I am pleased to welcome CSI as our new owner. We share a common view on the potential of the media industry where focus on new technology and strong service offerings will help media companies with their digital transition. We look forward to developing and delivering great software solutions to new and existing customers around the world.”</p>\n<p>Atex will continue to operate as a separate business with the existing Atex management team in place.</p>\n<p><strong>About Atex</strong></p>\n<p>Atex is a leading provider of content management, advertising and audience commercial software for the global media industry. Atex technologies are helping to power some of the most prestigious, innovative and demanding media companies in 55 countries worldwide. Their commitment to customer excellence is reflected in the quality of their software products, professional services and support teams. From hosted solutions to on-premise systems, Atex is the company that media-rich enterprises prefer as their trusted partner to help build new revenue streams, reduce operating costs and strengthen brand equity.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software acquires, manages, and builds mission-critical vertical market software businesses that are located throughout the world. It works with its companies to improve operations, grow through organic initiatives, and acquire businesses that can strengthen market positioning. Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange with 6 operating groups that provide software for over 80 vertical markets. Constellation Software Inc. has consolidated revenues exceeding US$2 billion with greater than 11,000 employees located in over 250 offices worldwide.</p>\n<p>Should you have any questions please do not hesitate to contact Anders Christiansen (achristiansen@atex.com) or anyone from the Atex management team.</p>\n"}, {"title": "VELA Software Acquires Petrosys", "link": "https://velasoftwaregroup.com/vela-software-acquires-petrosys/", "date": "9 July, 2017", "content": "\n<p>Vela Software acquires Petrosys, an industry-leader in Oil and Gas mapping, surface modeling and data management software solutions</p>\n<p>Adelaide, Australia – July 19, 2017 –  Oil and gas technology company Petrosys is pleased to announce its acquisition by Vela Software, a subsidiary of Canadian public company Constellation Software Inc. (TSE:CSU).</p>\n<p>The backing of Vela opens up a new phase of growth for Petrosys, allowing stronger penetration of new markets, faster software development and more innovative R&amp;D. It also provides access to a broad pool of management expertise and software development skills.</p>\n<p>Vela’s approach of allowing acquired companies tooperate as stand-alone entities will ensure that Petrosys remains the respected,trusted, industry-leading provider for mapping, surface modeling and data management software for the oil and gas industry.</p>\n<p>“We are excited to be able tojoin the Vela group and about the growth opportunities and longevity this will bring to the Petrosys brand, products and customers in the oil and gas market.” said Petrosys’ founder, Volker Hirsinger. “It will provide us with opportunities to thrive, whilst being able to enhance the Petrosys brand values of industry-leading technology and service that clients have come to trust.” Dr. Hirsinger will continue in his role as VP Americas, which will now allow him the opportunity to engage more closely with Petrosys clients and partners in the Americas.</p>\n<p>“We are excited to add the Petrosys brand, product suite and knowledge base to the Vela group. This provides us a flagship brand and identity in the Oil and Gas market. By combining Petrosys domain knowledge, with the presence and the strength of the Vela group, we are excited about organic growth opportunities and this is the first of many acquisitions in the oil and gas market space,” said Damian McKay, Vice President at Vela Software.</p>\n<p>Petrosys clients can be confident that the move will strengthen Petrosys’ position in the marketplace, whilst being assured that services, particularly Petrosys’ trusted industry-leading support, will remain unchanged.</p>\n<p><strong>About Petrosys</strong></p>\n<p>Petrosys is the industry-leader in mapping, surface modeling and data management software solutions for petroleum E&amp;P – delivering direct connectivity with the most popular exploration, production and GIS data sources. The Petrosys® software suite produces high quality maps and surface models. It manages seismic, well, geoscience and other specialised data used in the search for oil and gas at over 300 sites around the world.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software acquires, manages, and builds mission-critical vertical market software businesses that are located throughout the world. It works with its companies to improve operations, grow through organic initiatives, and acquire businesses that can strengthen market positioning. Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange with 6 operating groups that provide software for over 80 vertical markets. Constellation Software Inc. has consolidated revenues exceeding US$2 billion with greater than 11,000 employees located in over 250 offices worldwide.</p>\n<p>For further information please email info@petrosys.com.au or refer to www.petrosys.com.au. Media enquiries please contact Kasia Lysakowski at kasia@petrosys.com.au.</p>\n"}, {"title": "Vela Software Acquires CEI", "link": "https://velasoftwaregroup.com/vela-software-acquires-cei/", "date": "17 February, 2017", "content": "\n<p>Vela Software acquires CEI, specialized provider of pressure vessel design and welding software solutions</p>\n<p>Blue Springs, MO, USA – February 17, 2017 –  Pressure vessel design and welding technology company Computer Engineering (CEI) is pleased to announce its acquisition by Vela Software, an operating group of Canadian public company Constellation Software Inc..</p>\n<p>For over thirty years, CEI has helped shape the industry by providing code-compliance software that undergoes routine updating to adhere to changes in safety and design codes. DesignCalcs, CEI’s pressure vessel design software, enables engineers to rapidly prototype and design pressure vessels using extensive sets of calculations and applicable industry body codes. While CEI’s welding software, ProWrite, is the industry leading software for welding procedure documentation and welder management.</p>\n<p><strong>About CEI</strong></p>\n<p><a href=\"https://www.thinkcei.com/\">Computer Engineering (CEI)</a> develops pressure vessel design and welding software that helps engineers worldwide design, manage, and maintain their ASME or AWS related pressure vessel and welding projects. CEI’s mission is to provide creative tools that empower our clients to excel in the welding and pressure vessel industry. Their expert knowledge bridges the gap between what budgets require and what safety demands – from pressure vessel design to welder continuity tracking to form submission.</p>\n<p><strong>About Vela</strong></p>\n<p>Vela Software acquires, manages, and builds mission-critical vertical market software businesses that are located throughout the world. It works with its companies to improve operations, grow through organic initiatives, and acquire businesses that can strengthen market positioning. Vela is an operating group of Constellation Software Inc. (TSX: CSU), a public company listed on the Toronto Stock Exchange with 6 operating groups that provide software for over 80 vertical markets. Constellation Software Inc. has consolidated revenues exceeding US$2 billion with greater than 11,000 employees located in over 250 offices worldwide.</p>\n"}, {"title": "Vela Software acquires Tecplot", "link": "https://velasoftwaregroup.com/vela-software-acquires-tecplot/", "date": "16 May, 2016", "content": "\n<p>Vela Software acquires Tecplot, a leading fluid dynamics visualization and analysis software company focused on the aerospace and oil &amp; gas industries</p>\n<p>Bellevue, WA, USA – May 16, 2016 – Vela Software (Vela), an operating group of Constellation Software Inc. (CSI) (TSX: CSU), announced today that it has acquired Tecplot, Inc. (Tecplot), a leading provider of fluid dynamics visualization and analysis software for engineers and scientists in the aerospace and oil &amp; gas vertical markets.</p>\n<p>Tecplot, founded in 1981, develops, designs, and sells a variety of Computational Fluid Dynamics (CFD) post-processing solutions used by tens-of-thousands of engineers and scientists worldwide to help them unlock insights from complex data via visual analysis. Tecplot’s core product suite includes the 360 and RS solutions. Tecplot 360 enables aerospace engineers and scientists to effectively plot CFD data, analyze complex solutions, arrange multiple layouts, and communicate output effectively in order to enhance aerodynamic design. Tecplot RS gives oil &amp; gas engineers the ability to manage and analyze simulation data, uncover knowledge about reservoir model behavior, and gain confidence in making crucial decisions.</p>\n<p>Don Roberts, co-founder of Tecplot, stated, “Mike Peery and I are delighted that we can place the company that we have grown and nurtured for 35 years into the strong hands of Vela. Their expertise in growing software companies gives Tecplot a solid foundation upon which it can build into the future.”</p>\n<p>John Billowits, CEO of Vela, stated, “We are excited to enter the aerospace and oil &amp; gas vertical markets with the acquisition of Tecplot and we welcome their employees and customers to the CSI family. We look forward to working with the Tecplot team to continue to build on their innovative industry-leading visual data analysis solutions.”</p>\n<p>Tecplot is headquartered in Bellevue, Washington.</p>\n<p><strong>About Vela Software</strong></p>\n<p>Vela Software is a global provider of software solutions to a number of vertical markets. As an operating group of CSI, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions.</p>\n<p>Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position.</p>\n<p><strong>About Constellation Software Inc.</strong></p>\n<p>Constellation Software Inc., a public company listed on the Toronto Stock Exchange, acquires, manages, and builds vertical market software businesses that provide mission-critical software solutions.</p>\n<p><strong>About Tecplot, Inc.</strong></p>\n<p>Founded in 1981, Tecplot, Inc. is the leading developer of visual data analysis software for engineers and scientists. Tecplot’s products allow customers to quickly analyze and understand information hidden in complex data, and communicate their results to others via brilliant images and compelling animations. The company’s products are used by more than 47,000 technical professionals around the world.</p>\n<p>Since its founding more than 30 years ago, Tecplot has consistently delivered category-leading innovation to the engineering and scientific communities. Examples of this on-going innovation include Tecplot RS for oil &amp; gas reservoir simulation, Tecplot Chorus for analyzing multiple simulations of design-space exploration data, Tecplot 360 EX for lightning-fast analysis of massive CFD simulation data, and Tecplot Focus for automating routine data analysis and plotting tasks.</p>\n<p><strong><u>Contact Information</u></strong></p>\n<p><strong>Vela Software</strong></p>\n<p>John Billowits, CEO</p>\n<p>1.416.861.2279</p>\n<p><a href=\"mailto:jbillowits@velasoftwaregroup.com\">jbillowits@velasoftwaregroup.com</a></p>\n<p><a href=\"https://velasoftwaregroup.com/\" rel=\"noopener noreferrer\" target=\"_blank\">velasoftwaregroup.com</a></p>\n<p><strong>Tecplot, Inc.</strong></p>\n<p>Tom Chan, President</p>\n<p>1.425.653.1200</p>\n<p><a href=\"mailto:t.chan@tecplot.com\">t.chan@tecplot.com</a></p>\n<p><a href=\"http://www.tecplot.com/\" rel=\"noopener noreferrer\" target=\"_blank\">tecplot.com</a></p>\n"}]