[{"title": "Vela Software acquires Tecplot", "link": "https://velasoftwaregroup.com/vela-software-acquires-tecplot/", "date": "16 May, 2016", "parent": "Vela", "companyUrl": "http://www.tecplot.com/", "company": "", "companyFounded": "1981", "companyAbout": "About Tecplot, Inc.Founded in 1981, Tecplot, Inc. is the leading developer of visual data analysis software for engineers and scientists. Tecplot’s products allow customers to quickly analyze and understand information hidden in complex data, and communicate their results to others via brilliant images and compelling animations. The company’s products are used by more than 47,000 technical professionals around the world.Since its founding more than 30 years ago, Tecplot has consistently delivered category-leading innovation to the engineering and scientific communities. Examples of this on-going innovation include Tecplot RS for oil & gas reservoir simulation, Tecplot Chorus for analyzing multiple simulations of design-space exploration data, Tecplot 360 EX for lightning-fast analysis of massive CFD simulation data, and Tecplot Focus for automating routine data analysis and plotting tasks."}, {"title": "Vela Software Acquires CEI", "link": "https://velasoftwaregroup.com/vela-software-acquires-cei/", "date": "17 February, 2017", "parent": "Vela", "companyUrl": "https://www.thinkcei.com/", "company": "Computer Engineering (CEI", "companyAbout": "About CEIComputer Engineering (CEI) develops pressure vessel design and welding software that helps engineers worldwide design, manage, and maintain their ASME or AWS related pressure vessel and welding projects. CEI’s mission is to provide creative tools that empower our clients to excel in the welding and pressure vessel industry. Their expert knowledge bridges the gap between what budgets require and what safety demands – from pressure vessel design to welder continuity tracking to form submission."}, {"title": "VELA Software Acquires Petrosys", "link": "https://velasoftwaregroup.com/vela-software-acquires-petrosys/", "date": "9 July, 2017", "parent": "Vela", "company": "Petrosys", "companyAbout": "About PetrosysPetrosys is the industry-leader in mapping, surface modeling and data management software solutions for petroleum E&P – delivering direct connectivity with the most popular exploration, production and GIS data sources. The Petrosys® software suite produces high quality maps and surface models. It manages seismic, well, geoscience and other specialised data used in the search for oil and gas at over 300 sites around the world."}, {"title": "VELA Software Acquires Atex", "link": "https://velasoftwaregroup.com/vela-software-acquires-atex/", "date": "6 September, 2017", "parent": "Vela", "company": "Atex", "companyAbout": "About AtexAtex is a leading provider of content management, advertising and audience commercial software for the global media industry. Atex technologies are helping to power some of the most prestigious, innovative and demanding media companies in 55 countries worldwide. Their commitment to customer excellence is reflected in the quality of their software products, professional services and support teams. From hosted solutions to on-premise systems, Atex is the company that media-rich enterprises prefer as their trusted partner to help build new revenue streams, reduce operating costs and strengthen brand equity."}, {"title": "Vela Software Acquires FAME", "link": "https://velasoftwaregroup.com/vela-software-acquires-fame/", "date": "28 November, 2017", "parent": "Vela", "company": "", "companyAbout": "About Aquila Aquila Software has focused on providing great solutions to Housing & Real Estate, Finance & Banking, and Travel throughout North America and Europe.  Aquila’s businesses focus on long term relationships where our solutions evolve with our client’s business needs.  Further information about Aquila may be obtained from its website at www.aquilasw.com. For further information, contact:"}, {"title": "Vela Software Acquires IN2 Group", "link": "https://velasoftwaregroup.com/vela-software-acquires-in2-group/", "date": "5 January, 2018", "parent": "Vela", "company": "IN2 Group", "companyAbout": "About Aquila Aquila Software has focused on providing great solutions to Housing & Real Estate, Finance & Banking, and Travel throughout North America and Europe.  Aquila’s businesses focus on long term relationships where our solutions evolve with our client’s business needs.  Further information about Aquila may be obtained from its website at www.aquilasw.com.  For further information, contact:"}, {"title": "Vela Software Acquires ProArc", "link": "https://velasoftwaregroup.com/vela-software-acquires-proarc/", "date": "31 January, 2018", "parent": "Vela", "companyUrl": "https://proarcedms.com/", "company": ""}, {"title": "Vela Software Acquires Freestyle Solutions", "link": "https://velasoftwaregroup.com/vela-software-acquires-freestyle-solutions/", "date": "22 February, 2018", "parent": "Vela", "company": "", "companyAbout": "About Fog Software GroupDeerfield, IL-based Fog Software Group is a division of Toronto-based Vela Software  and Constellation Software, Inc. [TSX:CSU]. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Vela Software Acquires Fresh Computer Systems", "link": "https://velasoftwaregroup.com/vela-software-acquires-fresh-computer-systems/", "date": "14 June, 2018", "parent": "Vela", "company": "Fresh Computer Systems", "companyFounded": "1990"}, {"title": "Vela Software Acquires Pace Software", "link": "https://velasoftwaregroup.com/vela-software-acquires-pace-software/", "date": "26 June, 2018", "parent": "Vela", "company": "Pace Software Inc., a business providing order, inventory and customer management solutions for automotive service and repair centers.\nDeerfield, IL, USA – June 26, 2018 – Vela Software acquires Pace Software Inc., a business providing order, inventory and customer management solutions for automotive service and repair centers.\nJacksonville, FL-based Pace is a leading provider of shop management solutions for automotive service and repair centers. The Yes Management™ solutions help single and multi-location automotive shops grow faster by integrating critical workflow functions from counter to repair bay to inventory and back office.\nFollowing the acquisition, Pace Software, Inc. will operate as Pace Software, LTD., an independent division of Fog Software. The company will continue to develop, enhance, service, and support their industry-leading Yes Management solutions in providing a competitive edge to customers.\n“Pace Software is complementary to our growing portfolio of retail and automotive offerings and brings added depth to our automotive market offerings,” said Mark Thompson, Chief Executive Officer of Fog Software Group. “Pace’s Yes Management solution shows our continued commitment to meeting the needs of today’s tire and automotive service centers.”\n“Our acquisition by Fog Software Group is a strong endorsement of the Pace Software team and our commitment of innovation and service to the automotive repair industry for over three decades,” said Rick Spahn, Founder and President of Pace Software. “We’re really looking forward to this next phase of Pace’s journey and the very positive impact that the Fog Software Group backing will have on our services and products.”\nAbout Vela\nVela Software is a global provider of software solutions to a number of vertical industries. As an Operating Group of Constellation, Vela acquires, manages, and builds specific software businesses which provide specialized, mission-critical software solutions. Vela companies invest in becoming leaders in their industries to better serve their customers. We help companies improve their operations, grow through organic initiatives, and seek acquisitions that can strengthen their market position", "companyAbout": "About Fog Software GroupDeerfield, IL-based Fog Software Group is a division of Toronto-based Vela Software  and Constellation Software, Inc. [TSX:CSU]. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Vela Software Acquires Infocouncil", "link": "https://velasoftwaregroup.com/vela-software-acquires-infocouncil/", "date": "5 July, 2018", "parent": "Vela", "company": ""}, {"title": "Vela Software Acquires Spectra QEST", "link": "https://velasoftwaregroup.com/vela-software-acquires-spectra-qest/", "date": "18 July, 2018", "parent": "Vela", "company": "Spectra QEST", "companyAbout": "About Spectra QESTSpectra QEST is a software development and services company specializing in solutions for the construction materials engineering, testing, inspection and production industries. Founded in January 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices located in Adelaide, South Australia, and Sacramento, California, it services customers in North America, Europe, Australasia and the Middle East. These customers include leading international construction companies, construction materials and geotechnical engineering companies, construction materials manufacturers, and government bodies."}, {"title": "Vela Software Acquires EPIC Loan Systems", "link": "https://velasoftwaregroup.com/vela-software-acquires-epic-loan-systems/", "date": "10 September, 2018", "parent": "Vela", "company": "EPIC Loan Systems", "companyAbout": "About Aquila SoftwareAquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel & Public Sectors throughout North America and Europe. Aquila’s businesses focus on long-term relationships where our mission critical solutions evolve with our client’s business needs."}, {"title": "Vela Software Acquires Cross-advertising", "link": "https://velasoftwaregroup.com/vela-software-acquires-cross-advertising/", "date": "24 September, 2018", "parent": "Vela", "company": "Tieto"}, {"title": "Vela Software Acquires NEMS AS", "link": "https://velasoftwaregroup.com/vela-software-acquires-nems-as/", "date": "24 September, 2018", "parent": "Vela", "companyUrl": "https://nems.no/", "company": "NEMS AS"}, {"title": "Vela Software Acquires Coreworx", "link": "https://velasoftwaregroup.com/vela-software-acquires-coreworx/", "date": "1 October, 2018", "parent": "Vela", "companyUrl": "https://www.coreworx.com/", "company": "Coreworx Inc. (“Coreworx", "companyAbout": "About CoreworxCoreworx is a software and services company that provides integrated information management software solutions, including Engineering Document Management Systems, Interface Management, and Contract Management for the world’s engineering and construction projects. Coreworx solutions service a portfolio of projects valued at over $1 trillion across 40 countries, on more than 2,000 projects with 100,000+ users. Coreworx software enables EPCs, owner-operators, and contractors to automate best practices, mitigate business risk, and improve performance to budget throughout the entire project life cycle. Coreworx has development and sales offices in Houston, Calgary, and Kitchener."}, {"title": "Vela Software Acquires Financial Risk Solutions (“FRS”)", "link": "https://velasoftwaregroup.com/vela-software-acquires-financial-risk-solutions-frs/", "date": "19 December, 2018", "parent": "Vela", "company": "Financial Risk Solutions", "companyAbout": "About Aquila SoftwareAquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel & Public Sectors throughout North America and Europe. Aquila’s businesses focus on long-term relationships where our mission critical solutions evolve with our client’s business needs."}, {"title": "Vela Software Acquires MOSAIC", "link": "https://velasoftwaregroup.com/vela-software-acquires-mosaic/", "date": "3 October, 2019", "parent": "Vela", "companyUrl": "http://www.quorumsoftware.com", "company": "Quorum Business Solutions", "companyAbout": "About MOSAIC Software. MOSAIC is an industry leading integrated petroleum economic, decline analysis, reserves management and budgeting solution. MOSAIC enables oil and gas companies to achieve greater standardization, faster execution, higher data confidence, and improved productivity – from projects and properties through to corporate reporting. MOSAIC has offices in Calgary and Houston and will now rely on Vela’s existing international locations to provide a global support reach."}, {"title": "Vela Software Acquires TSI", "link": "https://velasoftwaregroup.com/vela-software-acquires-tsi/", "date": "24 January, 2020", "parent": "Vela", "company": "TPF Software Inc", "companyFounded": "1986", "companyAbout": "About Juniper:\nJuniper is a leader in providing Travel Distribution Software for Tour Operators, OTAs (Online Travel Agencies), Bed Banks and Incoming Agencies. Juniper has cutting-edge technology and a highly committed team and has had a huge growth in the market in recent years. With more than 300 employees, Juniper has more than 360 customers in 50 countries. For more information about Juniper, visit www.ejuniper.com."}, {"title": "Vela Software Acquires Foresiight", "link": "https://velasoftwaregroup.com/vela-software-acquires-foresiight/", "date": "28 February, 2020", "parent": "Vela", "company": "Foresiight Software Pty Ltd", "companyFounded": "1981"}, {"title": "Vela Software Acquires Envirosoft", "link": "https://velasoftwaregroup.com/vela-software-acquires-envirosoft/", "date": "1 March, 2020", "parent": "Vela", "company": "Envirosoft Corporation"}, {"title": "Vela Software Acquires ProShip", "link": "https://velasoftwaregroup.com/vela-software-acquires-proship/", "date": "2 March, 2020", "parent": "Vela", "company": "ProShip, Inc", "companyAbout": "About FOG Software Group\nDeerfield, IL-based FOG Software Group https://www.fogsoftwaregroup.com is a division of Toronto-based Vela Software https://velasoftwaregroup.com and Constellation Software, Inc. (TSX: CSU) https://www.csisoftware.com. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries.ProShip, Inc. is a global provider of enterprise-wide, automated, multi-carrier shipping and manifesting software that allows retailers, manufacturers, third-party logistics and healthcare companies to ship at lighting speeds, stay carrier compliant, and build stronger-than-ever customer revenue streams. Founded by two US Navy veterans in 2001, the company was most recently part of Quadient, formerly known as Neopost. Learn more about ProShip online https://www.proshipinc.com."}, {"title": "Vela Software Acquires Interica", "link": "https://velasoftwaregroup.com/vela-software-acquires-interica/", "date": "3 March, 2020", "parent": "Vela", "company": "Interica", "companyAbout": "About Petrosys\nPetrosys is the industry-leader in mapping, surface modeling and data management software solutions for petroleum E&P – delivering direct connectivity with the most popular exploration, production and GIS data sources. The Petrosys® software suite produces high quality maps and surface models. It manages seismic, well, geoscience and other specialised data used in the search for oil and gas at over 300 sites around the world. For further information on Petrosys please refer to www.petrosys.com.au."}, {"title": "Vela Software Acquires Kurier", "link": "https://velasoftwaregroup.com/vela-software-acquires-kurier/", "date": "14 April, 2020", "parent": "Vela", "company": "Kurier", "companyAbout": "About Kurier. Kurier is a pioneer in technology and legal intelligence solutions in the Brazilian market. The company serves over 1,700 clients, including seven of the ten largest law firms in Brazil. Customers also include legal departments of large companies and the main credit bureaus in the country. Transforming the market through data, systems and legal intelligence, Kurier provides operational efficiency and an analytical approach, optimizing time and information management for better decision making. For more information, visit: kurier.com.br"}, {"title": "Vela Software acquires InfoCorp", "link": "https://velasoftwaregroup.com/vela-software-acquires-infocorp/", "date": "4 June, 2020", "parent": "Vela", "companyUrl": "http://www.infocorp.com.uy", "company": "InfoCorp", "companyAbout": "About Aquila Software:Aquila is focused on providing great solutions to Housing, Finance, Banking, Insurance, Higher Education, Travel & Public Sectors throughout the Americas and Europe. Aquila’s businesses focus on long-term relationships where our mission-critical solutions evolve with our clients’ business needs. Further information about Aquila Software can be found at www.aquilasw.com."}, {"title": "Kirstie Boyle Announced as General Manager of Envirosoft", "link": "https://velasoftwaregroup.com/kirstie-boyle-announced-as-general-manager-of-envirosoft/", "date": "9 July, 2020", "parent": null, "company": "", "companyAbout": "About Envirosoft. Envirosoft provides trusted and scalable emissions management and ESG reporting solutions to the oil and gas industry.  Our industry-leading integrated software suite and expert consulting services help our clients meet their evolving environmental, regulatory, and compliance needs."}, {"title": "Vela Software Acquires Snowden", "link": "https://velasoftwaregroup.com/vela-software-acquires-snowden/", "date": "22 July, 2020", "parent": "Vela", "companyUrl": "https://www.linkedin.com/in/tarrant-elkington-8204b010/", "company": "Snowden"}, {"title": "Stat-Ease Acquired by Vela Software", "link": "https://velasoftwaregroup.com/stat-ease-acquired-by-vela-software/", "date": "22 July, 2020", "parent": "Vela", "companyUrl": "https://www.statease.com/", "company": "Stat-Ease", "companyAbout": "If you have any questions about this acquisition, or the capabilities of Design-Expert, please contact Stat-Ease at info@statease.com."}, {"title": "Vela acquires Navarik", "link": "https://velasoftwaregroup.com/vela-acquires-navarik/", "date": "4 September, 2020", "parent": "Vela", "company": "Navarik"}, {"title": "Compusense Acquired by Vela Software", "link": "https://velasoftwaregroup.com/compusense-acquired-by-vela-software/", "date": "14 September, 2020", "parent": "Vela", "company": "Compusense", "companyAbout": "If you have any questions about this acquisition, or the capabilities of Compusense’s products, please contact Compusense at info@compusense.com."}, {"title": "Vela Software Acquires ElmTree System", "link": "https://velasoftwaregroup.com/vela-software-acquires-elmtree-system/", "date": "21 October, 2020", "parent": "Vela", "company": "ElmTree System", "companyAbout": "About Spectra QESTAn operating company of Vela Software International, Inc., itself an operating group of Toronto-based Constellation Software, Inc. (CSI), Spectra QEST is a software development and services company specializing in solutions for the construction materials engineering, testing, inspection and production industries.Founded in January 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices located in Adelaide, South Australia and Sacramento, California, it services customers in North America, Europe, Australasia and the Middle East. These customers include leading international construction companies, construction materials and geotechnical companies, construction materials manufacturers and government bodies."}, {"title": "Vela Acquires SeaRoc", "link": "https://velasoftwaregroup.com/vela-acquires-searoc/", "date": "23 October, 2020", "parent": "Vela", "company": "SeaRoc Group Ltd", "companyFounded": "2002", "companyAbout": "About SeaRoc. SeaRoc was formed in 2002 to provide industry leading Software as a Service Solutions to optimise safety and efficiency within large scale, hazardous operational, and construction environments.SeaRoc’s SeaPlanner product has played a pivotal role in the development of 31 offshore wind projects, supporting the induction and certification management of over 24,000 personnel and 500 subcontractors.Built on its learnings from these highly challenging environments, SeaRoc’s SitePlanner Contractor Management System allows its customers to achieve efficient and safe operations across a wide range of land-based construction and site management challenges.Going forward, SeaRoc will operate as an independent business unit within Vela.  Ian Sellwood, MD of SeaRoc stated, “Despite past successes it was very important that SeaRoc found a new partner to maximise its growth potential in these expanding and innovative markets.  In Vela we believe we have found that partner.  Their successes across its existing SaaS portfolio demonstrates the value add of their best practices, financial guidance, and business focus.  Their customer focused culture aligns with SeaRoc’s personality and the teams desire to offer customers the best solutions and support.  We look forward to an exciting and prosperous future together”.“We are very excited to welcome the SeaRoc team into the Vela family. As an industry leader in software and service solutions for challenging site management environments we expect to continue and grow their excellent customer advocacy and reputation under our ownership. SeaRoc brings us further strengths in markets that we consider core for our future expansion and we have high expectations for its future.” said Gabor Czegledy, CEO, Portfolio Manager at Vela. “As always, we look forward to combining SeaRoc’s deep industry expertise with the Vela group’s financial strength and operational expertise in order to provide customers with industry-leading solutions.”"}, {"title": "FACTON Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/facton-acquired-by-fog-software-group/", "date": "12 January, 2021", "parent": null, "companyUrl": "http://www.facton.com", "company": "FACTON"}, {"title": "Datamine acquires Centric Mining Systems", "link": "https://velasoftwaregroup.com/datamine-acquires-centric-mining-systems/", "date": "3 March, 2021", "parent": null, "company": "Centric Mining Systems", "companyFounded": "1998", "companyAbout": "About CentricCentric Mining Systems is a global software solution provider that specializes in data acquisition, systems integration, data warehousing, knowledge generation, and decision support solutions specific to the mining industry. Centric’s powerful Mine Information Management Platform provides vital insight into mining value-chain, enhancing decision-making and improving ability to quickly respond to challenges."}, {"title": "Vela acquires Beacon Business Systems", "link": "https://velasoftwaregroup.com/vela-acquires-beacon-business-systems/", "date": "15 March, 2021", "parent": "Vela", "company": "Pixen Pty Ltd T/A Beacon Business Systems"}, {"title": "Datamine acquires Qmuzik", "link": "https://velasoftwaregroup.com/datamine-acquires-qmuzik/", "date": "27 April, 2021", "parent": null, "companyUrl": "mailto:megan.mooi@dataminesoftware.com", "company": "Qmuzik", "companyFounded": "1993", "companyAbout": "About Qmuzik"}, {"title": "FOG SOFTWARE GROUP ANNOUNCES ACQUISITION OF BRZ SCHWEIZ AG", "link": "https://velasoftwaregroup.com/fog-software-group-announces-acquisition-of-brz-schweiz-ag-2/", "date": "10 June, 2021", "parent": null, "company": "BRZ Schweiz AG", "companyAbout": "‍About FOG Software GroupRosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software and Constellation Software, Inc. [TSX:CSU] . The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Vela Software Group acquires Figtree Systems", "link": "https://velasoftwaregroup.com/vela-software-group-acquires-figtree-systems/", "date": "22 June, 2021", "parent": "Vela", "companyUrl": "https://velasoftwaregroup.com", "company": "Figtree Systems"}, {"title": "JUNIPER GROUP ACQUIRES AVALON INFORMÁTICA", "link": "https://velasoftwaregroup.com/juniper-group-acquires-avalon-informatica/", "date": "13 August, 2021", "parent": null, "companyUrl": "http://www.juniper-group.com/", "company": "Avalon Informática y Servicios Group", "companyFounded": "1986", "companyAbout": "About Avalon. Avalon is a market leader in the Oil & Gas as well as Retail sector in Spain and Latin America. Its portfolio of software and hardware solutions covers the entire value chain of their diverse customer base. To learn more, visit https://www.avaloninformatica.com"}, {"title": "COVID-19 Vaccination Software Has Now Been Released to the Australian Market", "link": "https://velasoftwaregroup.com/covid-19-vaccination-software-has-now-been-released-to-the-australian-market/", "date": "25 August, 2021", "parent": null, "companyUrl": "mailto:marketing@dataminesoftware.com", "company": "Qmed", "companyAbout": "About Qmuzik. Qmuzik Technologies, the owner of Qmed, is a Software Development House based in South Africa. The company has established itself as a market leader in the niche areas it has identified by supplying systems developed in close collaboration with industry leaders. By supplying implementation and support services, Qmuzik Technologies stays close to the customer base and ever evolving requirements. The Qmuzik group is organised into focused entities to further enhance customer service. "}, {"title": "Aquila Acquires Infinity Enterprise Lending Systems", "link": "https://velasoftwaregroup.com/aquila-acquires-infinity-enterprise-lending-systems/", "date": "8 September, 2021", "parent": null, "companyUrl": "https://www.aquilasw.com/", "company": "Infinity Enterprise Lending Systems", "companyFounded": "2000", "companyAbout": "About Infinity Software. Infinity Software builds world-class solutions for alternative credit lenders throughout North America. Its loan management system is exclusively designed for the short-term lending industry to help lenders create their own loan products, market and sell, support their customers and manage collections. For more information: www.infinitysoftware.com"}, {"title": "SOCOTEC UK selects Spectra QEST’s Platform", "link": "https://velasoftwaregroup.com/socotec-uk-selects-spectra-qests-platform/", "date": "6 October, 2021", "parent": "Spectra QEST", "company": "", "companyAbout": "About Spectra QEST. An operating company of Vela Software International, Inc., itself an operating group of Toronto-based Constellation Software, Inc. (CSI), Spectra QEST is a software development and services company specialising in solutions for the construction materials engineering, testing, inspection and production industries. Founded in 1984, Spectra QEST offers the most comprehensive construction materials quality platform on the market today. With offices in Adelaide, South Australia and Sacramento, California, it services customers in North America, Australasia, the Middle East and soon the United Kingdom. These customers include leading international construction companies, construction materials and geotechnical companies, construction materials manufacturers and government bodies. "}, {"title": "Topicus.com and CGG complete sale and transfer of GeoSoftware Business to Topicus.com and Vela Software", "link": "https://velasoftwaregroup.com/topicus-com-and-cgg-complete-sale-and-transfer-of-geosoftware-business-to-topicus-com-and-vela-software/", "date": "6 October, 2021", "parent": "Vela", "companyUrl": "mailto:christophe.barnini@cgg.com", "company": "GeoSoftware Business", "companyAbout": "About Topicus.com. Topicus.com Inc. is a leading pan-European provider of vertical market software and vertical market platforms to clients in public and private sector markets. Operating and investing in countries and markets across Europe with long-term growth potential, Topicus.com Inc. acquires, builds and manages leading software companies providing specialized, mission-critical and high-impact software solutions that address the particular needs of customers.For further information, contact: Topicus.com Inc. Jamal Baksh, Chief Financial OfficerTel: (416) 861-9677"}, {"title": "Aquila strengthens global media footprint through acquisition of Jaicom Oy", "link": "https://velasoftwaregroup.com/aquila-strengthens-global-media-footprint-through-acquisition-of-jaicom-oy/", "date": "8 November, 2021", "parent": null, "company": "Jaicom Oy", "companyFounded": "1999", "companyAbout": "About Jaicom. Jaicom provides customer management systems across the Nordics and rest of Europe. Hundreds of publications are currently using its comprehensive system Kayak to manage subscriptions and distribution. The company is headquartered in Finland and has operations in several European countries, including Sweden, UK and Germany. For more information: www.jaicom.com"}, {"title": "BIOSYSTEMES Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/biosystemes-acquired-by-fog-software-group/", "date": "7 December, 2021", "parent": null, "company": "BIOSYSTEMES", "companyAbout": "If you have any questions about this acquisition, or the capabilities of FIZZ by BIOSYSTEMES, please contact BIOSYSTEMES at information@biosystemes.com."}, {"title": "Fujitsu Glovia, Inc. Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/fujitsu-glovia-inc-acquired-by-fog-software-group/", "date": "8 December, 2021", "parent": null, "companyUrl": "http://www.glovia.com/", "company": "Fujitsu Glovia", "companyAbout": "About FOG Software Group. www.fogsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) and Constellation Software, Inc. [TSX: CSU] (www.csisoftware.com) which is a US$3.8 billion consolidated revenue software conglomerate headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "MCS Grupa acquired by Juniper Group", "link": "https://velasoftwaregroup.com/mcs-grupa-acquired-by-juniper-group/", "date": "3 January, 2022", "parent": null, "companyUrl": "https://juniper-group.com/", "company": "MCS Grupa", "companyAbout": "About MCS Grupa. Based in Zagreb, Croatia, MCS Grupa is one of the leading Croatian developers of healthcare information systems, having over 20 years of experience. MCS Grupa’s integrated product suite includes complex cloud solutions for healthcare and related activities, such as electronic ordering systems, advanced medical data analysis or decision-making support systems. Currently, MCS Grupa solutions are used by 2,000 primary healthcare teams, 600 specialized consultative healthcare teams and 70 polyclinics of various medical specialties. More info at https://mcs.hr/."}, {"title": "Datamine acquires Zyght HSE solution", "link": "https://velasoftwaregroup.com/datamine-acquires-zyght-hse-solution/", "date": "13 January, 2022", "parent": null, "company": "Zyght", "companyFounded": "2011", "companyAbout": "About Zyght. Zyght provides a comprehensive solution for environment, injury and risk management, safe work plans, document management, compliance, reporting and analytics. Our mission is to reduce workplace accidents, eliminate fatalities and protect the environment in industrial settings."}, {"title": "Reprise Software Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/reprise-software-acquired-by-fog-software-group/", "date": "14 January, 2022", "parent": null, "company": "Reprise Software", "companyAbout": "If you have any questions about this acquisition, or the capabilities of RLM, please contact Reprise Software at information@reprisesoftware.com."}, {"title": "CEI GROUP ACQUIRES PAULIN RESEARCH GROUP", "link": "https://velasoftwaregroup.com/cei-group-acquires-paulin-research-group/", "date": "25 January, 2022", "parent": null, "company": "Engineering Physics Services, Inc.,", "companyAbout": "About Paulin Research Group. In 1991, Mr. Paulin founded PRG to apply the latest FEA technology to the pressure vessel and piping industries. PRG has enjoyed a steady and stable growth and expanded its products and features through physical testing and sheer tenacity."}, {"title": "Verdazo Analytics acquired by Omnira Software", "link": "https://velasoftwaregroup.com/verdazo-analytics-inc-press-release-omnira-software/", "date": "15 February, 2022", "parent": null, "company": "Verdazo Analytics, Inc", "companyFounded": "2006", "companyAbout": "About Verdazo Analytics. Founded in 2006 as Visage Information Solutions and rebranded as Verdazo Analytics in 2016, the company continues to navigate the leading frontiers of analytics and help clients across industries make smarter, faster decisions by revealing the hidden insights in complex data."}, {"title": "Commerce Sync Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/commerce-sync-acquired-by-fog-software-group/", "date": "25 February, 2022", "parent": null, "companyUrl": "mailto:sscott@fogsoftwaregroup.com", "company": "Commerce Sync", "companyAbout": "About FOG Software GroupRosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software velasoftwaregroup.com and Constellation Software, Inc. [TSX: CSU] csisoftware.com. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries. For more information, visit fogsoftwaregroup.com."}, {"title": "CMS GlobalSoft Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/cms-globalsoft-acquired-by-fog-software-group/", "date": "2 March, 2022", "parent": null, "company": "CMS GlobalSoft", "companyAbout": "About FOG Software GroupRosemont, IL-based FOG Software Group is a division of Toronto-based Vela Software <velasoftwaregroup.com>. The companies acquire, manage, and build software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Aquila expands across lending vertical with acquisition of Tekambi", "link": "https://velasoftwaregroup.com/aquila-expands-across-lending-vertical-with-acquisition-of-tekambi/", "date": "2 March, 2022", "parent": null, "companyUrl": "mailto:rhyun@aquilasw.com", "company": "Lead Envy, LLC", "companyAbout": "About TekambiTekambi is a credit risk underwriting solution that enables lending portfolios the power to control any aspect of the lead purchasing process. Founded by a team of experienced technical leaders, its underwriting and decisioning modules simplify lead management for the lending industry. For more information: www.tekambi.com"}, {"title": "Vela acquires iSystain HSE Sustainability Reporting Platform", "link": "https://velasoftwaregroup.com/vela-acquires-isystain-hse-sustainability-reporting-platform/", "date": "2 March, 2022", "parent": "Vela", "company": "iSystain", "companyFounded": "2004", "companyAbout": "About iSystainiSystain is a cloud-based platform uniquely designed to support Health, Safety & Environment, Sustainability Reporting, Compliance & Governance and Social Investment reporting. iSystain is designed for seamless integration within organisations existing software ecosystems providing powerful analytics and reporting capabilities to streamline the production of sustainability and performance reporting.Our mission is to make great software that delivers a material improvement in the world through understanding and supporting our client’s needs and innovating to solve tomorrow’s challenges."}, {"title": "Vela acquires WeShine Tech (WST) University Exam Enterprise Resource Planning (ERP) Platform", "link": "https://velasoftwaregroup.com/vela-acquires-weshine-tech-wst-university-exam-enterprise-resource-planning-erp-platform/", "date": "13 April, 2022", "parent": "Vela", "company": "WeShine Tech", "companyFounded": "2011", "companyAbout": "About WeShine TechWeShine Tech has been providing ERP software to Indian universities since 2011. Its company’s innovative solutions help Higher education institutions manage all aspects of exams. This includes online recruitment tests, digitizing books for physical locations (where it is stored securely until day-of distribution) as well as allowing marking on digital records right through the process. This enables simplified processes in vast areas that have historically required manual intervention.WeShine Tech’s mission is to improve transparency, efficiency, and quality of evaluation and assessment processes in the education sector."}, {"title": "Vela Software Group announced that it has acquired BusinessCraft", "link": "https://velasoftwaregroup.com/vela-software-group-announced-that-it-has-acquired-businesscraft/", "date": "22 April, 2022", "parent": "Vela", "company": "BusinessCraft", "companyAbout": "About BusinessCraft“BusinessCraft is a tremendous team of individuals that due to their domain knowledge and close relationships with their clients have had great success in the market. All characteristics we value highly. We are excited to welcome them to the Vela Asia Pacific family and look forward to working closely with them to help strengthen their market position,” said Ian Whiting, CEO of Vela Asia Pacific. “We thank the past owner for establishing such a great business and wish them well in their next chapter and know that the employees of BusinessCraft have set high goals for themselves which we are happy to assist in”."}, {"title": "Vela Software Group acquires Geovariances", "link": "https://velasoftwaregroup.com/vela-software-group-acquires-geovariances/", "date": "2 June, 2022", "parent": "Vela", "company": "Geovariances", "companyFounded": "1986", "companyAbout": "About GeovariancesFounded in 1986, Geovariances is the premier provider of accessible advanced geostatistics to the natural resources industries. Geovariances’ solutions deliver clients exceptional reliability and scientific rigor thanks to an exclusive 30-year partnership with the Center of Geoscience of Mines ParisTech, the birthplace of Geostatistics."}, {"title": "Vela software  acquires Monitor", "link": "https://velasoftwaregroup.com/vela-software-acquires-monitor/", "date": "22 July, 2022", "parent": "Vela", "companyUrl": "http://www.monitor-mpower.com/about/about-monitor/", "company": "Monitor Management Control Systems Ltd.,", "companyAbout": "About AscertraAscertra is a software and services company that provides integrated information management software solutions, including Proarc Engineering Document Management software (EDMS) and Coreworx Interface Connect interface management software, that help their customers better design, construct, and operate complex assets. These solutions service a portfolio of projects valued at over $1 trillion across 40 countries, on more than 2,000 projects with 250,000+ users. Ascertra software enables EPCs, owner-operators, and contractors to automate best practices for compliance and quality, mitigate related business risk, and improve performance to budget throughout the entire project & asset life cycle."}, {"title": "Juniper Group Acquires IST Cruise Technology", "link": "https://velasoftwaregroup.com/juniper-group-acquires-ist-cruise-technology/", "date": "4 August, 2022", "parent": null, "companyUrl": "http://mailto:vanesa.espinosa@juniper-group.com/", "company": "IST acquisition, the trailblazing technology-company offering solutions for the online sale of cruises.  \n“The goal of our project is to grow based on the great success that Juniper and IST have achieved in the tourism industry. The acquisition of IST is part of our strategy to continue being the leading company in technological solutions for the travel industry, while adding to our product portfolio the technology and experience of a highly specialized team with know-how on the cruise industry and its needs. By incorporating IST to our vertical, all our clients will be able to benefit from more comprehensive multi-product solutions, with cruises being another differentiating element within our portfolio from now on. IST’s clients will be able to access dynamic distribution solutions for all the products offered by the Juniper and Cangooroo Booking Engines.” said Juan Mateos, General Manager of Juniper.\nBesides, Jaime Sastre, CEO of Juniper Group, added: “The acquisition of IST-Fibos", "companyAbout": "About Juniper, Since 2014, Juniper has been part of the Juniper Group. Since 2003, Juniper, a global travel technology company, has provided the best online solutions for the tourism industry (OTAs, DMCs, BedBanks, Airlines, and Wholesalers). Juniper offers flexible and modular Booking Engines (Juniper and Cangooroo Booking Engines) that can be adapted to the needs of each business. With over 360 XML integrations with external suppliers, Juniper has the broadest connectivity portfolio in the world. Also, it has more than 360 clients in 50 countries who already trust its technology and its commitment to quality and service, meeting their needs in an environment that is constantly changing and evolving. Juniper has a team of more than 280 professionals with experience in technology and travel, located at the Juniper headquarters in Palma (Spain), Cangooroo in São Paulo (Brazil), Miami (USA), Cali (Colombia) and Dubai (UAE). Juniper’s team is highly specialized and committed to providing the highest quality service to their Clients. Thanks to this, they have experienced great growth in the market in recent years. For more information, visit its website: www.ejuniper.com"}, {"title": "Airport Information Systems Acquired By Juniper Group", "link": "https://velasoftwaregroup.com/airport-information-systems-acquired-by-juniper-group/", "date": "4 August, 2022", "parent": null, "companyUrl": "http://mailto:vanesa.espinosa@juniper-group.com/", "company": "Airport Information Systems", "companyAbout": "About AIS: AIS is a leading supplier of Integrated Airport Management Systems, successfully providing solutions for 30 years. AIS products represent the very latest in airport management software and consist of a set of integrated modules to fully cater to an airport’s operational and data management needs."}, {"title": "Ricardo Software Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/ricardo-software-acquired-by-fog-software-group/", "date": "24 August, 2022", "parent": null, "companyUrl": "https://ricardo.com/", "company": "Ricardo Software from Ricardo plc", "companyAbout": "About FOG Software GroupFOG Software Group (www.fogsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) headquartered in Toronto, Canada. The operating group acquires, manages, and builds software companies in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Vela Software expands its presence in the Brazilian legaltech market with the acquisition of LDSOFT.", "link": "https://velasoftwaregroup.com/vela-software-expands-its-presence-in-the-brazilian-legaltech-market-with-the-acquisition-of-ldsoft/", "date": "8 September, 2022", "parent": "Vela", "company": "LDSOFT", "companyFounded": "1993", "companyAbout": "About LDSOFTFounded in 1993 LDSOFT is a pioneer in the intellectual property solutions space offering customers a robust solution with functionality across multiple use cases."}, {"title": "Vela Asia Pacific has today announced the acquisition of Accredo Business Software Limited", "link": "https://velasoftwaregroup.com/acquisition-of-accredo-business-software-limited/", "date": "8 September, 2022", "parent": "Vela", "companyUrl": "https://www.velasoftwaregroup.com.au/", "company": "Accredo Business Software Limited"}, {"title": "VELA INDUSTRIES GROUP ACQUIRES SCENARIO", "link": "https://velasoftwaregroup.com/vela-industries-group-acquires-scenario/", "date": "13 October, 2022", "parent": "Vela", "company": "Scenario", "companyAbout": "About ScenarioScenario is an Enterprise SaaS platform providing Project Delivery and Project Controls solutions for mining, property development, energy, infrastructure and construction projects. Scenario has the ability to scale from a portfolio of major projects, to complex mega projects all with varying requirements and needs."}, {"title": "Juniper Group acquires Insite", "link": "https://velasoftwaregroup.com/juniper-group-acquires-insite/", "date": "25 October, 2022", "parent": null, "companyUrl": "http://www.insite.hr/new", "company": "Insite", "companyAbout": "About Halcom: Halcom, a leading business unit of Juniper Group in the payment and banking verticals, has played a pioneering role in the field of developing payment systems in Central and South-East Europe for over 30 years. With two continents, 7 markets, more than 50 banks, 2 central banks and clearing houses and more than 570.000 issued digital certificates, Halcom ranks among the top providers of innovative and secure payment and financial services. More info at www.halcom.com."}, {"title": "acQuire announces acquisition of Managing Transformation Solutions (MTS)", "link": "https://velasoftwaregroup.com/acquire-announces-acquisition-of-managing-transformation-solutions-mts/", "date": "31 October, 2022", "parent": null, "companyUrl": "http://www.acquire.com.au", "company": "MTS", "companyAbout": "About MTSManaging Transformation Solutions (MTS) is a services and software business that has been at the forefront of social sustainability in the mining industry since 2009. It develops people-centred technology solutions to help clients develop and implement long-term social performance strategies that meet regulatory requirements and deliver shared value to internal and external stakeholders. MTS is based in Johannesburg, South Africa, and has expanded its services to a variety of industries, including civil engineering and construction.Meesha StackerEmail: m.stacker@acquire.com.auWebsite: www.acquire.com.au"}, {"title": "Juniper Group Acquires Libusoft Cicom", "link": "https://velasoftwaregroup.com/juniper-group-acquires-libusoft-cicom/", "date": "5 December, 2022", "parent": null, "companyUrl": "mailto:vanesa.espinosa@juniper-group.com", "company": "Libusoft Cicom", "companyAbout": "About IN2 Group: Over its 30-year existence, IN2 Group has been developing software solutions for a variety of industrial verticals, gaining valuable experience in solutions design and implementation through cooperation with clients from virtually all business branches. The Group’s operations span across five countries of our region, with more than 300 clients, and a strong focus on supporting businesses and organisations operating in the economy, finance, insurance, and healthcare sectors, as well as the public sector. IN2 Group is an operating group of Juniper Group. More info at https://in2.hr/en/"}, {"title": "SHOPLOGIX ACQUIRES PROXIA, BUILDS ON INDUSTRY 4.0 SOLUTION PORTFOLIO", "link": "https://velasoftwaregroup.com/shoplogix-acquires-proxia-builds-on-industry-4-0-solution-portfolio/", "date": "7 December, 2022", "parent": null, "companyUrl": "valerie@shoplogix.com", "company": "PROXIA Software AG", "companyAbout": "About ShoplogixShoplogix (www.shoplogix.com) is a division of Fog Software Group (FOG). Founded in 2002, Shoplogix is a leader in the industrial internet of things (IIoT) and smart factory software industry through its IIoT and cloud-based platform, providing manufacturers with real-time data presented in user-friendly visual dashboards, innovative features and opportunities for continuous growth."}, {"title": "ICS Acquired by FOG Software Group", "link": "https://velasoftwaregroup.com/ics-acquired-by-fog-software-group/", "date": "12 December, 2022", "parent": null, "company": "ICS", "companyAbout": "About FOG Software GroupFOG Software Group (www.FOGsoftwaregroup.com) is an operating group of Vela Software (www.velasoftwaregroup.com) headquartered in Toronto, Canada. The operating group acquires, manages, and builds in a variety of vertical markets. By helping their acquired companies improve operations, grow through organic initiatives, and seek additional acquisitions that can strengthen their market position, their portfolio companies become clear leaders in their industries."}, {"title": "Juniper Group acquires SysArc Infomatix", "link": "https://velasoftwaregroup.com/juniper-group-acquires-sysarc-infomatix/", "date": "3 January, 2023", "parent": null, "companyUrl": "mailto:vanesa.espinosa@juniper-group.com", "company": "SysArc Infomatix", "companyAbout": "About TSI: Having pioneered several products at Fortune 500 companies, TSI has three-decade experience and expertise across several verticals, with the Airline and FinTech industries at the front, facilitating and delivering transformational results for a demanding new digital world. More info at www.tpfsoftware.com.About Juniper Group: Juniper Group, an operating group of Vela Software and Constellation Software, Inc. [TSX:CSU], is a fast-growing global software conglomerate with operations in several verticals, mainly: travel, aviation, banking & payments, insurance, public sector, and oil & gas. Juniper Group, currently comprised of over 1,500+ employees all over the world, invests in and partners with vertical market software businesses permanently. More info at www.juniper-group.com.For media enquiries, please contact:Vanesa Espinosavanesa.espinosa@juniper-group.comVP Governance & Organization"}]