[{"title": "Jonas Software Acquires Huntington Business Systems (“HBS”)", "link": "https://jonassoftware.com/jonas-acquires-hbs", "date": "2022-11-27T00:00:00", "parent": "Jonas Software", "companyUrl": "http://www.hbscorp.com", "company": "Huntington Business Systems", "companyFounded": "1992", "companyAbout": "HBS has been operating as the leading Time and Attendance Management Software solution for over 25 years. The custom-built software solutions for clients range from 50 employees to more than 250,000 employees in several major industries. HBS’s software, Ecotime®, is designed to seamlessly integrate with an organization’s payroll, human resources, or accounting system."}, {"title": "Vesta Software Group Acquires Qwantec Ingenieria Limitada (“Qwantec”)", "link": "https://jonassoftware.com/vesta-acquires-qwantec", "date": "2022-11-21T00:00:00", "parent": "Vesta Software Group", "companyUrl": "https://www.qwantec.com/", "company": "Qwantec", "companyFounded": "over 14 years ago", "companyAbout": "Qwantec is a market leading company in technological solutions for personnel management and attendance control in Chile and Peru. They have more than 14 years of experience optimizing the processes for more than 8,000 clients"}, {"title": "Jonas Software Acquires VetlinkPRO", "link": "https://jonassoftware.com/jonas-software-acquires-vetlinkpro", "date": "2022-11-17T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.vetlinkpro.com/", "company": "VetlinkPRO", "companyFounded": "1989", "companyAbout": "VetlinkPRO was founded in 1989 and has 30+ years in the industry and is established in over 300 veterinarian practices. VetlinkPRO has easy to use applications to meet all Veterinarian Practices needs from appointment booking through to telemedicine and laboratory management. VetlinkPRO’s office is located in Auckland, New Zealand and primarily services the Asia Pacific region."}, {"title": "Vesta Software Group Acquires Datalogic Software", "link": "https://jonassoftware.com/vesta-software-group-acquires-datalogic-ingenieros-s-r-l-datalogic-software", "date": "2022-11-02T00:00:00", "parent": "Vesta Software Group", "companyUrl": "https://datalogic.com.uy/", "company": "Datalogic Software", "companyFounded": "1987", "companyAbout": "Datalogic Software has been providing its solutions and services in software development and technological outsourcing since 1987. The company’s comprehensive suite of products covers everything from ERP to human resources and payroll, offering modern and effective solutions for medium and large-sized companies.Jonas Software operates over 120+ independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 40+ vertical markets."}, {"title": "Jonas Software Acquires Vizergy Digital Marketing", "link": "https://jonassoftware.com/jonas-software-acquires-vizergy-digital-marketing", "date": "2022-09-26T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.vizergy.com/", "company": "Vizergy Digital Marketing", "companyFounded": "1999", "companyAbout": "  For nearly 25 years, Vizergy has served the hospitality industry with leading marketing technologies, knowledgeable talent, and leverage a data first approach to marketing for clients worldwide. The company deploys complete travel life-cycle marketing solutions from conversion-optimized website design to award-winning digital marketing programs, reservation solutions, media planning, and execution. Vizergy’s platform is easy to use, turnkey, and SMART — and is continually enhanced with tools to help hotels compete and maximize revenue. At Vizergy, hospitality marketing is not only the mission—it’s the sole focus. For more information, visit Vizergy.com.  "}, {"title": "Jonas Software Acquires Brainbase", "link": "https://jonassoftware.com/jonas-software-acquires-brainbase", "date": "2022-09-16T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.brainbase.com/", "company": "Brainbase", "companyAbout": "Brainbase is a modern, end-to-end licensing management platform that brings together the features required to run a global licensing business at scale, enabling your team to make smarter, faster decisions. The company is headquartered in Los Angeles, California."}, {"title": "Jonas Software Acquires Uniworks Meat Processing Solutions", "link": "https://jonassoftware.com/jonas-software-acquires-uniworks-meat-processing-solutions", "date": "2022-09-15T00:00:00", "parent": "Jonas Software", "companyUrl": "http://mccarthy.co.nz/", "company": "Kevin McCarthy & Associates Limited", "companyAbout": "McCarthys’ Uniworks product provides industry specific software solutions that are fully customizable to meet  the high and complex demands of core meat processing functions. McCarthys was founded in the late 80s, as the sole supplier of software solutions in New Zealand throughout the modernization of the industry. Since then, McCarthys has continued to refine their products to enable the complete management of plant processing operations. The Uniworks solutions are designed to enhance product traceability and allows processors to stand behind their integrity and safety with confidence. From the farm gate to retailer, you can trust us McCarthys to support your business operations and growth."}, {"title": "Jonas Software Acquires Halo Leisure Enterprise Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-halo-leisure-enterprise-ltd", "date": "2022-08-11T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.maxyourassets.com/", "company": "Halo Leisure Enterprise Limited", "companyAbout": "WAM software is an interactive solution for asset management, maintenance scheduling and defect reporting for organisations who acknowledge that assets are their business."}, {"title": "Jonas Software Acquires Infoscience Limited", "link": "https://jonassoftware.com/jonas-software-acquires-infoscience", "date": "2022-06-08T00:00:00", "parent": "Jonas Software", "companyUrl": "https://infoscience.ie/", "company": "Infoscience (Software) Limited", "companyAbout": "Infoscience works with auctioneers & livestock marketeers to provide a back-office software solutions called ICE Auctions since it was founded in 1987. ICE Auction is a fully integrated auction management system for the livestock mart industry. It has evolved over almost thirty years of change and development in the Irish Livestock market and has grown to become the preferred system among Irish Mart owners, which is why the majority of the Irish livestock industry use their software."}, {"title": "Jonas Software Acquires CompuMove Systems Corporation", "link": "https://jonassoftware.com/jonas-software-acquires-compumove-systems-corporation", "date": "2022-04-04T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.compumove.com/", "company": "CompuMove Systems Corporation", "companyAbout": "CompuMove’s powerful move management software seamlessly brings together all of the different aspects of a moving company’s operation into one fully integrated system including a complete general ledger accounting system. CompuMove continues its leadership, providing leading-edge information management systems exclusively for the moving and storage industry.Jonas Software operates over 120 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "medQ Inc. Acquisition Sharpens Jonas Software Focus on Healthcare", "link": "https://jonassoftware.com/medq-acquisition-sharpens-jonas-software-focus-on-healthcare", "date": "2022-03-31T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.medq.com/", "company": "medQ Inc", "companyFounded": "1996", "companyAbout": "medQ was founded in 1996 and has built an enviable industry reputation providing tailored solutions for our Diagnostic Imaging customers’ specific needs. “We thrive on understanding each of our customers’ unique challenges, and then working with them to deliver an integrated solution that enables them to provide high quality and cost-effective patient care”, says John Norman, CEO of medQ.medQ provides highly configurable and customizable imaging workflow software, providing imaging practices with automated front office, technologist, and radiology reporting workflow solutions for more than 25 years. Today, medQ provides hundreds of imaging teams with custom, automated workflows that fit their exact clinical needs, and have a positive impact on patient care."}, {"title": "Jonas Software Acquires Power2SMS Limited", "link": "https://jonassoftware.com/jonas-software-acquires-power2sms-limited", "date": "2022-03-25T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.wearepower2.com/", "company": "Power2SMS Limited", "companyAbout": "Power2SMS Limited is a platform of communication solutions that works with businesses to enhance their customer service through SMS, WhatsApp, Facebook Messenger, voice, and much more. Power2 allows businesses to connect and engage with their customers at scale using automation technology to create an efficient workflow, sending personalized messages in bulk."}, {"title": "Jonas Software Acquires LilYPad POS", "link": "https://jonassoftware.com/jonas-software-acquires-lilypad-pos", "date": "2022-03-22T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.lilypadpos.com/", "company": "LilYPad POS", "companyFounded": "2010", "companyAbout": "Founded in 2010, LilYPad provides a web-based point of sale software to family entertainment centers (FEC). It is a rich POS system that is simple and easy to use, yet provides all features and access to the information required to efficiently run an FEC. Some features include sales processing, event management, customer and membership management, online booking, electronic ticketing, employee management, etc."}, {"title": "Jonas Software Acquires RBRO Solutions Inc. to Expand Global Legal iManage Functional Practice", "link": "https://jonassoftware.com/jonas-software-acquires-rbro-solutions", "date": "2022-03-11T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.rbrosolutions.com/", "company": "RBRO Solutions Inc", "companyFounded": "2003", "companyAbout": "A leading web-based document and email management provider for the legal and financial industries, RBRO serves professional firms looking for secure file collaboration, knowledge management, and information governance solutions. RBRO was founded in 2003 and is a premier iManage partner that provides full-stack solutions ranging from consulting services and iManage integration functionality."}, {"title": "Jonas Software Acquires Lean Industries", "link": "https://jonassoftware.com/jonas-software-acquires-lean-industries", "date": "2022-01-04T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Lean Industries", "companyFounded": "2005", "companyAbout": "Lean Industries is focused exclusively on delivering solutions for disputed consumer-originated financial transactions, in both the card and non-card payments space, for both fraud and non-fraud disputes. Lean provides their AdjustmentHub and NetworkHub software products and implementation services to large financial services companies across the United States and Europe, with dispute resolution workflows spanning debit, credit, and prepaid card payment transactions. Their software products result in a highly efficient and automated back office operational structure, with commensurate cost savings and productivity improvements.Jonas Software operates over 110 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Reaches Agreement with Capita plc to Purchase AMT Sybex", "link": "https://jonassoftware.com/jonas-software-reaches-agreement-with-capita-plc-to-purchase-amt-sybex", "date": "2021-12-24T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.capita.com/", "company": "AMT Sybex", "companyAbout": "Capita is a consulting, transformation and digital services business. Every day our 55,000 colleagues help millions of people, by delivering innovative solutions to transform and simplify the connections between government and citizens, businesses and customers. We partner with our clients and provide the insight and cutting-edge technologies that give time back, allowing them to focus on what they do best and making people’s lives easier and simpler. We operate across three divisions – Capita Public Service, Capita Experience and Capita Portfolio – in the UK, Europe, India and South Africa. Capita is quoted on the London Stock Exchange (CPI.L). Further information can be found at: http://www.capita.comAMT Sybex is the leading provider of critical utilities and infrastructure software in the UK. Clients rely on its software for the daily operation of the country’s utilities market, facilitating the balance of demand and supply and ensuring the markets run efficiently and reliably. AMT Sybex’s software is used to manage data flows for more than 35 million electricity and gas meter points, with around two million records processed per day.Jonas Computing (UK) Limited is part of the Jonas Software operating group, which contains a diverse collective of over 100 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders within their respective markets."}, {"title": "Jonas Software Expands in Hospitality Vertical with Acquisition of Seekom Limited", "link": "https://jonassoftware.com/jonas-software-acquires-seekom-limited", "date": "2021-12-22T00:00:00", "parent": "Jonas Software", "companyUrl": "https://web.seekom.com/", "company": "Seekom Limited", "companyFounded": "2002", "companyAbout": "Founded in Wellington, New Zealand in 2002, Seekom has forged a frontrunning property management system which includes website booking screens, sales channel manager, secure credit card storage, and payment processing. Seekom is fully cloud-based, providing a secure platform to operate and manage all bookings, rates, and revenue from any Wi-Fi-connected device. At the helm of Seekom is Simon Casey, Founder & CEO, “We are happy Seekom will maintain its brand and autonomy with coaching and best practices from Jonas. We look forward to being part of the Jonas family of companies and keeping with their philosophy of acquiring, strengthening, and growing vertical market software companies”."}, {"title": "Vesta Software Group, a subsidiary of Jonas Software, Announces Acquisition of GeneXus Consulting (GXC S.A.) & K2B (Magalink S.A.)", "link": "https://jonassoftware.com/vesta-software-group-jonas-announces-acquisition-of-genexus-consulting-k2b-magalink-sa", "date": "2021-10-18T00:00:00", "parent": "Vesta Software Group", "companyUrl": "https://k2b.com/", "company": "GeneXus Consulting (GXC S.A.) & K2B (Magalink S.A.),", "companyFounded": "1992", "companyAbout": "GeneXus Consulting is the company that provides services to assist organizations achieve their business objectives through the proper use and implementation of GeneXus technology. K2B is a Government & Private Sector ERP solution, allowing every organization and industry to automate the administrative, accounting, budgeting and financial management of the organization from an integral vision. K2B is comprised of ERP/Government Resource Planning systems running large government departments and Private sector businesses."}, {"title": "Jonas Software Acquires the Intellectual Property of MySkillChart", "link": "https://jonassoftware.com/jonas-software-acquires-intellectual-property-of-myskillchart", "date": "2021-09-21T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.myskillchart.com/", "company": "MySkillChart.com LLC and Stars and Stripes Management Systems, LLC", "companyAbout": "Founded in 2014, MySkillChart has evolved into a class management platform that is used by thousands of families, instructors, students, and hundreds of organizations across the United States and Canada. MySkillChart’s mission is to finally bring to coaches, teachers, and instructors a real solution to the ongoing problem of student progress tracking. By providing a forum to track, communicate, and view progress, we are confident that student retention and results will significantly increase in all who partake in the project.Jonas Software operates over 110 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Announces Acquisition of Newline ASP", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-newline", "date": "2021-09-07T00:00:00", "parent": "Jonas Software", "companyUrl": "http://newlineasp.com/", "company": "Newline ASP partnership", "companyFounded": "1983", "companyAbout": "Newline ASP works with auctioneers, chartered surveyors, estate agents & livestock marketeers in both hemispheres and has provided back-office software solutions since 1983. A second-generation firm with family values at its core; Newline ASP blends continual R&D with best in class support. In excess of 150 auction firms (that’s more than 200 auction centres) use the software, including over 85% of UK livestock markets, almost 50% of marts in Ireland, 90% of Sale Yards in New Zealand & in leading markets in Canada. Jonas Software operates over 110 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Announces Acquisition of WM-data Deutschland GmbH", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-wm-data-deutschland", "date": "2021-06-30T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "WM-data Deutschland GmbH", "companyFounded": "1991", "companyAbout": "In 1991 WM-data Deutschland GmbH was found from IT department of Feldmühle AG during some outsourcings. Looking back on more than 30 years of practical experience in programming solutions for the paper industry, WM-data has excellent know-how in processes, analysis and development. With specific skills and experience which is built up over a long time, WM-data’s customers increase their value creation in a sustainable and efficient way. These solutions lead to greater competitiveness and superior results.Jonas Software operates over 110 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Constellation Software Completes Agreement with Fair Isaac Corporation to Purchase Its Collection and Recovery Business", "link": "https://jonassoftware.com/constellation-software-completes-agreement-with-fico", "date": "2021-06-08T00:00:00", "parent": "Constellation Software", "companyUrl": "mailto:greg.jawski@porternovelli.com", "company": "", "companyFounded": "1956", "companyAbout": "FICO (NYSE: FICO) powers decisions that help people and businesses around the world prosper. Founded in 1956 and based in Silicon Valley, the company is a pioneer in the use of predictive analytics and data science to improve operational decisions. FICO holds more than 195 US and foreign patents on technologies that increase profitability, customer satisfaction and growth for businesses in financial services, telecommunications, health care, retail and many other industries. Using FICO solutions, businesses in more than 100 countries do everything from protecting 2.6 billion payment cards from fraud, to helping people get credit, to ensuring that millions of airplanes and rental cars are in the right place at the right time.FICO is a registered trademark of Fair Isaac Corporation in the US and other countries.Learn more at https://www.fico.com.For further information, contact:Greg Jawski for FICOEmail: greg.jawski@porternovelli.comPhone: +1 212-601-8248"}, {"title": "Jonas Software Announces Acquisition of Dynamiq Pty Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-dynamiq-pty-ltd", "date": "2021-05-06T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Dynamiq Pty Ltd", "companyFounded": "2005", "companyAbout": "Founded in 2005, Dynamiq is an industry leader in creating a safe and resilient world. The experience, insights, and quality services provided ensure that our clients are prepared for any interruptions and crises the business may face. Dynamiq services help businesses improve their preparedness to respond to business interruptions and overcome the challenges these interruptions present. Organizations choose to work with Dynamiq to access expert support and advice in Crisis and Emergency Management, Business Continuity Planning, Strategic Security and Emergency Response Planning – all underpinned by the fast, effective, and secure Business Resilience Communication Solution, EMQnet.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Acquires Invotech Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-invotech", "date": "2021-04-08T00:00:00", "parent": "Jonas Software", "companyUrl": "https://invotech.ie/", "company": "Invotech Ltd", "companyFounded": "1999", "companyAbout": "As the leading supplier of leisure management software systems, Invotech is revolutionizing the leisure industry in Ireland. Our portfolio of products includes options suitable for small dry gyms and personal training studios right up to large multi-site facilities with both pay-as-you-go and membership options. Our products are cleverly designed to be scalable, so you only pay for the functionality you use allowing you to grow your systems in line with your business. Based in Dublin, we are very proud of our Irish roots and the fact that we provide a local and friendly service.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Acquires Omniterm Data Technology Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-omniterm", "date": "2021-04-07T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.omniterm.com/", "company": "Omniterm Data Technology Ltd", "companyAbout": "Omniterm has been the pioneer in the North American theatre industry in creating a POS system solution for multiplex theatres, starting with Cineplex’s first multiplex theatre at the Toronto Eaton Centre in the 1970’s.  Today it continues to develop and produce innovative hardware and software solutions for the entertainment industry and serves 1000s of screens around the world. Omniterm’s engineering-driven approach to the business delivers an astoundingly stable, user-friendly POS and online platform with robust reporting and data insights to cinema owners and managers.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Completes Acquisition of UniOne", "link": "https://jonassoftware.com/jonas-software-completes-acquisition-of-unione", "date": "2021-03-22T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.unione.com.au/", "company": "UniOne", "companyAbout": "An Australian software company that provides student activity management for universities. The functionality of the platform includes student clubs & sports, managing memberships/club purchases, case management, inventory management, point of sale (online/in-store for University merchandise), time tracking and more.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Enters New Geography with Acquisition of Easit AB", "link": "https://jonassoftware.com/acquisition-of-easit", "date": "2021-02-26T00:00:00", "parent": "Jonas Software", "companyUrl": "https://zephyrnet.com/top-rated-online-casinos/", "company": "Easit AB", "companyAbout": "Easit AB is a Swedish software company that provides case management, data management software and consulting services to businesses in both the private and public sectors.And also, taking into account the latest news about the virus, we strongly advise you to find a new way to make money to have more opportunities. People were fired en masse, enterprises were closed, but they found a way out. We analyzed the market and found the best solution, you can read more detail here in order to understand how people earn even more by playing in various casinos and constantly make a profit.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Acquires C-SAM Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-c-sam-ltd", "date": "2021-02-05T00:00:00", "parent": "Jonas Software", "companyUrl": "https://c-sam.co.uk/", "company": "C-SAM Ltd", "companyAbout": "C-SAM is a leading solutions provider to the oil and gas; subsea and maritime, and related industries. Additionally, their products and services have been successfully introduced to a wide range of other business sectors that rely upon equipment/asset management as a critical factor of operational success. Their specialist asset management software (OPS™) allows all businesses ‐ from fresh start-ups to blue-chip global concerns ‐ to track, trace and control their assets, supply chain and people.C-SAM have over 20+ years’ experience in the North Sea and UK Continental Shelf oil and gas sector, and work with global clients across Europe, Asia, Australasia and the Americas.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30+ vertical markets."}, {"title": "Jonas Software Acquires Bluestar Software Limited", "link": "https://jonassoftware.com/jonas-software-acquires-bluestar-software-limited", "date": "2021-01-06T00:00:00", "parent": "Jonas Software", "companyUrl": "https://bluestar-software.co.uk/", "company": "Bluestar Software Limited", "companyAbout": "Bluestar is a leading solutions provider to Police Forces and related agencies, delivering software meeting a variety of operational requirements. The product range encompasses systems deployed to thousands of users along with specialist applications designed for departmental use by expert personnel. The software is used for briefing, tasking, intelligence analysis, mapping, incident recording, planning, identity management, forensic casework, criminal profiling, management information, image/data storage and much more.Jonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 30 vertical markets."}, {"title": "Jonas Software Acquires RewardOps", "link": "https://jonassoftware.com/jonas-software-acquires-rewardops", "date": "2020-12-16T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.linkedin.com/company/rewardops/?viewAsMember=true", "company": "RewardOps", "companyAbout": "An engagement commerce platform creating positive disruption in the rewards space. RewardOps’ cloud-hosted infrastructure, SaaS approach and agile methodology sets it apart from other companies in the loyalty industry. Using RewardOps’ API-based software, forward-thinking companies in the loyalty industry can easily build, track and streamline their rewards programs. With one simple integration, RewardOps’ partners can access millions of products from a continuously growing marketplace of exciting reward suppliers for new and deepening levels of engagement. For more information, please visit www.rewardops.com.  Follow them on Twitter or LinkedInJonas Software operates over 100 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 25 vertical markets."}, {"title": "Jonas Software Acquires InfoMax Technologies", "link": "https://jonassoftware.com/jonas-software-acquires-infomax-technologies", "date": "2020-11-02T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.infomaxcorp.com/", "company": "InfoMax Technologies", "companyAbout": "InfoMax has developed a robust and proprietary business process & workflow automation solution platform, to facilitate the use of Anoto digital pen & paper technology and web forms on a tablet. These solutions have been sold to pharmacies within the Canadian long-term care sector and Canadian municipal government.For over 22 years, InfoMax has been helping long term care homes and their supporting pharmacies to achieve greater efficiencies, accuracy and reliability enabling the front-line professionals to spend less time on dealing with technology and more focus on resident care, while streamlining the pharmacy operation.Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 25 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Ineo, LLC", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-ineo", "date": "2020-09-23T00:00:00", "parent": "Jonas Software", "company": "Ineo", "companyAbout": "Founded in 2003, Ineo is the global mobility industry’s premier technology, tax, and financial services company and the industry’s most trusted knowledge source. Ineo Mobility was the first to bring deep tax and technology expertise to the business of Mobility services. Today, they continue to lead the increasingly complex industry with customized solutions to meet each client’s specific challenges.KeyBanc Capital Markets Inc. is a leading corporate and investment bank providing capital markets and advisory solutions to dynamic companies capitalizing on opportunities in changing industries. Our deep Technology industry expertise, advisory capabilities and unique ideas are seamlessly delivered to companies across the Software, IT Services and Infrastructure sectors.  KeyBanc’s HR Tech practice has a strong track record of successfully advising companies with over 15 M&A transactions and over 25 Capital Markets transactions completed within the last several years.Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 25 vertical markets."}, {"title": "Jonas Software Acquires Contronics Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-contronics-ltd", "date": "2020-04-02T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.contronics.co.uk/", "company": "Contronics Ltd", "companyAbout": "Contronics Ltd. is a leading provider of laboratory monitoring system products and software, calibration and temperature mapping services to NHS, healthcare and life science organisations. For over 25 years it has continued to deliver outstanding product reliability and unrivalled service standards.Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 25 vertical markets."}, {"title": "Jonas Software Acquires the Intellectual Property of QuickQube", "link": "https://jonassoftware.com/jonas-software-acquires-quickqube", "date": "2020-02-13T00:00:00", "parent": "Jonas Software", "company": "Solutions On The Go, LLC", "companyAbout": "QuickQube is an automated sales process system designed for office and industrial moving salesperson. The program collects, calculates, stores, and manages all the information needed to generate a commercial move estimate, proposal, move plan and work orders. QuickQube will eliminate costly math errors, increase your closing ratio, and give you more time to spend prospecting for new clients and nurturing your existing clients. Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Acquires Club Caddie Inc.", "link": "https://jonassoftware.com/jonas-software-acquires-club-caddie-inc", "date": "2020-02-10T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Club Caddie Inc", "companyAbout": "Club Caddie was founded by enterprising Golf Course operators as an answer to their needs to manage all of the challenges of running profitable golf operations in today’s market.  Based in Detroit Michigan- with over 5 years of experience serving golf clubs across the United States they offer an All-in-One, cloud-based SaaS software product. Club Caddie’s comprehensive core system allows users to manage all aspects of their properties from golf operations with integrated Point-of-sale, Tee-Sheet and food/beverage operations. With customers in over 10 states and a growing number of courses under contract every day,  Club Caddie’s award-winning technology is well-positioned to help golf course operators run a better business.Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, golf, fitness, membership, attractions, hospitality, retail, medical, education, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires Pulse Club Computers", "link": "https://jonassoftware.com/jonas-software-acquires-pulse-club-computers", "date": "2020-02-06T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.pulseclub.com.au/", "company": "Pulse Club Computers", "companyAbout": "Pulse Club has been developing club management software for 22+ years. Founder Mike Hanlon identified the need for a fast, robust and powerful range of applications that manage employees, financials, liquor and food stock controls, ticketing, and more. Newcastle-based Pulse Club has grown to become the leading provider to the Australian golf and club industry. Pulse is currently installed in more than 100 clubs across Australia. Pulse Club has a dedicated team of professionals helping venues thrive.Jonas Software operates over 95 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Acquires Automated Integration", "link": "https://jonassoftware.com/jonas-software-acquires-automated-integration", "date": "2019-12-04T00:00:00", "parent": "Jonas Software", "companyUrl": "http://www.automatedintegration.com/", "company": "Automated Integration", "companyFounded": "1993", "companyAbout": "Automated Integration is a fully integrated, enterprise resource planning software solution dedicated to enhancing the day to day operations of various sized service businesses. Operating in more than 8 different industries, the software is an all-in-one solution that combines sales/marketing, service operations management, scheduling optimization, accounting, and more with intuitive loyalty.Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires Retail & Sports Systems", "link": "https://jonassoftware.com/jonas-software-acquires-retail-sports-systems", "date": "2019-12-03T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.retailsportssystems.co.uk/", "company": "Retail & Sports Systems", "companyAbout": "R&SS offers a true Omni-channel solution from a single supplier you can trust — allowing professional sports businesses to get closer to their customers and drive outstanding sales growth. Their results speak for themselves: one Premiership club doubled their online orders since they installed the R&SS retail system. They continue to add new customers whilst existing customers continue to renew their contracts year over year.Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires Motion Software", "link": "https://jonassoftware.com/jonas-software-acquires-motion-software", "date": "2019-11-30T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.motionsoftware.co.uk/", "company": "Motion Software", "companyAbout": "Motion Software is a provider of industry-leading software for workforce mobilisation in the areas of inspection, compliance and field service, which is utilised in over 40 disciplines with over 100 customers.  It is a key supplier to blue-chip companies and large corporates across a range of sectors such as insurance, engineering, oil & gas, renewables and utilities.Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires ProviderSoft LLC", "link": "https://jonassoftware.com/jonas-software-acquires-providersoft-llc", "date": "2019-11-22T00:00:00", "parent": "Jonas Software", "companyUrl": "https://providersoftllc.com/", "company": "ProviderSoft LLC", "companyAbout": "ProviderSoft is a New Jersey-based company with over 10 years of experience serving childhood development agencies and providers across the United States by helping them operate efficiently and effectively. ProviderSoft’s comprehensive core system allows users to monitor all aspects of their business ensuring regulatory compliance, securely maintaining patient data, ensuring proper billing/reimbursements, and optimizing provider utilization.  ProviderSoft delivers its products in a cloud-based Software-as-a-Service (SaaS) model, requiring minimal technology infrastructure for the agency while allowing individual providers to interact with systems in a geographically flexible manner, in family homes, at schools, or wherever their work needs dictate.  Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, fitness, membership, attractions, hospitality, retail, medical, education, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires Impos Solutions International Pty Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-impos-solutions-international-pty-ltd", "date": "2019-11-12T00:00:00", "parent": "Jonas Software", "companyUrl": "https://impos.com.au/", "company": "Impos Solutions International Pty Ltd", "companyFounded": "October 2005", "companyAbout": "Impos Solutions International Pty Ltd has been developing point of sale systems since October 2005. Founder Sean O’Meara identified the need for a fast, robust and powerful POS system that initially addressed the needs of the fast-growing nightclub scene. In the past decade, Melbourne-based Impos has grown to become the leading POS provider to the Australian hospitality industry. Impos is currently installed in more than 2,700 hospitality venues across Australia, New Zealand and the Pacific Islands. With offices in all major Australian capital cities, Impos has a dedicated team of professionals helping venues thrive. Twenty-three of Australia’s Top 100 Restaurants, 50% of award-winning bars, industry-leading cafes and a number of wineries choose Impos’ point of sale system to help manage their busy venues.Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Acquires Critical Impact Software, Inc.", "link": "https://jonassoftware.com/jonas-software-acquires-critical-impact-software-inc", "date": "2019-11-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Critical Impact Software, Inc", "companyAbout": "Critical Impact is a Virginia-based company with over 10 years of experience providing email marketing software for progressive highly communicative businesses. The business primarily serves the association, travel, financial services publishing and non-profit sectors. Critical Impact’s e-marketing tools help to deliver rich, dynamic newsletters, automated marketing campaigns, SMS messages and surveys that provide the impact modern marketers are looking for.Jonas Software operates over 90 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, fitness, membership, attractions, hospitality, retail, medical, education and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in over 20 vertical markets."}, {"title": "Jonas Software Acquires Pacsoft International Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-marina-management-experts-pacsoft-international-ltd", "date": "2019-10-01T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.pacsoftmms.com/", "company": "Pacsoft International Ltd", "companyAbout": "Pacsoft is a New Zealand-based company with 20 years of experience providing software for marinas, boatyards and shipyards. Marine businesses in more than 20 countries use its one-stop shop marina management software to run all aspects of their business. The PacsoftNG platform is designed to save businesses time and money by automating and integrating daily tasks and helping marinas, boatyards and shipyards to serve customers while maintaining tight control over business processes.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Uniware Systems Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-uniware-systems-ltd", "date": "2019-08-30T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Uniware Systems Ltd", "companyAbout": "Uniware is committed to providing advanced, proven, powerful EPoS systems in the hospitality and retail sectors. With over 25 years of experience, Uniware offers smarter EPoS, faster payments, and intuitive loyalty. Uniware has no borders and now services clients worldwide in locations such as the UK, Ireland, Cyprus, Holland and Malaysia.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Acquires GuestVision Technology Solutions", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-guestvision-technology-solutions", "date": "2019-08-23T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "GuestVision Technology Solutions", "companyAbout": "GuestVision Software was released into the marketplace, initially to the walk-in beauty salon chain market. Today, GuestVision is one of a few salon software packages flexible enough to span the breadth of the beauty industry with a focus on multi-national enterprises across cosmetology schools, salons, and barbershops. Today GuestVision offers not only software solutions but hardware, support, and consulting for an all-in-one stop for technology needs. GuestVision promises to continue providing innovation, exceptional service, and new technology to assist clients in all of their endeavours.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the salon/spa, fitness, membership, hospitality, and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of ITWERCS Point of Sale", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-itwercs-point-of-sale", "date": "2019-08-15T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Point of Sale Enterprise, LLC", "companyAbout": "ITWERCS was founded in 2016 in Marietta, Georgia, USA.  Their cloud platform was originally launched in 2007 inside a major restaurant brand and provides a robust and comprehensive solution that covers POS, payments, kitchen display systems, scheduling, inventory, marketing & loyalty, and waitlist & reservations. Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of CORVID Paygate", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-corvid-paygate", "date": "2019-06-24T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "CORVID Paygate", "companyAbout": "Paygate was founded in 2016 in Stevenage, Hertfordshire, United Kingdom, Paygate is a premium payment processing software business that provides data validation and services to support automated banking and e-commerce transactions. Paygate is built to take on new and emerging industry standards and regulations such as PSD2, SHA2 and NPA. Paygate provide free software updates to ensure our customers stay compliant and their payments schedules stay on track.Ultra is a specialist international electrical and electronics engineering company. The Group operates predominantly in defence and other highly regulated markets with particular expertise in the maritime, and C3 (command, communication, and control including cyber) domains. Ultra is a Tier 3 equipment/sub-system and Tier 2 systems provider, focused on providing mission-specific, bespoke solutions for its customers.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of BEC Legal Systems", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-bec-legal-systems", "date": "2019-04-16T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.beclegal.com/", "company": "BEC Legal Systems", "companyFounded": "1942", "companyAbout": "BEC Legal Systems was founded in 1942 in Cincinnati, OH, USA, starting out as a vendor of typewriters and re-furbished office equipment.  In 1970 the company began to focus exclusively on the legal market, providing network services, training and consulting for document management, document automation, time and billing, and digital dictation systems. Today, BEC continues to develop software solutions that help law firms organize their cases, manage their dockets and efficiently produce documents, giving attorneys more time to focus on their clients. Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 80,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of mJobTime Corporation", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-mjobtime-corporation", "date": "2019-04-08T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.mjobtime.com/", "company": "mJobTime Corporation", "companyFounded": "1994", "companyAbout": "Founded in 1994 and headquartered in Beaumont, TX, USA, mJobTime provides customizable, scalable time-tracking software to help businesses improve on their processes and efficiencies while decreasing their costs and expenses. mJobTime has received many accolades including being named one of the 50 Hottest Companies by Construtech Magazine, and more recently, being named the Technology Enabler for Construtech Vision award winner, Heico Construction Group. Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of WineFetch, Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-winefetch-inc", "date": "2019-03-15T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "WineFetch", "companyFounded": "2004", "companyAbout": "Founded in 2004 and based in Chapel Hill, NC, USA, WineFetch helps transform traditional brick and mortar wine retailers into savvy online businesses with powerful, data-driven marketing, SEO, and e-commerce tools that increase customer acquisition, retention, and loyalty, resulting in higher sales. WineFetch’s user experience and the interface makes it easy for clients and their customers to use. WineFetch also captures customer data to help retailers better understand their customers and proactively cater to their needs and wants.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the Construction and Club Management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Green 4 Solutions Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-green-4-solutions-ltd", "date": "2019-03-11T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Green 4 Solutions Ltd", "companyFounded": "2006", "companyAbout": "Green 4 was founded at the Ricoh Arena, Coventry in 2006 before moving to their current home in Lutterworth, Leicestershire. Green 4 specialises in providing sports and leisure businesses with a CRM driven approach to ticketing and customer engagement. Built on Microsoft Dynamics CRM, “Go” is a single platform solution that helps organisations create fantastic relationships with their customers through carefully constructed online journeys and the intelligent use of data. Green 4 provides solutions to; Silverstone Circuit, Hollywood Bowl Group, Chill Factore, Aston Villa FC, Celtic FC, Club Atlético River Plate and other well-recognised brands globally.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Happen Business Pty Limited", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-happen-business-pty-limited", "date": "2019-02-13T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Happen Business Pty Limited", "companyFounded": "2001", "companyAbout": "Happen was founded in 2001 in Mortdale, New South Wales, Australia. Happen was established to fill a growing need in the market for a comprehensive accounting and business workflow solution. The company rapidly established a strong following for its Jim2 Business Engine software, and now has an extensive customer base in diverse industries such as managed print, managed services, importing, distribution, sales and service, specialized retailing and manufacturing. Happen’s in-house team of professional consultants, development experts and support engineers are ready and resourced to ensure businesses using Jim2 Business Engine maximize their return on investment.Jonas Software operates over 80 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Leonardo Worldwide", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-leonardo-worldwide-corporation", "date": "2018-11-19T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Leonardo Worldwide Corporation", "companyFounded": "2000", "companyAbout": "Founded in Toronto, Ontario, Canada in 2000, Leonardo helps hotels generate more bookings and revenue, and contributes to better travel experiences by making it easier for guests to select the hotels that meet their needs and expectations. Leonardo’s technology platform lets hotels, hotel chains and management companies showcase their properties and amenities across the web to drive more bookings and revenue. Leonardo has engaged partnerships with global hotel chains, leading travel websites and thousands of hotel properties.An operating group of Constellation Software Inc. (TSX: CSU), Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Minted Box Education Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-minted-box-education-ltd", "date": "2018-10-30T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Minted Box Education Ltd", "companyAbout": "Minted Box was founded in 2009 in Guildford, Surrey, England. Minted Box takes care of developing and maintaining software and websites so you can focus on growing and operating your business to drive revenue and traffic. MINTclass transforms educational institutions and educators by utilizing student information so educators can better understand how to help their students and be more efficient in their lessons.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Greycon Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-greycon-ltd", "date": "2018-10-12T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Greycon Ltd", "companyFounded": "1985", "companyAbout": "Founded in 1985 from the Industrial Systems Group of Imperial College of the University of London, Greycon is the world’s leading provider of production planning, scheduling, forecasting and manufacturing execution systems, which are designed specifically for roll-based & flat sheet industries. Greycon’s founders, Alex Dimitriadis, Prof. Greyham Bryant, and Dr Constantine Goulimis, have taken Greycon throughout the world with 500 sites in over 40 countries. With solutions such as X-Trim, GreyconMill, opt-Studio and Greycon Forecasting, companies can achieve new success and growth like never before.Greycon is the recent recipient of the Queen’s Award for Enterprise in International Trade for their successful overseas expansion.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of TechMate International", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-techmate-international", "date": "2018-08-24T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "TechMate International Inc", "companyFounded": "1989", "companyAbout": "TechMate was founded in Laguna Hills, California, United States in 1989. TechMate provides comprehensive moving storage solutions with leading products such as FirstMate, LoadMate, SalesMate and Android SalesMate. TechMates’s sophisticated solutions help their clients organize and service their business operations, sales and customers more effectively and efficiently.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Chameleon Software Pty Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-chameleon-software-pty-ltd", "date": "2018-08-08T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Chameleon Software Pty Ltd", "companyFounded": "1993", "companyAbout": "Chameleon was founded in Perth, Australia in 1993 and is now run out of Coffs Harbour in New South Wales. Chameleon’s core product, Case Manager, was developed with a goal to provide technology solutions to improve productivity and efficiencies in the rehabilitation industry. Today, Case Manager is more than just a case management tool; with a customer base spreading across Australia, the United States and the United Kingdom, users are enjoying the functionality Case Manager has to offer with a sophisticated information management system incorporating integrated accounting and reporting capabilities.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Ez-Runner Systems Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-ez-runner-systems-ltd", "date": "2018-08-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Ez-Runner Systems Ltd", "companyFounded": "1995", "companyAbout": "Ez-Runner was founded in Copthorne, West Sussex, United Kingdom in 1995. Ez-Runner’s leading software solutions can be tailored to match the needs of the business to help them improve their current operations, streamline their processes and improve their customer’s experience and retention. Teams can focus more on growing the business and deepen their relationships with the customers when supported by Ez-Runner solutions and services.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Acquires Orion Wine Software Inc.", "link": "https://jonassoftware.com/jonas-software-acquires-orion-wine-software-inc", "date": "2018-05-31T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Orion Wine Software Inc", "companyAbout": "Orion offers software solutions to help wineries manage their operational information, enabling them to improve productivity, reduce errors and save money.  Orion’s exceptional commitment to the wine industry and product improvement has established Orion as the first choice for wineries seeking robust software solutions and outstanding service.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of XLerant, Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-xlerant-inc", "date": "2018-03-30T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "XLerant", "companyFounded": "2008", "companyAbout": "XLerant was founded in Stamford, Connecticut, USA in 2008. XLerant provides cloud-based budgeting, forecasting and reporting solutions designed with easy to use interfaces. XLerant’s software-as-a-service (SaaS) solutions serve small to mid-size enterprises who value collaborative environments as an effective way to engage employees and achieve their strategic objectives.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of What Applications Limited", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-what-applications-limited", "date": "2018-02-20T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "What Applications Limited", "companyAbout": "WhatSalon is a mobile marketplace that shows you the hottest salons that are closest to you. You can search by service, enabling you to find a salon in your area that offers exactly what you need. Browse beautiful imagery and read trusted reviews to get a better understanding of the salon before ever booking an appointment.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the fitness, membership, hospitality and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of HavenStar", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-havenstar", "date": "2018-01-12T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Blayhall Marine Limited", "companyAbout": "HavenStar Software Solutions Limited is an enterprise Marina Management System for managing multiple sites and suited for marinas located worldwide, offering full multicurrency transaction processing and reporting. The solution can link with a wide range of accounting systems and other 3rd party applications. Fully integrated add-on modules include Dockside Manager mobile solution; Electronic Point of Sale for chandleries, receptions and fuel docks; and Boatyard Manager for handling electricity and water meters.Jonas Software operates over 75 independently managed software brands around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals from its roots formed in the construction and club management markets. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Pike13 Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-pike13", "date": "2018-01-09T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Pike13", "companyFounded": "2011", "companyAbout": "Pike13 Inc was founded in Seattle, Washington, USA in 2011. Pike13 is a new point of service mobile app that not only takes payments but also helps business owners and staff service clients from anywhere. It is designed specifically for businesses focused on recurring services and automates payments, scheduling and client management.Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. Jonas Software’s reach has grown extensively within the fitness, membership, hospitality, and industrial verticals from its roots formed in the construction and club management markets. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to more than 70,000 customers in 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Bookassist Holdings Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-bookassist", "date": "2017-12-13T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Bookassist Holdings Ltd", "companyAbout": "Founded in Dublin, Ireland in 1999, Bookassist management comprises an expert and award-winning team with decades of experience in scientific and technology research, in the hospitality industry, in internet consultancy and in enterprise-level software development. They have long been recognised as a thought leader, first-mover and innovator in the hospitality technology space with offices in Dublin, Madrid, Rome, Vienna and Prague with resellers worldwide. Bookassist is a trading name and registered trademark of Automatic Netware Limited. Ponterra Business Advisors provided strategic investment banking advice to Bookassist on the transaction.Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From its roots formed in the construction and club management markets, Jonas Software’s reach has grown extensively within the hospitality, fitness and industrial verticals. Today, Jonas Software is proud to supply industry-leading enterprise management software and related services to 20 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of MCR Systems", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-mcr-systems", "date": "2017-11-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "MCR Systems", "companyAbout": "MCR provides hospitality, catering and leisure organizations with enterprise management solutions, which directly improve the efficiency of their business operations. They do this by combining high-quality software, cutting edge EPOS technology and an unrivalled level of experience.Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality, Fitness and Industrial verticals. Today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Innovative Computer Solutions, Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-innovative-computer-solutions", "date": "2017-04-03T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Innovative Computer Solutions", "companyAbout": "ICS is a leading provider of software solutions to the US beer, liquor and wine retail market. ICS’ core product, Vision, provides Point of Sale, Inventory, Purchasing and Reporting solutions for more than 600 retail locations.Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality, Fitness and Industrial verticals. Today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Innosoft Canada Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-innosoft-canada", "date": "2017-03-13T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "InnoSoft Canada", "companyAbout": "InnoSoft is the leading provider of campus recreation management software to the University market in North America with world famous customers such as Wisconsin, Michigan, Western, Waterloo, Notre Dame, Florida, UCLA, Arizona State and many more. Over the years, InnoSoft has built strong products and services to help Colleges and Universities fully manage all aspects of their recreational facilities, so that student, faculty and staff members, as well as selected outside guests, have the ability to utilize facilities and sign up for various activities and leagues.Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. From our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Fitness, Recreation, Hospitality and Industrial verticals. Today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of SignMeUp.com", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-signmeup", "date": "2016-07-04T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "SignMeUp.com Inc", "companyAbout": "SMU is a leading provider of web-based software and services for event registration, membership management and fundraising campaigns. Over the years SMU has built a strong product and service to help clubs, schools, groups, event and race organizers efficiently allow these organizations to automate the process of running their event/club and take payments.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Multi-Systems Inc.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-multi-systems-inc", "date": "2016-04-18T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Multi-Systems Inc", "companyAbout": "MSI is a leading provider of Property Management Software and solutions to the North American Hotel industry. Over the years MSI has built a leadership position in the Mid Tier, Economy and Extended Stay segments of the North American hotel market and works with a number of well know hotel properties and brands. MSI has recently released a true cloud-based PMS solution that is proving to be very popular with both new name prospects and existing clients looking to make the move to the Cloud.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets. "}, {"title": "Jonas Software Announces the Acquisition of Resolve Software Group", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-resolve-software-group", "date": "2016-04-11T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Resolve Software Group Pty Ltd", "companyAbout": "Resolve is a leading provider of Dynamic Case Management Software and solutions for organizations that need to efficiently and effectively handle many cases and complaints while ensuring their customers/constituents are well looked after. Resolve’s products can be used in a wide variety of settings, however, Resolve has built a particularly strong presence in the Government sector. Resolve is known as the leader in the Australian and New Zealand market for assisting numerous government entities (Federal and State) with effectively managing and solving numerous enquiries, concerns and complaints while at the same time ensuring Service Level Agreements are maintained and also reducing overall costs in the Case management process.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 17 vertical markets. "}, {"title": "Jonas Software Announces the Acquisition of ePOS Group Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-epos-group", "date": "2015-12-07T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "ePOS Group Ltd", "companyAbout": "ePOS Group Ltd. (“ePOS”) is a leading provider of software solutions in the UK retail market, with carefully designed and installed POS systems in the retail and hospitality areas (including bars, pubs, convenience, fast food, grocers, restaurants, clubs, hotels, farm-shops and bakeries). They are a trusted partner to thousands of businesses requiring everything from touch terminals to classic till style cash registers.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 15 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of FashionMaster Ltd", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-fashionmaster-ltd", "date": "2015-10-08T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "FashionMaster Ltd. (“FM”),", "companyAbout": "Fashion Master is a leading provider of Enterprise Software solutions into the UK retail market, with a stronger presence and appeal to the fashion end of the market. FM Limited provides integrated IT solutions for Retailing, Wholesaling, Mail Order, E-Commerce, Warehouse Management and Distribution. They include a wide range of businesses including Fashion Clothing, Sportswear, Schoolwear, Bridalwear, Workwear, Footwear, Luggage, Jewellery, Fabric, Homewares, Accessories and many other types of retail and wholesale operations use the solutions.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 15 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of MembersFirst Inc.", "link": "https://jonassoftware.com/jonas-software-acquires-membersfirst", "date": "2015-08-24T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "MembersFirst Inc", "companyAbout": "MembersFirst is an award-winning digital agency & software provider for member-based organizations, including country clubs, yacht clubs, gated community HOAs, alumni associations, and other private recreational clubs. Through extensive in-house services and a strategic network of technology partners, MembersFirst is the only single-source vendor to offer effective web & print design, value-proven marketing services, cinematic video production, and intelligent software that spans the gamut from simple court reservations to enterprise-level performance reporting.Whether your club is small, large, public or fully private, Jonas Software has the right mix of software, communication and service solutions to fit your needs. Worldwide over 2,300 clubs in more than 17 countries, with memberships ranging from 100 to 20,000, utilize Jonas Software to build and enrich member relationships, increase revenues, and decrease costs."}, {"title": "Jonas Software Acquires InReach Continuing Education Solutions", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-inreach-continuing-education-solutions", "date": "2015-07-14T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "InReach", "companyAbout": "InReach is a leading provider of continuing education management solutions. The first and most widely used solution for bringing accredited continuing education (CE) online, InReach technology, services, and experience have helped hundreds of organizations expand their continuing professional education programs beyond in-person events. For more than a decade, the leading providers of continuing medical, financial, and legal education have successfully leveraged InReach to produce, manage, distribute, and profit from successful online CE programs. For more information contact us at Info@InReachCE.com or visit www.InReachCE.com.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 15 vertical markets."}, {"title": "Jonas Software Announces the Acquisition of Apps That Fit LLC – MiGym", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-migym", "date": "2015-05-22T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Apps That Fit LLC “MiGym”", "companyAbout": "Apps That Fit LLC “MiGym” is a leading mobile app provider for the fitness industry in North America. The app allows clubs to provide enhanced convenience, generate additional revenue and increase member retention.Jonas Software operates over 50 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry-leading enterprise management software and related services to 15 vertical markets."}, {"title": "Jonas Software Acquires Show Data Systems Ltd and Interchange Communications Ltd", "link": "https://jonassoftware.com/jonas-software-acquires-show-data-systems-limited-and-interchange-communications-limited", "date": "2015-05-04T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Show Data Systems Ltd and Interchange Communications Ltd", "companyAbout": "Show Data Systems Ltd and Interchange Communications Ltd provide online and front of house registration software and services for consumer, trade and conference events.Jonas Software is the leading provider of enterprise management software solutions to 12 different vertical markets throughout the world. With over 50 distinct brands operating within these 12 vertical markets, Jonas Software is the valued technology partner of over 25,000 customers, in more than 20 countries. Jonas’ vision is to be the branded global leader across the aforementioned 12 vertical markets and be recognized as the trusted provider of Software For Life."}, {"title": "Jonas Software Announces the Acquisition of Outbound Software LLC", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-outbound-software-llc", "date": "2015-03-20T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Outbound Software LLC", "companyAbout": "Outbound Software LLC is an up and coming provider of ticketing and reservation solutions to the North American Attractions market.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa,  Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 12 vertical markets, Jonas boasts over 50 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Announces the Acquisition of Cunningham Cash Registers Limited", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-cunningham-cash-registers-limited", "date": "2014-10-02T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Cunningham Cash Registers Limited", "companyAbout": "CCR is a leading provider of EPoS (Electronic Point of Sale) systems to a number of niche markets in the UK, with a strong presence in education, hospitality, retail and the growing cashless market.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa,  Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 12 vertical markets, Jonas boasts over 50 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Announces the Acquisition of Kitomba", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-kitomba", "date": "2014-09-21T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Kitomba", "companyFounded": "2002", "companyAbout": "With everything we do, we always ask the question ‘how can we do it better?’ to help our customers increase sales, improve customer retention, and meet and exceed their business goals daily, monthly, and yearly. Founded in 2002, Kitomba is driven by its single-mindedness to providing innovative, easy-to-use software and world-class support to salon and spa businesses of all sizes.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa,  Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 11 vertical markets, Jonas boasts 51 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Announces the Acquisition of iSalon Software", "link": "https://jonassoftware.com/jonas-software-announces-the-acquisition-of-isalon-software", "date": "2014-08-26T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "iSalon Software", "companyAbout": "iSalon is a leading provider of Salon Software and Services to businesses throughout the world. iSalon specializes in technology solutions that help salon and spa owners enhance their business processes, sales, and workflow with such tools as staff scheduling, point of sale, online appointment booking, inventory and text messaging.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa,  Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 11 vertical markets, Jonas boasts 50 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Announces Acquisition of 97Display", "link": "https://jonassoftware.com/jonas-software-acquires-97display", "date": "2014-08-14T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "97Display", "companyAbout": "97Display is a leading provider of software and services to the martial arts industry. Their solutions enable martial arts facilities to generate new leads and focus their marketing efforts through various internet-based solutions, including social media strategies, mobile apps, and more.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa, Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 11 vertical markets, Jonas boasts 50 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Club Software Announces Partnership With CSI globalVCard", "link": "https://jonassoftware.com/jonas-club-software-announces-partnership-with-csi-globalvcard", "date": "2014-05-29T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.corporatespending.com/", "company": "", "companyAbout": "For 25 years, CSI Enterprises has provided innovative payment solutions to world-leading brands, while providing the highest level of customer service. The company’s highly secure financial payment products include the globalVCard® virtual payment solutions and award-winning mobile applications, corporate purchasing cards, and business fleet fueling/maintenance payment cards. Businesses rely on CSI’s products to reduce costs and increase profits in all areas of B2B payments, including accounts payable, business travel spending and fuel purchases.Whether your club is small, large, public or fully private, Jonas Club Software has the right mix of Software, Communication and Service solutions to fit your needs. Worldwide over 2,200 clubs in more than 17 countries, with memberships ranging from 100 to 20,000, utilize the Jonas Club Software to build and enrich member relationships, increase revenues, and decrease costs."}, {"title": "Jonas Software Announces Acquisition of PCI Systems Ltd", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-pci-systems-ltd", "date": "2014-05-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "PCI Systems Ltd", "companyFounded": "1981", "companyAbout": "PCI Systems provides integrated IT solutions that have been specifically designed and developed by us for the Metals industry, encompassing stockholders, service centres and processors.We offer a range of software and hardware solutions that are tailored to your company’s individual requirements. We have been doing this successfully since 1981.Our customers range from large multi-site operations to companies specialising in a lower volume bespoke service and are distributed across the country.Jonas Software is the leading provider of enterprise management software solutions to the Club, Leisure Fitness & Sports, Salon & Spa,  Foodservice, Construction, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these 11 vertical markets, Jonas boasts 49 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Announces Acquisition of Retention Management", "link": "https://jonassoftware.com/jonas-software-acquires-retention-management", "date": "2014-01-20T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Retention Management", "companyAbout": "Retention Management specializes in technology solutions that help fitness operators track, engage and retain their members by providing sophisticated tools that keep members informed, motivated and involved, leaving owners free to focus on running and growing their business. Retention Management also provides a very attractive return on investment to its customers as its solutions drive real revenue opportunities for the gym.Jonas Software is the leading provider of enterprise management software solutions to 10 different vertical markets throughout the world. With 47 distinct brands operating within these 10 vertical markets, Jonas Software is the valued technology partner of over 25,000 customers, in over 20 countries. Jonas’ vision is to be the branded global leader across the aforementioned 10 vertical markets and to be recognized as the trusted provider of Software For Life."}, {"title": "Jonas Software Acquires Shortcuts Software Ltd", "link": "https://jonassoftware.com/jonas-software-acquires-shortcuts", "date": "2013-12-02T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Shortcuts Software Ltd", "companyAbout": "Shortcuts is the leading global standard in smart salon technology, working with over 14,000 clients worldwide. Shortcuts solutions are tailored to suit the needs of its clients – from large franchised chains through to single-site businesses in the hair, spa, school and walk-in industries.  Constantly updating its products to meet the changing needs of the market, Shortcuts’ software is supported by the largest research and development team in the industry. Shortcuts’ technologies are currently used in 45 countries around the world.Jonas Software is the leading provider of enterprise management software solutions to 10 different vertical markets throughout the world. With 39 distinct brands operating within these 10 vertical markets, Jonas Software is the valued technology partner of over 25,000 customers, in over 20 countries. Jonas’ vision is to be the branded global leader across the aforementioned 10 vertical markets and to be recognized as the trusted provider of Software For Life."}, {"title": "Jonas Software Acquires Cash Registers (Buccleuch) Limited", "link": "https://jonassoftware.com/jonas-software-acquires-cash-registers-buccleuch-limited", "date": "2013-11-19T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Cash Registers (Buccleuch) Limited", "companyAbout": "With over a million users in 2000 schools throughout the UK, CRB’s secure IMPACT Cashless Catering products have been deployed in the market since 1993. IMPACT enhances the catering operation in Secondary & Primary Schools with each solution designed to meet the particular requirements for each school or local authority. The Company designs build and maintain industry-leading, reliable and functional cashless catering and payment systems providing full service from consultancy, installation, training and launch through to an exceptional after-sales support and maintenance service.Jonas Software is the leading provider of enterprise management software solutions to 10 different vertical markets throughout the world. With 38 distinct brands operating within these 10 vertical markets, Jonas Software is the valued technology partner of over 25,000 customers, in over 15 countries. Jonas’ vision is to be the branded global leader across the aforementioned 10 vertical markets and to be recognized as the trusted provider of Software For Life."}, {"title": "Jonas Software Acquires Nutrition Complete", "link": "https://jonassoftware.com/jonas-software-acquires-nutrition-complete", "date": "2013-08-12T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Nutrition Complete"}, {"title": "Jonas Software Acquires Metalogic", "link": "https://jonassoftware.com/jonas-software-acquires-metalogic", "date": "2013-05-10T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Metalogic", "companyAbout": "Our customers handle every form of material including Coil, Sheet and Plate, Bars, Sections, Meshes, Pipe and Tube, Fittings and Manufactured Components, Billets and Ingots.They also undertake every kind of process that these products are subject to from Decoiling, Slitting and Shearing, through to Plate and Bar Sawing, Profiling, Rolling and all forms of Machining including finishing processes such as Shot Blasting, Painting, Polishing, Poly-Coating and Testing.We offer our customers multi-branch, multi-product, multi-process functionalities and these are installed at every type of metals manufacturing and distribution business. The products are highly scalable and can be efficiently and cost-effectively implemented and supported in businesses ranging from 5 to over 500 users.Jonas Software is the leading provider of enterprise management software solutions to 10 different vertical markets throughout the world. With 37 distinct brands operating within these 10 vertical markets, Jonas Software is the valued technology partner of over 25,000 customers, in over 15 countries. Jonas’ vision is to be the branded global leader across the aforementioned 10 vertical markets and to be recognized as the trusted provider of Software For Life."}, {"title": "Jonas Software Acquires 123Signup", "link": "https://jonassoftware.com/jonas-software-acquires-123signup", "date": "2013-04-05T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "123Signup", "companyAbout": "123Signup’s solutions are transforming the way events and member organizations are managed. Organizations using our system report success doing more events with less staff, collecting faster, providing better member services, and increasing subscribers.Jonas Software is a leading provider of enterprise management software solutions to a number of vertical markets, including a leadership position in the global Fitness, Sports and Leisure vertical. Jonas has over 25,000 customers, in over 15 countries worldwide. Jonas’ vision is to be the branded global leader across the aforementioned ten vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software For Life."}, {"title": "Jonas Software Acquires Club Solutions", "link": "https://jonassoftware.com/jonas-software-acquires-club-solutions", "date": "2013-03-14T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Club Solutions", "companyAbout": "Fiserv, Inc. (NASDAQ: FISV) is a leading global technology provider serving the financial services industry, driving innovation in payments, processing services, risk and compliance, customer and channel management, and business insights and optimization.Jonas Software is a leading provider of enterprise management software solutions to a number of vertical markets, including a leadership position in the global Fitness, Sports and Leisure vertical. Jonas has over 25,000 customers, in over 15 countries worldwide. Jonas’ vision is to be the branded global leader across the aforementioned ten vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software For Life."}, {"title": "Jonas Software Announces Acquisition of LRS Health", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-lrs-health", "date": "2013-03-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "LRS Health", "companyFounded": "1988", "companyAbout": "LRS Health is a leading developer of management, billing and communication software for the healthcare industry. In business for more than 20 years, LRS Health products – which include MediPATH, MediBILL and AllTALK – are used by public and private businesses throughout Australia and the UK.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensingindustries. Within these ten vertical markets, Jonas boasts 32 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Software Acquires London & Zurich PLC", "link": "https://jonassoftware.com/jonas-software-acquires-london-zurich-plc", "date": "2012-11-02T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "London & Zurich Plc", "companyAbout": "London & Zurich PLC is a leading provider of integrated payment collection solutions throughout the United Kingdom, offering a full suite of financial collection and management solutions.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these ten vertical markets, Jonas boasts 31 distinct brands, all of which are respected and longstanding leaders within their own domain.Jonas’ vision is to be the branded global leader across the aforementioned ten vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software for Life and as an ambassador for technology, product innovation, quality, and customer service."}, {"title": "Jonas Software acquires MyMediaBox and enters new Vertical Market", "link": "https://jonassoftware.com/jonas-software-acquires-mymediabox-and-enters-new-vertical-market", "date": "2012-10-19T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "MyMediaBox", "companyAbout": "MyMediaBox is a leading provider of affordable, intuitive and flexible hosted, online business applications (software-as-a-service), for digital asset management, style guide asset delivery and product approvals workflows for the Consumer Products and Television Distribution industries.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, Radiology/Laboratory Information Systems, and Consumer Product Licensing industries. Within these ten vertical markets, Jonas boasts 30 distinct brands, all of which are respected and longstanding leaders within their own domain.Jonas’ vision is to be the branded global leader across the aforementioned ten vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software for Life and as an ambassador for technology, product innovation, quality, and customer service."}, {"title": "Jonas Software Acquires Tucasi Limited", "link": "https://jonassoftware.com/jonas-software-acquires-tucasi", "date": "2012-10-05T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Tucasi Limited", "companyAbout": "Tucasi creates software systems that help schools manage income more effectively. Their systems are designed to reduce workload in the school, create multiple payment options, improve auditability and much more. The Company’s systems have modules for Trips, Dinner Money, Extended Day, Lettings, Online Payments and Communications. Tucasi systems are a fully integrated solution for your school or college.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, and Radiology/Laboratory Information Systems industries. Within these nine vertical markets, Jonas boasts 29 distinct brands, all of which are respected and longstanding leaders within their own domain.Jonas’ vision is to be the branded global leader across the aforementioned nine vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software For Life and as an ambassador for technology, product innovation, quality, and customer service."}, {"title": "Jonas Software Acquires New Century Software Inc", "link": "https://jonassoftware.com/jonas-software-acquires-new-century-software", "date": "2012-06-23T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "New Century Software Inc"}, {"title": "EZFacility Acquires Frontline Solutions", "link": "https://jonassoftware.com/ezfacility-acquires-frontline-solutions", "date": "2012-04-20T00:00:00", "companyUrl": "/our-companies", "company": "Frontline Solutions, LLC", "companyAbout": "EZFacility, a division of Jonas Software, Inc., is a global leader in SaaS-based scheduling, management, membership, billing and financial solutions for health and fitness clubs, sports & recreation facilities, personal training studios, martial arts studios, colleges and universities, and numerous other fitness and sports-based businesses. The company is headquartered in Bethpage, New York, has offices in Pennsylvania, Denver, Vancouver, England and Australia, and supports over 5,500 customer facilities and hundreds of thousands of users in over a dozen countries around the globe. Frontline Solutions, founded in May 1997 and headquartered in Wayne, Pennsylvania, specializes in the development and implementation of software for the rink, sports, recreation and attractions industry. Frontline’s point-of-sale and customer service management software integrates all areas of business operations into one solution. Frontline Solutions offers installation, training, and support services to facilitate the use of its software. Jonas is a leading provider of enterprise management software solutions to a number of vertical markets, including Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, and Radiology/Laboratory Information Systems industries. Within these nine vertical markets, Jonas boasts 28 distinct brands, all of which are respected and longstanding leaders within their own domain.Jonas’ vision is to be the branded global leader across the aforementioned nine vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of “Software For Life” – and as an ambassador for technology, product innovation, quality, and customer service. "}, {"title": "Jonas Software announces acquisition of Kestral Computing Pty Ltd.", "link": "https://jonassoftware.com/jonas-software-announces-acquisition-of-kestral", "date": "2012-04-04T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Kestral Computing Pty Ltd", "companyAbout": " For more than twenty years, Kestral has specialised in providing intuitive, best of breed, Radiology Information System (RIS) and Pathology Laboratory System (LIS) solutions to the Australian and international health industry. Kestral systems are designed, developed, tested, marketed and supported in Australia by a dedicated team of industry professionals who understand both IT and medical systems. Dedicated to innovation, our mission is to provide our clients with the best solution possible, whilst maintaining excellent connectivity and integration with partner systems.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Leisure Fitness & Sports, Attractions, Metal Service Centers, Moving & Storage, Education, and Radiology/Laboratory Information Systems industries. Within these nine vertical markets, Jonas boasts 27 distinct brands, all of which are respected and longstanding leaders within their own domain.Jonas’ vision is to be the branded global leader across the aforementioned nine vertical markets and to be recognized by customers and respective industry stakeholders as the trusted provider of Software For Life and as an ambassador for technology, product innovation, quality, and customer service."}, {"title": "Member Solutions has acquired Volo Innovations", "link": "https://jonassoftware.com/member-solutions-has-acquired-volo-innovations", "date": "2012-03-01T00:00:00", "companyUrl": "http://www.membersolutions.com/", "company": "Volo Innovations", "companyAbout": "Member Solutions has built its business on an unwavering commitment to serving clients in the Martial Arts and related fitness categories. The company operates a propriety payment processing platform and is the leading provider of billing, servicing, and business support to more than 2,500 membership businesses in the United States, Canada, and Australia. The company also offers web-based applications for front-desk member management and online event registration that are fully integrated with its PCI-Compliant payment processing platform.Volo Innovations is a technology developer and vendor of online business management solutions via Software-as-a-Service (SaaS) technology. Founders Nikki Layton and Barry Duncan have translated their combined 20 years of experience in the health and fitness industry into software design that has an inherent respect for real-world situations and practical usability. Volo Innovations is based in Vancouver, Canada."}, {"title": "Jonas Software acquires AMI Education Solutions Ltd", "link": "https://jonassoftware.com/jonas-acquires-ami-education-solutions-ltd", "date": "2012-01-20T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "AMI Education Solutions Ltd"}, {"title": "Jonas Software Acquires Member Solutions", "link": "https://jonassoftware.com/jonas-software-acquires-member-solutions", "date": "2011-07-04T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Youbill Inc"}, {"title": "Jonas Software Acquires Fitronics Ltd.", "link": "https://jonassoftware.com/jonas-software-acquires-fitronics-ltd", "date": "2011-06-08T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Fitronics Ltd", "companyAbout": "The Retention People is the leading researchers in leisure customer retention. We use this research to drive product development into solutions, processes and training packages to improve the customer experience, creating promoters of your brand and increasing customer loyalty. We are a niche business specialising solely in this area and are proud to be the world’s leading provider.Constellation’s common shares are listed on the Toronto Stock Exchange under the symbol “CSU”. Constellation Software is an international provider of market-leading software and services to a number of industries across both the public and private sectors. The Company acquires, manages and builds vertical market software businesses that provide mission-critical software solutions to address the specific needs of its customers in those industries."}, {"title": "Jonas Software Acquires Club Management Assets From Astute Software Solutions Africa", "link": "https://jonassoftware.com/jonas-software-acquires-club-management-assets-from-astute-software-solutions-africa", "date": "2011-04-26T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Astute Software Solutions Africa", "companyAbout": "Club Systems Group Africa is the new owner of the Club Management Assets of Astute Software Solutions which include the Astute club product, the Fareways Boss Light product and the legacy Basis/ NGN club product. Club Systems Group Africa was incorporated to ensure current and future users of these market leading products are well served today and in the future.ASSA develops operational software for niche markets using the Astute Financial and Supply Chain Solution as a core foundation. The component based architecture of this application allows for the reuse of key components in development of custom applications unique to our customers requirements without having to reinvent or recode existing functionality."}, {"title": "Jonas Software acquires Efficient Workflow Systems", "link": "https://jonassoftware.com/jonas-software-acquires-efficient-workflow-systems", "date": "2011-04-15T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Efficient Workflow Solutions LLC"}, {"title": "Jonas Software Acquires Xn Leisure Systems Ltd", "link": "https://jonassoftware.com/jonas-software-acquires-xn-leisure-systems-ltd", "date": "2010-12-01T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Xn Leisure Systems Ltd", "companyAbout": "Constellation’s common shares are listed on the Toronto Stock Exchange under the symbol “CSU”. Constellation Software is an international provider of market-leading software and services to a number of industries across both the public and private sectors. The Company acquires, manages and builds vertical market software businesses that provide mission¬-critical software solutions to address the specific needs of its customers in those industries."}, {"title": "EZFacility Acquires eFit Financial", "link": "https://jonassoftware.com/ezfacility-acquires-efit-financial", "date": "2010-05-11T00:00:00", "companyUrl": "/our-companies", "company": "eFit Financial", "companyAbout": "EZFacility, a division of Jonas Software, Inc., is a global leader in SaaS-based scheduling, management, membership, billing and financial solutions for health and fitness clubs, sports & recreation facilities, personal training studios, colleges and universities, and numerous other fitness and sports-based businesses. The company is headquartered in Bethpage, New York, has offices in England and Australia, and supports over 1,400 customer facilities and 35,000 users in over a dozen countries around the globe. Visit EZFacility on the web at www.ezfacility.com.Jonas Software is the leading provider of enterprise management software solutions to the Club, Foodservice, Construction, Attractions & Leisure, Fitness & Sports, Metal Service Centers, and Moving & Storage industries. Within these seven vertical markets, Jonas boasts 12 distinct brands, all of which are respected and longstanding leaders within their own domain."}, {"title": "Jonas Club Management Announces Strategic Partnership with ClubPay", "link": "https://jonassoftware.com/jonas-club-management-announces-strategic-partnership-with-clubpay", "date": "2010-04-12T00:00:00", "parent": "Jonas Software", "companyUrl": "http://www.clubpayroll.com/", "company": ""}, {"title": "Jonas Software Acquires Centaman Holdings Pty Ltd", "link": "https://jonassoftware.com/jonas-software-acquires-centaman-holdings-pty-ltd", "date": "2010-02-18T00:00:00", "parent": "Jonas Software", "companyUrl": "/our-companies", "company": "Centaman Holdings Pty Ltd. (“Centaman”)"}, {"title": "Jonas Software Announces the Launch of ClubHouse Online e3", "link": "https://jonassoftware.com/jonas-software-announces-the-launch-of-clubhouse-online-e3", "date": "2009-11-03T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.clubhouseonline-e3.com/", "company": ""}, {"title": "Jonas Software acquires EZFacility", "link": "https://jonassoftware.com/jonas-software-acquires-ezfacility", "date": "2009-09-30T00:00:00", "parent": "Jonas Software", "companyUrl": "https://www.ezfacility.com/", "company": "EZFaclility Inc", "companyAbout": ""}]